[{"title":"US and UK pulling some personnel from Qatar military base","link":"https://www.bbc.com/news/articles/c701xywwxw8o?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 21:08:45 GMT","desc":"US officials say it is a \"precautionary measure\" and comes as Donald Trump weighs up whether to take action against Iran.","source":"BBC World"},{"title":"Starlink reportedly made free in Iran - but protesters are taking huge risks by using it","link":"https://www.bbc.com/news/articles/c0r4veg0rrzo?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 18:15:52 GMT","desc":"The satellite technology has become a vital communications lifeline after the government shut down the internet last week.","source":"BBC World"},{"title":"At least 32 killed after crane collapses on train in Thailand","link":"https://www.bbc.com/news/articles/ceqz7v1507ro?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 13:30:31 GMT","desc":"Sixty-four people were left injured, including a one-year-old and an 85-year-old.","source":"BBC World"},{"title":"Trump administration pauses immigrant visa processing for 75 countries","link":"https://www.bbc.com/news/articles/cy7mnzgkp7go?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 18:29:39 GMT","desc":"The pause starting on 21 January will bar foreign nationals who \"would take welfare and public benefits\".","source":"BBC World"},{"title":"US launches phase two of Gaza peace plan with new technocratic government","link":"https://www.bbc.com/news/articles/cjw1nxe5pvlo?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 20:50:09 GMT","desc":"It includes the establishment of a technocratic Palestinian government, as well as the reconstruction and demilitarisation of Gaza, US envoy Steve Witkoff says.","source":"BBC World"},{"title":"Italian influencer Chiara Ferragni cleared of cake fraud","link":"https://www.bbc.com/news/articles/c5yvgz7geyvo?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 17:12:24 GMT","desc":"Chiara Ferragni had been accused of misleading consumers in her promotion of Christmas cakes and Easter eggs.","source":"BBC World"},{"title":"'Appropriate and unambiguous': White House defends Trump over middle-finger gesture at heckler","link":"https://www.bbc.com/news/articles/c62w8exgw1zo?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 20:14:41 GMT","desc":"Thousands of people have sent donations totalling nearly $700,000 (£521,000) to the heckler, who was suspended from his job at Ford.","source":"BBC World"},{"title":"Swiss regions ban pyrotechnics after ski bar fire","link":"https://www.bbc.com/news/articles/cgezqvwr54no?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 16:32:15 GMT","desc":"The blaze is believed to have started when sparklers attached to champagne bottles set foam padding on the ceiling alight.","source":"BBC World"},{"title":"FBI searches home of Washington Post reporter in classified documents probe","link":"https://www.bbc.com/news/articles/cvgp19zx3vjo?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 17:44:49 GMT","desc":"Attorney General Bondi accused the journalist of reporting classified information allegedly leaked by a federal contractor, who she said has been arrested.","source":"BBC World"},{"title":"Amateur stuns world's best to win A$1m in Melbourne","link":"https://www.bbc.com/sport/tennis/articles/ckgyl1ndw57o?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 13:12:45 GMT","desc":"Amateur Jordan Smith is the shock winner of the Million Dollar One Point Slam at the Australian Open, beating reigning men's champion Jannik Sinner along the way.","source":"BBC World"},{"title":"Uganda election chief says he has had threats over results declaration","link":"https://www.bbc.com/news/articles/c62vd7542rno?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 18:18:46 GMT","desc":"This follows comments by a presidential assistant that Bobi Wine would not be declared president, even if he wins.","source":"BBC World"},{"title":"LA opens ticket draw for 2028 Olympics - with seats starting at $28","link":"https://www.bbc.com/news/articles/c5y47pyp906o?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 15:30:09 GMT","desc":"If chosen via the draw, fans will be notified via email and will be given a time slot to purchase tickets in April.","source":"BBC World"},{"title":"Russian doctors arrested after 9 babies die in maternity hospital","link":"https://www.bbc.com/news/articles/cx2wle7028ko?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 12:20:47 GMT","desc":"The newborns died during the long New Year holiday in a Siberian hospital.","source":"BBC World"},{"title":"K-pop drum duet between Japan and South Korea's leaders caps off summit talks","link":"https://www.bbc.com/news/articles/c0lx49z8ly6o?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 06:57:06 GMT","desc":"Leaders of the two East Asian nations played drums to hits from BTS and KPop Demon Hunters.","source":"BBC World"},{"title":"Tehran morgue videos show the brutality of Iran's crackdown on protesters","link":"https://www.bbc.com/news/articles/cly3xpyvxzyo?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 16:58:31 GMT","desc":"Distressing footage reveals nearly 200 bodies with one victim identified as young as 16.","source":"BBC World"},{"title":"Why two Canadian provinces are in a spat over Crown Royal whisky","link":"https://www.bbc.com/news/articles/c8x9v241z2qo?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 20:35:01 GMT","desc":"The UK-owned, Canadian-made whisky is testing a united \"Team Canada\" approach in the face of US tariffs.","source":"BBC World"},{"title":"Dubai chocolate-inspired dessert takes S Korea by storm","link":"https://www.bbc.com/news/articles/c07xdv0mggzo?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 06:41:03 GMT","desc":"Shops are selling hundreds of cookies within minutes as the frenzy sends prices of ingredients surging.","source":"BBC World"},{"title":"No power or water and -19C: Kyiv seeks relief from Russian strikes and cold","link":"https://www.bbc.com/news/articles/cgm4w1g3dggo?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 07:43:06 GMT","desc":"Residents of Ukraine's capital talk about their difficulties keeping warm and enduring power outages, as Russian attacks deepen the energy crisis.","source":"BBC World"},{"title":"Bowen: Authoritarian regimes die gradually then suddenly, but Iran is not there yet","link":"https://www.bbc.com/news/articles/cedwgn4pqv4o?at_medium=RSS&at_campaign=rss","date":"Tue, 13 Jan 2026 16:47:26 GMT","desc":"The regime's opponents will hope for more pressure to accelerate the process, writes the BBC's international editor.","source":"BBC World"},{"title":"Canada's Mark Carney faces delicate balancing act in China visit","link":"https://www.bbc.com/news/articles/c98pj370mjjo?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 00:00:15 GMT","desc":"The PM is seeking to deepen trade and repair ties with China after years of tense relations - without compromising national security or provoking the US.","source":"BBC World"},{"title":"'Welcome to 2976' - North Africa's Amazigh people ring in the new year","link":"https://www.bbc.com/news/articles/cj0nm44g361o?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 00:37:02 GMT","desc":"The Amazigh calendar places them almost a thousand years ahead of much of the rest of the world.","source":"BBC World"},{"title":"'Grim scene': BBC on site after crane collapses on train in Thailand","link":"https://www.bbc.com/news/videos/cd7z8p0nq8jo?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 13:24:59 GMT","desc":"Correspondent Jonathan Head says the 'devastating' accident is an enormous setback for Thailand's efforts to modernise its infrastructure.","source":"BBC World"},{"title":"Trump vows 'very strong action' if Iran executes protesters","link":"https://www.bbc.com/news/videos/c4g0d892p7go?at_medium=RSS&at_campaign=rss","date":"Wed, 14 Jan 2026 09:00:19 GMT","desc":"Relatives of 26-year-old Erfan Soltani, who was detained last week, have told BBC Persian he is due to be executed on Wednesday.","source":"BBC World"},{"title":"What message do Greenlanders have for Trump?","link":"https://www.bbc.com/news/videos/cr57v8y9r77o?at_medium=RSS&at_campaign=rss","date":"Tue, 13 Jan 2026 22:09:42 GMT","desc":"The BBC's Europe editor Katya Adler hears from Greenlanders, whose island is embroiled in a geopolitical storm.","source":"BBC World"},{"title":"'Now there's the threat of executions' in Iran","link":"https://www.bbc.com/news/videos/c87r3122v02o?at_medium=RSS&at_campaign=rss","date":"Tue, 13 Jan 2026 21:11:02 GMT","desc":"An Iranian security official says 2,000 people have been killed so far after a crackdown on weeks of anti-government protests.","source":"BBC World"},{"title":"Mortuary videos show how deadly Iran crackdown has become","link":"https://www.bbc.com/news/videos/c2e134xz2rjo?at_medium=RSS&at_campaign=rss","date":"Mon, 12 Jan 2026 16:45:29 GMT","desc":"BBC Verify has been examining disturbing footage from a mortuary in Tehran, showing scores of bodies. These images could hold clues about what’s happening inside Iran.","source":"BBC World"},{"title":"Watch: Moment skier and dog swept along by avalanche","link":"https://www.bbc.com/news/videos/czx3yn0467ro?at_medium=RSS&at_campaign=rss","date":"Mon, 12 Jan 2026 10:47:51 GMT","desc":"Footage recorded by Spanish skier Ares Masip shows the incident on Pic de l'Hortell, a mountain in Andorra.","source":"BBC World"}]