[{"title":"Court upholds Prop 50, allowing California to use its redrawn congressional maps","link":"https://www.cbsnews.com/news/california-can-proceed-with-redrawn-congressional-maps/","date":"Wed, 14 Jan 2026 16:30:39 -0500","desc":"A panel for the U.S. Central District Court of California ruled Democrats can proceed in using their redrawn congressional maps for the 2026 midterm elections.","source":"CBS News"},{"title":"Judge lets ICE operations in Minnesota continue for now","link":"https://www.cbsnews.com/video/judge-lets-ice-operations-minnesota-continue-for-now/","date":"Wed, 14 Jan 2026 16:25:00 -0500","desc":"A judge on Wednesday declined to issue a temporary restraining order against U.S. Immigration and Customs Enforcement operations in Minnesota. CBS News Minnesota investigative reporter Jonah Kaplan has the details.","source":"CBS News"},{"title":"12/16: The Takeout with Major Garrett","link":"https://www.cbsnews.com/video/121625-the-takeout/","date":"Wed, 14 Jan 2026 16:14:16 -0500","desc":"New &quot;enhanced&quot; video of Brown University shooting suspect released; White House chief of staff Susie Wiles gives candid interview on Trump administration.","source":"CBS News"},{"title":"Watch: Trump takes questions, claims killing of Iran protesters &quot;has stopped&quot;","link":"https://www.cbsnews.com/video/watch-live-trump-takes-questions-says-killing-of-iran-protesters-has-stopped/","date":"Wed, 14 Jan 2026 16:14:00 -0500","desc":"President Trump took questions in the Oval Office Wednesday, speaking about Iran, the economy, Greenland and more. See his remarks.","source":"CBS News"},{"title":"12/8: The Takeout with Major Garrett","link":"https://www.cbsnews.com/video/120825-the-takeout/","date":"Wed, 14 Jan 2026 16:08:58 -0500","desc":"President Trump blasts Marjorie Taylor Greene after her &quot;60 Minutes&quot; interview; Supreme Court hears arguments over firing of FTC commissioner.","source":"CBS News"},{"title":"12/1: The Takeout with Major Garrett","link":"https://www.cbsnews.com/video/120125-the-takeout/","date":"Wed, 14 Jan 2026 16:04:55 -0500","desc":"White House defends second strike on alleged drug boat; New details on National Guard shooting suspect&#039;s mental health.","source":"CBS News"},{"title":"Former U.S. gymnast and proponent of transgender athlete bans weighs in on Supreme Court cases","link":"https://www.cbsnews.com/video/former-us-gymnast-and-proponent-of-transgender-athlete-bans-weighs-in-on-supreme-court-cases/","date":"Wed, 14 Jan 2026 16:00:00 -0500","desc":"Jennifer Sey is a former U.S. gymnast who now runs the company XX-XY Athletics, which supports banning transgender women from competing in women&#039;s sports. Sey joined CBS News to discuss the Supreme Court cases over state laws in West Virginia and Idaho that ban transgender athletes from participating in girls and women&#039;s sports.","source":"CBS News"},{"title":"Trump admin. cuts grants for mental health, addiction treatment programs","link":"https://www.cbsnews.com/news/trump-administration-cuts-grants-mental-health-addiction-treatment/","date":"Wed, 14 Jan 2026 16:00:00 -0500","desc":"The U.S. Substance Abuse and Mental Health Services Administration, SAMHSA, lost around $1.9 billion in federal grants, which were abruptly terminated on Tuesday, a source said.","source":"CBS News"},{"title":"&quot;Fundamental&quot; differences remain over Greenland&#039;s future, Denmark says after U.S. meeting","link":"https://www.cbsnews.com/news/greenland-meeting-vance-rubio-denmark/","date":"Wed, 14 Jan 2026 15:58:00 -0500","desc":"After the meeting, Denmark&#039;s foreign minister said they&#039;re eager to work with the U.S. while respecting the &quot;red lines of the Kingdom of Denmark.&quot;","source":"CBS News"},{"title":"FBI searches home of Washington Post journalist for classified documents","link":"https://www.cbsnews.com/news/fbi-searches-home-of-washington-post-journalist-for-classified-documents-bondi-says/","date":"Wed, 14 Jan 2026 15:51:02 -0500","desc":"The FBI&#039;s search is part of a probe into a federal employee suspected of mishandling classified information, Attorney General Pam Bondi said.","source":"CBS News"},{"title":"Trump says &quot;killing in Iran is stopping,&quot; with &quot;no plan for executions&quot;","link":"https://www.cbsnews.com/news/trump-killing-in-iran-stopped-no-plan-for-executions/","date":"Wed, 14 Jan 2026 15:48:08 -0500","desc":"Potentially thousands have died from the crackdown to quash unrest amid protests.","source":"CBS News"},{"title":"U.S. says it&#039;s moving into next phase of Gaza peace plan, warns Hamas","link":"https://www.cbsnews.com/news/us-next-phase-gaza-ceasefire-plan-steve-witkoff/","date":"Wed, 14 Jan 2026 15:40:08 -0500","desc":"Steve Witkoff said the U.S. expects Hamas to immediately return the final deceased hostage as part of its obligations under the deal.","source":"CBS News"},{"title":"Democratic Rep. Jason Crow contacted by Justice Dept. after video to troops","link":"https://www.cbsnews.com/news/democratic-rep-jason-crow-contacted-by-justice-department-video-to-troops/","date":"Wed, 14 Jan 2026 15:39:00 -0500","desc":"Rep. Jason Crow of Colorado and five other lawmakers appeared in a video that urged U.S. service members to refuse legal orders.","source":"CBS News"},{"title":"Prices for streaming services jumped nearly 20% between November and December, BLS finds","link":"https://www.cbsnews.com/video/prices-for-streaming-services-jumped-nearly-20-between-november-and-december-bls-finds/","date":"Wed, 14 Jan 2026 15:11:00 -0500","desc":"Subscriptions for streaming services saw a nearly 20% jump in prices between November and December, new data from the Labor Department shows. That includes streaming services like Netflix, Disney Plus and Paramount Plus. Alex Weprin, a senior editor for the Holywood Reporter who&#039;s written about the rising prices, joins CBS News to discuss. Paramount Skydance is the parent company of CBS News.","source":"CBS News"},{"title":"Verizon customers report phone service outages across U.S.","link":"https://www.cbsnews.com/news/verizon-customers-report-phone-service-outages-across-u-s/","date":"Wed, 14 Jan 2026 15:06:37 -0500","desc":"A Verizon spokesperson confirmed to CBS News that the company is aware of &quot;an issue impacting wireless voice and data services for some customers.&quot;","source":"CBS News"},{"title":"Apple, Google face pressure to remove X and Grok from their app stores","link":"https://www.cbsnews.com/news/grok-x-advocacy-groups-letter-google-apple/","date":"Wed, 14 Jan 2026 15:01:52 -0500","desc":"Grok faces mounting scrutiny from government officials and advocacy groups after people used the AI chatbot to create sexualized images of minors and women.","source":"CBS News"},{"title":"Verizon cell phone outages reported across U.S.","link":"https://www.cbsnews.com/video/verizon-cell-phone-outages-reported-across-us/","date":"Wed, 14 Jan 2026 14:54:00 -0500","desc":"More than 150,000 Verizon users across the country are experiencing outages. Verizon said, in part, &quot;Our Engineers are engaged and are working to identify and solve the issue quickly.&quot;","source":"CBS News"},{"title":"Vance and Rubio meet with officials from Greenland and Denmark","link":"https://www.cbsnews.com/video/vance-and-rubio-meet-with-officials-from-greenland-and-denmark/","date":"Wed, 14 Jan 2026 14:51:00 -0500","desc":"Vice President JD Vance and Secretary of State Marco Rubio hosted foreign ministers from Greenland and Denmark on Wednesday as President Trump continues to insist on a U.S. takeover of Greenland. CBS News senior White House correspondent Weijia Jiang has more.","source":"CBS News"},{"title":"U.S. reduces some personnel at Qatar airbase as Trump threatens action in Iran","link":"https://www.cbsnews.com/video/us-reduces-some-personnel-at-qatar-airbase-as/","date":"Wed, 14 Jan 2026 14:29:00 -0500","desc":"The U.S. is withdrawing a some personnel from a major U.S. airbase in Qatar as a &quot;precautionary measure,&quot; a U.S. official tells CBS News. Alex Vatanka, senior fellow at the Middle East Institute, joins with his analysis of the situation, and CBS News White House reporter Olivia Rinaldi has the latest on the Trump administration&#039;s plans.","source":"CBS News"},{"title":"Saks Global, century-old high-end department store chain, files for bankruptcy","link":"https://www.cbsnews.com/news/saks-global-bankruptcy-filing/","date":"Wed, 14 Jan 2026 14:19:53 -0500","desc":"The venerable retailer is seeking protection from its creditors after its $2.65 billion purchase of Nieman Marcus failed to spark growth.","source":"CBS News"},{"title":"People help deer stuck on ice and more videos of good Samaritans helping others","link":"https://www.cbsnews.com/video/people-help-deer-stuck-on-ice-and-more-videos-of-good-samaritans-helping-others/","date":"Wed, 14 Jan 2026 14:17:00 -0500","desc":"CBS News&#039; Shanelle Kaul shares some stories of good Samaritans helping others, including people who helped a deer stuck on ice and a man who rescued two toddlers crossing a highway.","source":"CBS News"},{"title":"U.S. used aircraft painted like civilian plane to attack alleged drug boat","link":"https://www.cbsnews.com/news/us-attack-drug-boat-venezuela-painted-civilian-plane/","date":"Wed, 14 Jan 2026 14:10:03 -0500","desc":"The attack on an alleged drug-smuggling boat from Venezuela killed 11 people in September.","source":"CBS News"},{"title":"U.S. used painted aircraft resembling civilian plane in deadly Sept. 2 boat strike, sources say","link":"https://www.cbsnews.com/video/us-used-painted-aircraft-resembling-civilian-plane-in-deadly-sept-2-boat-strike-sources-say/","date":"Wed, 14 Jan 2026 14:08:00 -0500","desc":"The U.S. military used an aircraft painted like a civilian plane during its deadly Sept. 2 attack targeting a boat allegedly transporting drugs, officials say. CBS News Pentagon reporter Eleanor Watson has more.","source":"CBS News"},{"title":"Supreme Court revives congressman&#039;s suit challenging law for late-arriving ballots","link":"https://www.cbsnews.com/news/supreme-court-revives-illinois-congressman-lawsuit-challenging-law-late-arriving-ballots/","date":"Wed, 14 Jan 2026 11:17:29 -0500","desc":"The Supreme Court ruled 7-2 in favor of Illinois Rep. Michael Bost, a Republican.","source":"CBS News"},{"title":"Demand for high-achiever visas fuels pay-to-play market for credentials","link":"https://www.cbsnews.com/news/high-achiever-eb-1a-visas-scientific-research-awards/","date":"Wed, 14 Jan 2026 08:58:00 -0500","desc":"Demand has risen for the EB-1A visa, creating a cottage industry of services for vanity awards, ghostwritten research papers and &quot;profile building&quot; services. USCIS is investigating potential fraud.","source":"CBS News"},{"title":"White House defends Trump after he appeared to flip off heckler","link":"https://www.cbsnews.com/news/white-house-trump-flipped-off-heckler-f-you-ford-plant/","date":"Wed, 14 Jan 2026 06:50:00 -0500","desc":"The White House defended a video that appeared to show President Trump flipping off a person who yelled at him while touring a Ford factory in Michigan on Tuesday.","source":"CBS News"},{"title":"ACA enrollment sinks sharply as coverage costs soar in 2026","link":"https://www.cbsnews.com/news/aca-subsidies-tax-credits-health-insurance/","date":"Tue, 13 Jan 2026 15:33:20 -0500","desc":"Roughly 1.4 million fewer Americans have signed up for an Affordable Care Act plan as expiring tax breaks drive up premiums.","source":"CBS News"},{"title":"Feds sending more agents into Mpls., days after killing of Renee Good","link":"https://www.cbsnews.com/live-updates/minneapolis-renee-good-ice-shooting-more-federal-agents/","date":"Tue, 13 Jan 2026 11:12:00 -0500","desc":"Families of people who have been killed by law enforcement in Minnesota gathered Monday to extend their support to Renee Good&#039;s family, less than a week after the 37-year-old was shot and killed by an ICE agent.","source":"CBS News"},{"title":"Family of Renee Good says she was &quot;relentlessly hopeful and optimistic&quot;","link":"https://www.cbsnews.com/live-updates/minneapolis-renee-good-ice-shooting-minnesota-bca-investigation/","date":"Sun, 11 Jan 2026 21:20:00 -0500","desc":"The family of Renee Good said in a written statement that she was &quot;the beautiful light of our family and brought joy to anyone she met.&quot;","source":"CBS News"}]