[{"title":"Trump, Denmark have &apos;fundamental disagreement&apos; over Greenland but will keep talking, officials say","link":"https://www.cnbc.com/2026/01/14/denmark-greenland-trump-white-house.html","date":"Wed, 14 Jan 2026 19:43:20 GMT","desc":"Officials from Denmark and Greenland held a news conference after meeting with Trump administration officials.","source":"CNBC World"},{"title":"Russia watches as ally Iran edges closer to collapse. Here&apos;s why it matters for Moscow","link":"https://www.cnbc.com/2026/01/14/russia-iran-unrest-collapse-trump-moscow.html","date":"Wed, 14 Jan 2026 17:51:44 GMT","desc":"The prospect of another ally falling in the Middle East will be a worrying one for Moscow, particularly after it has seen other alliances collapse recently.","source":"CNBC World"},{"title":"Trump&apos;s war on the Fed threatens global financial stability, European central bankers warn","link":"https://www.cnbc.com/2026/01/14/trump-threat-war-fed-powell-financial-stability-economy-banks-attack-federal-reserve-risk.html","date":"Wed, 14 Jan 2026 14:58:35 GMT","desc":"European central bankers said an \"obedient\" Fed under White House control would be \"extremely grave\" for global financial stability.","source":"CNBC World"},{"title":"Why the stock market keeps shrugging as Trump sows more political chaos","link":"https://www.cnbc.com/2026/01/14/stock-market-investor-powell-fed-sell-america.html","date":"Wed, 14 Jan 2026 16:12:39 GMT","desc":"The market rebounded back to all-time highs Monday despite the probe.","source":"CNBC World"},{"title":"Senate expected to vote on Venezuela war powers resolution on Wednesday","link":"https://www.cnbc.com/2026/01/14/senate-venezuela-war-powers-resolution-.html","date":"Wed, 14 Jan 2026 17:26:33 GMT","desc":"The Trump administration is lobbying senators to kill the measure.","source":"CNBC World"},{"title":"Supreme Court tariff ruling: It&apos;s not just about refunds. Volume of U.S. freight trade could hinge on decision","link":"https://www.cnbc.com/2026/01/14/supreme-court-trump-tariffs-decision.html","date":"Wed, 14 Jan 2026 19:55:29 GMT","desc":"Logistics experts tell CNBC that freight shipping container trade could see a bump if the Supreme Court rules President Trump's IEEPA tariffs are illegal.","source":"CNBC World"},{"title":"Big Tech is poaching energy talent to fuel its AI ambitions","link":"https://www.cnbc.com/2026/01/14/big-tech-google-microsoft-energy-hiring-ai.html","date":"Wed, 14 Jan 2026 06:10:40 GMT","desc":"Hires of energy-related talent by Big Tech was 30% higher in 2025 than pre-AI levels.","source":"CNBC World"},{"title":"Trump’s latest geopolitical gambits all lead back to China","link":"https://www.cnbc.com/2026/01/14/greenland-venezuela-iran-us-china-power-struggle-rare-earths-critical-minerals-energy.html","date":"Wed, 14 Jan 2026 13:07:32 GMT","desc":"President Donald Trump's international interventions may all come down to one thing: China and its dominance of critical minerals.","source":"CNBC World"},{"title":"Tariffs and AI&apos;s downside pose top global risks for business, World Economic Forum says","link":"https://www.cnbc.com/2026/01/14/world-economic-forum-2026-global-risks-report.html","date":"Wed, 14 Jan 2026 12:25:40 GMT","desc":"The report captures a shifting landscape where geoeconomic confrontation leaps to the top spot on the list of business worries over the next two years","source":"CNBC World"},{"title":"Bank of America tops estimates on better-than-expected net interest income, equities trading","link":"https://www.cnbc.com/2026/01/14/bank-of-america-bac-q4-2025-earnings.html","date":"Wed, 14 Jan 2026 14:39:42 GMT","desc":"Bank of America, the second-largest U.S. bank by assets, has been a beneficiary of the industry's recent tail winds.","source":"CNBC World"},{"title":"How activist investors plan to take on Big Oil at the 2026 AGM season","link":"https://www.cnbc.com/2026/01/14/oil-energy-shell-bp-green-investors-agm-season.html","date":"Wed, 14 Jan 2026 12:08:24 GMT","desc":"In its newly revised strategy, Dutch group Follow This said it would will focus on the financial risks associated with declining oil and gas demand.","source":"CNBC World"},{"title":"Citigroup tops estimates on stronger net interest income, smaller loan loss provision","link":"https://www.cnbc.com/2026/01/14/citigroup-c-earnings-q4-2025.html","date":"Wed, 14 Jan 2026 17:13:08 GMT","desc":"Under CEO Jane Fraser, Citigroup is in the midst of a restructuring, selling off parts of its overseas operations.","source":"CNBC World"},{"title":"Greenland&apos;s PM has a blunt message for Trump: &apos;We choose Denmark&apos; over the U.S.","link":"https://www.cnbc.com/2026/01/13/greenland-denmark-trump-nielsen-frederiksen.html","date":"Tue, 13 Jan 2026 17:03:32 GMT","desc":"U.S., Danish and Greenlandic officials are set to hold crunch talks at the White House on Wednesday.","source":"CNBC World"},{"title":"European stocks close higher as focus shifts to Greenland talks; BP warns of $5 billion impairment charge","link":"https://www.cnbc.com/2026/01/14/european-markets-live-stoxx-600-dax-cac-ftse-greenland-talks.html","date":"Wed, 14 Jan 2026 16:45:14 GMT","desc":"European stocks ended higher on Wednesday as investors in the region focused on a meeting between U.S. and Danish officials to discuss Greenland.","source":"CNBC World"},{"title":"Saks Global, the longtime leader of luxury department stores, files for bankruptcy protection","link":"https://www.cnbc.com/2026/01/14/saks-global-files-for-bankruptcy-protection.html","date":"Wed, 14 Jan 2026 17:53:01 GMT","desc":"Saks Global, which also owns Neiman Marcus and Bergdorf Goodman, filed for bankruptcy protection after running out of cash.","source":"CNBC World"},{"title":"CNBC&apos;s The China Connection newsletter: Battle for the recovering luxury market heats up","link":"https://www.cnbc.com/2026/01/14/cnbc-china-connection-newsletter-battle-for-the-recovering-luxury-market-heats-up.html","date":"Wed, 14 Jan 2026 09:21:18 GMT","desc":"Louis Vuitton’s newest Beijing store opened with celebrity buzz but little fanfare, underscoring how luxury brands are cautiously testing signs of a consumer recovery in China.","source":"CNBC World"},{"title":"CNBC Daily Open: Worries over Iran and Fed independence weigh on markets","link":"https://www.cnbc.com/2026/01/14/cnbc-daily-open-worries-over-iran-and-fed-independence-weigh-on-markets.html","date":"Wed, 14 Jan 2026 07:40:37 GMT","desc":"U.S. President Donald Trump said Tuesday that he had \"cancelled all meetings with Iranian Officials.\"","source":"CNBC World"},{"title":"South Korea&apos;s special prosecutor seeks death penalty for ex-President Yoon over martial law bid","link":"https://www.cnbc.com/2026/01/14/south-korea-special-prosecutor-seek-death-penalty-former-president-yoon-martial-law.html","date":"Wed, 14 Jan 2026 02:34:00 GMT","desc":"If Yoon is sentenced to death, it will be the first execution South Korea has carried out in almost 30 years.","source":"CNBC World"},{"title":"A major development in Trump&apos;s Fed feud is set to happen next week in the Supreme Court","link":"https://www.cnbc.com/2026/01/13/a-major-development-in-trumps-fed-feud-is-set-to-happen-next-week-in-the-supreme-court.html","date":"Wed, 14 Jan 2026 18:17:29 GMT","desc":"Supreme Court arguments on Jan. 21 will likely be the next big development for the central bank's quest to maintain independence.","source":"CNBC World"},{"title":"CNBC&apos;s UK Exchange newsletter: The battle for Britain’s investment trusts","link":"https://www.cnbc.com/2026/01/14/cnbcs-uk-exchange-newsletter-the-battle-for-britains-investment-trusts.html","date":"Wed, 14 Jan 2026 06:30:01 GMT","desc":"The investment trust sector in the U.K. is being targeted by one of Wall Street’s most famous activist investors — putting some well-known names at risk.","source":"CNBC World"},{"title":"China&apos;s annual trade surplus hits a record $1.2 trillion, even as exports to U.S. decline by 20%","link":"https://www.cnbc.com/2026/01/14/china-trade-data-surplus-exports-imports-december-tariffs-tensions.html","date":"Wed, 14 Jan 2026 07:50:52 GMT","desc":"China's exports growth in December sharply beat expectations, catapulting the annual trade surplus to a record high.","source":"CNBC World"},{"title":"Japanese stocks hit another record high as expectations of snap poll rise","link":"https://www.cnbc.com/2026/01/14/asia-pacific-nikkei-225-japan-takaichi-election-record.html","date":"Wed, 14 Jan 2026 08:03:15 GMT","desc":"This comes as Japan's ruling LDP under Prime Minister Sanae Takaichi is expected to call an election in February.","source":"CNBC World"},{"title":"Trump’s tariff gambit over Iran risks derailing U.S.–China trade deal","link":"https://www.cnbc.com/2026/01/13/trumps-tariff-iran-25-us-china-trade-deal.html","date":"Tue, 13 Jan 2026 23:55:58 GMT","desc":"President Donald Trump's threat of 25% tariffs on countries doing business with Iran has raised the risk of derailing Washington's fragile trade deal with Beijing.","source":"CNBC World"},{"title":"Trump attacks Powell again amid Fed independence fears: &apos;That jerk will be gone soon&apos;","link":"https://www.cnbc.com/2026/01/13/trump-powell-fed-dimon-pirro-doj.html","date":"Wed, 14 Jan 2026 12:49:06 GMT","desc":"JPMorgan Chase CEO Jamie Dimon defended the Fed's independence amid the probe of Powell by Trump's DOJ, echoing Republicans' criticisms.","source":"CNBC World"},{"title":"Meta&apos;s VR layoffs, studio closures underscore Zuckerberg&apos;s massive pivot to AI","link":"https://www.cnbc.com/2026/01/13/meta-lays-off-vr-employees-underscoring-zuckerbergs-pivot-to-ai.html","date":"Wed, 14 Jan 2026 01:21:22 GMT","desc":"Meta began laying off employees in its Reality Labs division focused on virtual reality and shut down several VR studios as it pushes resources towards AI.","source":"CNBC World"},{"title":"Global central bankers unite in defense of Fed Chair Jerome Powell","link":"https://www.cnbc.com/2026/01/13/jerome-powell-defended-european-central-bankers.html","date":"Tue, 13 Jan 2026 13:31:33 GMT","desc":"Global central bankers issued a statement Tuesday defending U.S. Federal Reserve Chair Jerome Powell following the launch of a criminal investigation into the central bank chief.","source":"CNBC World"},{"title":"What Trump’s Venezuela intervention means for Guyana’s vast oil wealth","link":"https://www.cnbc.com/2026/01/12/oil-trump-venezuela-guyana-essequibo-territorial-dispute.html","date":"Mon, 12 Jan 2026 07:07:47 GMT","desc":"Venezuela's Maduro had adopted an increasingly aggressive stance toward the disputed Essequibo region in recent years.","source":"CNBC World"},{"title":"Alibaba-backed PixVerse launches real-time AI video tool, top executive tells CNBC","link":"https://www.cnbc.com/2026/01/13/alibaba-backed-pixverse-real-time-ai-video-generation-tool-investors-startup-openai-sora.html","date":"Wed, 14 Jan 2026 04:42:23 GMT","desc":"Co-founder Jaden Xie told CNBC that the company is about to close another financing round, after raising $100 million in the last 6 months.","source":"CNBC World"},{"title":"December core consumer prices rose at a 2.6% annual rate, less than expected","link":"https://www.cnbc.com/2026/01/13/cpi-inflation-report-december-2026.html","date":"Tue, 13 Jan 2026 16:22:01 GMT","desc":"Excluding volatile food and energy prices, the consumer price index showed a seasonally adjusted 0.2% gain on a monthly basis and 2.6% annually.","source":"CNBC World"},{"title":"Boeing outsold Airbus last year for first time since 2018, deliveries rise to 600","link":"https://www.cnbc.com/2026/01/13/boeing-orders-deliveries.html","date":"Tue, 13 Jan 2026 17:37:18 GMT","desc":"Boeing delivered 600 jetliners in 2025 with 63 in December alone, while net orders rose to 1,173 planes.","source":"CNBC World"}]