[{"title":"Android 16 QPR3 Beta 2 Just Released for Pixel Phones","link":"https://www.droid-life.com/2026/01/14/android-16-qpr3-beta-2-just-released-for-pixel-phones/","date":"Wed, 14 Jan 2026 21:20:24 +0000","desc":"Google has released Android 16 QPR3 Beta 2 for all of its still-supported Pixel phones, tablets, and foldables. After releasing Android 16 QPR2 to stable in December, Google quickly released the next beta update as Android 16 QPR3 for beta testers to begin playing with. Now that we&#8217;ve had that initial build (and minor update) &#8230; Continued Read the original post: Android 16 QPR3 Beta 2 Just Released for Pixel Phones","source":"Droid Life"},{"title":"Verizon Outage Spreads Across US (Updated)","link":"https://www.droid-life.com/2026/01/14/verizon-outage-spreads-across-us/","date":"Wed, 14 Jan 2026 20:15:46 +0000","desc":"A Verizon outage has taken out service to several areas in the US. Taking a look across the internet this morning reveals a major Verizon service outage throughout the US. Checking places like reddit or Downdetector show that there were hundreds of thousands of reports shortly after 9AM Pacific (12MP Eastern). Hotspots of outages include &#8230; Continued Read the original post: Verizon Outage Spreads Across US (Updated)","source":"Droid Life"},{"title":"T-Mobile&#8217;s New Better Value Plan Goes Live: Should You Switch?","link":"https://www.droid-life.com/2026/01/14/t-mobiles-new-better-value-plan-goes-live-should-you-switch/","date":"Wed, 14 Jan 2026 17:53:42 +0000","desc":"T-Mobile announced is new Better Value plan last week and that plan is now available for those with 3 lines or more. The T-Mobile &#8220;Better Value&#8221; plan that was first introduced last week has gone live on their website. This is a plan that appears to have been built specifically for Verizon or AT&#38;T customers &#8230; Continued Read the original post: T-Mobile&#8217;s New Better Value Plan Goes Live: Should You Switch?","source":"Droid Life"},{"title":"Google Just Gave Gemini &#8220;Personal Intelligence&#8221;","link":"https://www.droid-life.com/2026/01/14/google-just-gave-gemini-personal-intelligence/","date":"Wed, 14 Jan 2026 16:00:12 +0000","desc":"Google&#8217;s Gemini now has Personal Intelligence and can reason across your data, assuming you give it access. For AI as an assistant to be any good, it probably needs to know almost everything about you. In order to know everything, well, AI is going to need access to a big chunk of your digital life, &#8230; Continued Read the original post: Google Just Gave Gemini &#8220;Personal Intelligence&#8221;","source":"Droid Life"},{"title":"Google Photos &#8220;Ask&#8221; Search Still Has a Lot of Haters","link":"https://www.droid-life.com/2026/01/13/google-photos-ask-search-still-has-a-lot-of-haters/","date":"Tue, 13 Jan 2026 21:51:24 +0000","desc":"A little over a year ago, Google introduced us to &#8220;Ask Photos,&#8221; a change to its search capabilities that attempted to use AI to allow for more natural search queries and the potential for more robust results. Unfortunately for Google, by June of last year, they had to pause its rollout because feedback from users &#8230; Continued Read the original post: Google Photos &#8220;Ask&#8221; Search Still Has a Lot of Haters","source":"Droid Life"},{"title":"Verizon Convinces FCC to Kill Its 60-Day Phone Unlocking Rule and That&#8217;s Bad","link":"https://www.droid-life.com/2026/01/13/verizon-convinces-fcc-to-kill-its-60-day-phone-unlocking-rule-and-thats-bad/","date":"Tue, 13 Jan 2026 19:03:49 +0000","desc":"Verizon no longer has to automatically unlock your phone after 60 days and their new unlock policy could be anything, thanks to a new waiver by the FCC. During the height of its struggles to keep postpaid customers around in May of 2025, Verizon asked the FCC to get rid of a requirement that forced &#8230; Continued Read the original post: Verizon Convinces FCC to Kill Its 60-Day Phone Unlocking Rule and That&#8217;s Bad","source":"Droid Life"},{"title":"Google Wallet for Android Finally Gets Complete Transaction History","link":"https://www.droid-life.com/2026/01/13/google-wallet-transaction-history/","date":"Tue, 13 Jan 2026 17:22:55 +0000","desc":"Checking complete transaction history for Google Wallet means taking a trip to the website, with history currently limited to only the last 10 purchases inside of the dedicated Android app. That appears to be changing. Inside of a changelog for Google Play Services (which includes Wallet) that we wrote up this week it shows, &#8220;You &#8230; Continued Read the original post: Google Wallet for Android Finally Gets Complete Transaction History","source":"Droid Life"},{"title":"Pixel 10a Hitting Online Retailers With February Launch Date","link":"https://www.droid-life.com/2026/01/13/pixel-10a-hitting-online-retailers-with-february-launch-date/","date":"Tue, 13 Jan 2026 16:41:58 +0000","desc":"The Pixel 10a could launch very soon in some new colors. After surprising us a bit with a March launch of the Pixel 9a last year, Google could be ready to bring us its successor even earlier. The Pixel 10a has started popping up on international retailers with colors, storage options, and a date we &#8230; Continued Read the original post: Pixel 10a Hitting Online Retailers With February Launch Date","source":"Droid Life"},{"title":"Google Play Services Updated With New Features","link":"https://www.droid-life.com/2026/01/12/google-play-services-updated-with-new-features/","date":"Mon, 12 Jan 2026 22:45:09 +0000","desc":"There&#8217;s a fresh Google Play Services update headed to devices, with a few new features inbound for the Android ecosystem, as well as a new Google Play store feature. Google notes new developer features for Google and third-party app developers to support Location and Context processes, updates to system management services, ability to view Google &#8230; Continued Read the original post: Google Play Services Updated With New Features","source":"Droid Life"},{"title":"Not Many, But Important Bug Fixes for Pixels in January Patch","link":"https://www.droid-life.com/2026/01/12/january-security-bugs-changelog/","date":"Mon, 12 Jan 2026 20:58:37 +0000","desc":"Google has posted the changelog for January&#8217;s Pixel update. Unlike other months, there may not be countless fixes, but we still a few important ones. For example, there&#8217;s a fix for a battery drain issue that affected select models, a fix for an AOD flicker, as well as a fix for the touchscreens that would &#8230; Continued Read the original post: Not Many, But Important Bug Fixes for Pixels in January Patch","source":"Droid Life"},{"title":"Pixel 6 and Pixel 7 Updates are Missing: Here&#8217;s What is Happening With Your Pixel","link":"https://www.droid-life.com/2026/01/12/pixel-6-pixel-7-updates-schedule-missing/","date":"Mon, 12 Jan 2026 19:34:05 +0000","desc":"The expected Pixel update schedule has changed in recent months for the Pixel 6 and Pixel 7 series. Both the Pixel 6 and Pixel 7 series of phones should still be supported through 2026, 2027, and beyond, we&#8217;re just starting to question what the cadence for updates will be going forward. I bring this up &#8230; Continued Read the original post: Pixel 6 and Pixel 7 Updates are Missing: Here&#8217;s What is Happening With Your Pixel","source":"Droid Life"},{"title":"2026 January Pixel Update Available for Your Pixel Phone","link":"https://www.droid-life.com/2026/01/12/january-2026-google-pixel-update-download/","date":"Mon, 12 Jan 2026 19:13:57 +0000","desc":"We&#8217;ve entered 2026 and the first Google Pixel update of the year is here. For those with a still-supported Pixel phone or tablet or foldable, it&#8217;s time to grab the January Pixel update. For this January Pixel update, Google is pushing new builds to Pixel 7a up through the new Pixel 10 series. All Pixel &#8230; Continued Read the original post: 2026 January Pixel Update Available for Your Pixel Phone","source":"Droid Life"},{"title":"Google Home Gets Fresh Set of Conditions and Actions for Improved Automation","link":"https://www.droid-life.com/2026/01/12/google-home-new-actions/","date":"Mon, 12 Jan 2026 18:20:53 +0000","desc":"Google Home is getting a fresh set of starters/conditions and actions this week. These additions should make the idea of automation a bit easier for users. For example, you can now turn on your coffee machine, arm a security system, and control your robot vacuum. Naturally, you&#8217;ll need devices that support these actions and starters/conditions, &#8230; Continued Read the original post: Google Home Gets Fresh Set of Conditions and Actions for Improved Automation","source":"Droid Life"},{"title":"Apple to Use Gemini to Power New Features on iPhone","link":"https://www.droid-life.com/2026/01/12/apple-to-use-gemini-to-power-new-features-on-iphone/","date":"Mon, 12 Jan 2026 17:35:34 +0000","desc":"Google and Apple released a joint statement today, announcing a multi-year collab which will bring Gemini to Apple&#8217;s ecosystem. The collaboration will have Gemini models and cloud technology be the base of the next-gen Apple Foundation Models. That means Gemini will power &#8220;future Apple Intelligence features,&#8221; including a more personalized Siri coming this year. If &#8230; Continued Read the original post: Apple to Use Gemini to Power New Features on iPhone","source":"Droid Life"},{"title":"Galaxy S25 Sales Going Up When It Should Be Going Down","link":"https://www.droid-life.com/2026/01/12/galaxy-s25-sales-going-up-when-it-should-be-going-down/","date":"Mon, 12 Jan 2026 17:09:23 +0000","desc":"There&#8217;s something funky going on with Samsung&#8217;s Galaxy S25 series sales numbers. As one might imagine, after the first few months of availability, demand tends to always tick in a downward line as we approach the launch of a new series. This has been the case dating back to at least the Galaxy S10 series. &#8230; Continued Read the original post: Galaxy S25 Sales Going Up When It Should Be Going Down","source":"Droid Life"}]