[{"title":"Verizon outage: Voice and data services down for many customers","link":"https://www.engadget.com/big-tech/verizon-outage-voice-and-data-services-down-for-many-customers-183048956.html?src=rss","date":"Wed, 14 Jan 2026 21:20:51 +0000","desc":"Verizon’s network appears to be having technical issues that are impacting calls and wireless data. Verizon customers on X have reported seeing “SOS” rather than the traditional network bars on their smartphones, and even the network provider’s own status page struggled to load, likely due to the number of customers trying to access it. Based on the experience of Verizon users on Engadget’s staff, the services that are impacted appear to be calls and wireless data. Text messages continue to be delivered normally, at least for some users. On DownDetector , reports of a Verizon outage started growing around 12PM ET and numbered in the hundreds of thousands at their peak. DownDetector also shows spikes in outage reports on competing networks like AT&T and T-Mobile , but in terms of magnitude, they’re much smaller than the issue Verizon is facing. For example, Verizon peaked at 181,769 reports, while AT&T’s was just 1,769 reports. The difference between the two is great enough that those AT&T reports could be from people trying to contact Verizon customers and thinking that their personal network was the problem. We are aware of an issue impacting wireless voice and data services for some customers. Our engineers are engaged and are working to identify and solve the issue quickly. We understand how important reliable connectivity is and apologize for the inconvenience. — Verizon News (@VerizonNews) January 14, 2026 In a post on the cell provider’s news account on X, Verizon acknowledged the issues with its network. “We are aware of an issue impacting wireless voice and data services for some customers,” Verizon wrote. “Our engineers are engaged and are working to identify and solve the issue quickly. We understand how important reliable connectivity is and apologize for the inconvenience.” Based on DownDetector’s map of outage reports , issues with Verizon’s network appear to be concentrated in major cities in the eastern United States. The majority of reports appear to be coming out of Boston, New York and Washington DC, though the map also shows hot spots in Chicago, San Francisco and Los Angeles. Verizon engineering teams are continuing to address today&#39;s service interruptions. Our teams remain fully deployed and are focused on the issue. We understand the impact this has on your day and remain committed to resolving this as quickly as possible. — Verizon News (@VerizonNews) January 14, 2026 At 2:14PM ET, Verizon shared on X that its engineering teams “remain fully deployed” to work on fixing the outage. The company didn’t share when the issue would resolved or how many of its customers are currently impacted. Reports on DownDetector have dropped since their peak at 12:43PM ET, but thousands of Verizon customers are still noticing issues with the service. As of 3:09PM ET, Verizon has yet to share more information about the recovery of the company’s cell network. Some Verizon customers on X have noticed their cell service returning, but it’s not clear if this means the network’s technical issues have been fixed. At 4:06PM ET, nearly two hours since the company’s last statement, at least one member of Engadget’s staff reports their service has been restored. The connectivity issues are still affecting Verizon customers, however. DownDetector received over 55,000 outage reports as recently as 3:47PM ET. Verizon&#39;s team is on the ground actively working to fix today’s service issue that is impacting some customers. We know this is a huge inconvenience, and our top priority is to get you back online and connected as fast as possible. We appreciate your patience while we work to… — Verizon News (@VerizonNews) January 14, 2026 Verizon posted at 4:12PM ET that work continues on addressing the outage, but the issue hasn’t been completely fixed. According to the company, its team is “on the ground actively working to fix today’s service issue that is impacting some customers.” Both T-Mobile and AT&T have confirmed that their networks are unaffected by the issues facing their competitor. In a post on X, T-Mobile shared that its network is “operating normally and as expected.” Meanwhile, AT&T says that for any of its customers experiencing issues, “it’s not us...it’s the other guys.” Verizon’s last major outage was in September 2024, when the company’s network dealt with connectivity issues that lasted for several hours. That outage similarly impacted users ability to make calls. This is a developing story. Our team will make frequent updates as more news occurs… This article originally appeared on Engadget at https://www.engadget.com/big-tech/verizon-outage-voice-and-data-services-down-for-many-customers-183048956.html?src=rss","source":"Engadget"},{"title":"Ryan Hurst cast as Kratos for live-action God of War show","link":"https://www.engadget.com/entertainment/tv-movies/ryan-hurst-cast-as-kratos-for-live-action-god-of-war-show-211655396.html?src=rss","date":"Wed, 14 Jan 2026 21:16:55 +0000","desc":"Amazon&#39;s upcoming God of War live-action TV adaptation has cast Ryan Hurst as its Kratos. Sony announced the casting today on X with a brief post and an image of both Hurst and Kratos in full scowl mode. Hurst is already sporting a very Kratos-style beard, so he&#39;s already got the right vibe going for him. He has past credits on familiar shows such as Sons of Anarchy and The Walking Dead . The upcoming Amazon series also isn&#39;t his first rodeo acting in this universe; Hurst voiced Thor in the video game God of War Ragnarok . But the most important question with this casting news is whether Hurst will even try to match Christopher Judge&#39;s spectacular delivery of that single, essential word: &quot;Boy.&quot; Because is it even God of War without that signature line? Meet Ryan Hurst, your Kratos in the God of War series coming to Prime Video. pic.twitter.com/OPwXk2v1Hx — Sony (@Sony) January 14, 2026 Loads of video games have been getting the TV treatment in the past few years, and several of the translations have been pretty dang excellent. That trend may be boosted by the increasingly cinematic nature of AAA gaming, but getting the right team behind and in front of the camera can also improve how successful the adaptation is. The involvement of Todd Howard in the Fallout show and Neil Druckmann in The Last of Us surely helped those shows stay true to the heart of their souce material. Sony first revealed that God of War was getting a television series back in 2022, although the showrunner and several executive producers departed the project in 2024 as the project took &quot;a different creative direction.&quot; The famed Ronald D. Moore ( Battlestar Galactica , For All Mankind ) took over as showrunner later in 2024. This article originally appeared on Engadget at https://www.engadget.com/entertainment/tv-movies/ryan-hurst-cast-as-kratos-for-live-action-god-of-war-show-211655396.html?src=rss","source":"Engadget"},{"title":"The best VPN deals: Up to 88 percent off ProtonVPN, Surfshark, ExpressVPN, NordVPN and more","link":"https://www.engadget.com/deals/the-best-vpn-deals-up-to-88-percent-off-protonvpn-surfshark-expressvpn-nordvpn-and-more-120056445.html?src=rss","date":"Wed, 14 Jan 2026 21:12:43 +0000","desc":"In a chaotic world, one thing you can count on is your own common-sense steps toward better cybersecurity . January is a great time to grab a subscription for yourself or a loved one, as a few holiday sales are (inexplicably) still happening. With access to a virtual private network (VPN) , you can stream TV shows and events from all over the world, protect your information from hackers and thwart online trackers. We strongly recommend using a VPN , but you might get stuck with a substandard app if you jump on the very first deal you see. You might also mistakenly end up paying more than you want to, as even otherwise respectable VPNs sometimes frame their prices in misleading ways, with advertised deals not always as available as they seem to be. Even so, there are some great bargains on the table. Plenty of the best VPNs — including our top pick, Proton VPN — are still running end-of-year deals that can save you anywhere from 67 to 88 percent on annual subscriptions. Most of these discounts only apply if you sign up for a year or more, but as long as you're comfortable with a service before you take the plunge, committing actually makes sense. You pay more at the start, but if you divide the cost by the months of subscription, it's much cheaper over time. Best VPN deals ExpressVPN Basic — $78.18 for a two-year subscription with four months free (78 percent off): This is one of the best VPNs, especially for new users, who will find its apps and website headache-free on all platforms. In tests for my ExpressVPN review , it dropped my download speeds by less than 7 percent and successfully changed my virtual location 14 out of 15 times. In short, it's an all-around excellent service that only suffers from being a little overpriced — which is why I'm so excited whenever I find it offering a decent deal. This discount, which gets you 28 months of ExpressVPN service, represents a 78 percent savings. Be aware, though, that it'll renew at the $99.95 per year price. ExpressVPN Advanced — $100.58 for a two-year subscription with four months free (74 percent off): ExpressVPN recently split its pricing into multiple tiers , but they all still come with similar discounts for going long. In addition to top-tier VPN service, advanced users get two additional simultaneous connections (for a total of 12), the ExpressVPN Keys password manager, advanced ad and tracker blocking, ID protection features and a 50 percent discount on an AirCove router. As above, note that it renews at $119.95 annually. NordVPN Basic — $81.36 for a two-year subscription (70 percent off): NordVPN gets the most important parts of a VPN right. It's fast, it doesn't leak any of your data and it's great at changing your virtual location. I noted in my NordVPN review that it always connects quickly and includes a support page that makes it easy to get live help. NordVPN includes a lot of cool features, like servers that instantly connect you to Tor. This deal gives you 70 percent off the two-year plan. NordVPN Plus — $105.36 for a two-year subscription (70 percent off): NordVPN has also taken 70 percent off its Plus subscription. For only a little more, you get a powerful ad and tracker blocker that can also catch malware downloads, plus access to the NordPass password manager. A Plus plan also adds a data breach scanner that checks the dark web for your sensitive information. Surfshark Starter — $53.73 for a two-year subscription with three months free (87 percent off): This is the \"basic\" level of Surfshark , but it includes the entire VPN; everything on Surfshark One is an extra perk. With this subscription, you'll get some of the most envelope-pushing features in the VPN world right now. Surfshark can rotate your IP constantly to help you evade detection — it even lets you choose your own entry and exit nodes for a double-hop connection. That all comes with a near-invisible impact on download speeds. With this year-round deal, you can save 87 percent on 27 months of Surfshark. Surfshark One — $67.23 for a two-year subscription with three months free (87 percent off): A VPN is great, but it's not enough to protect your data all on its own. Surfshark One adds several apps that boost your security beyond just VPN service, including Surfshark Antivirus (scans devices and downloads for malware) and Surfshark Alert (alerts you whenever your sensitive information shows up in a data breach), plus Surfshark Search and Alternative ID from the tier below. This extra-low deal gives you 88 percent off all those features. If you bump up to Surfshark One+, you'll also get data removal through Incogni, but the price jumps enough that it's not quite worthwhile in my eyes. CyberGhost — $49.50 for a one-year subscription with six months free (79 percent off): CyberGhost has some of the best automation you'll see on any VPN. With its Smart Rules system, you can determine how its apps respond to different types of Wi-Fi networks, with exceptions for specific networks you know by name. Typically, you can set it to auto-connect, disconnect or send you a message asking what to do. CyberGhost's other best feature is its streaming servers — I've found both better video quality and more consistent unblocking when I use them on streaming sites. Currently, you can get 18 months of CyberGhost for 79 percent off the usual price, but it'll renew at $56.94 per year. hide.me — $69.95 for a two-year subscription with four months free (75 percent off): Hide.me is an excellent free VPN — in fact, it's my favorite on the market, even with EventVPN and the free version of Proton VPN as competition. If you do want to upgrade to its paid plan, though, the two-year subscription offers great savings. Hide.me works well as a no-frills beginner VPN, with apps and a server network it should frankly be charging more for. Private Internet Access — $79 for a three-year subscription with four months free (83 percent off): With this deal, you can get 40 months of Private Internet Access (PIA) for a little bit under $2 per month — an 83 percent discount on its monthly price. Despite being so cheap, PIA has plenty of features, coming with its own DNS servers, a built-in ad blocker and automation powers to rival CyberGhost. However, internet speeds can fluctuate while you're connected. What makes a good VPN deal Practically every VPN heavily discounts its long-term subscriptions year-round, with even sharper discounts around occasions like the holidays. The only noteworthy exception is Mullvad, the Costco hot dog of VPNs (that's a compliment, to be clear). When there's constantly a huge discount going on, it can be hard to tell when you're actually getting a good deal. The best way to squeeze out more savings is to look for seasonal deals, student discounts or exclusive sales like Proton VPN's coupon for Engadget readers . One trick VPNs often use is to add extra months onto an introductory deal, pushing the average monthly price even lower. When it comes time to renew, you usually can't get these extra months again. You often can't even renew for the same basic period of time — for example, you may only be able to renew a two-year subscription for one year. If you're planning to hold onto a VPN indefinitely, check the fine print to see how much it will cost per month after the first renewal, and ensure that fits into your budget. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/the-best-vpn-deals-up-to-88-percent-off-protonvpn-surfshark-expressvpn-nordvpn-and-more-120056445.html?src=rss","source":"Engadget"},{"title":"Civilization VII comes to Apple Arcade in February","link":"https://www.engadget.com/gaming/civilization-vii-comes-to-apple-arcade-in-february-203000754.html?src=rss","date":"Wed, 14 Jan 2026 20:30:00 +0000","desc":"The App Store is a home for many kinds of apps (including, inexplicably , one that lets users undress strangers without their consent ). But hey, it also has games! And soon the store&#39;s Apple Arcade service will include one more: the not-so-highly rated Civilization VII . Apple announced on Wednesday that Sid Meier&#39;s Civilization VII will arrive almost exactly a year after launch . The game is already available for Apple devices, but its arrival on Apple Arcade will be a first. Civilization VII arrives on Apple Arcade on February 5. Firaxis Games / Apple “Free (for Apple Arcade subscribers)” may be the right pricing for the game, given its mixed reviews. A common complaint is the way it handles transitions between eras. (&quot;I have Ben Franklin leading the Romans that turned into Ben Franklin leading Spain... like what? Who asked for this?&quot; a Steam reviewer wrote.) On the other hand, its visuals are praised by most. The Apple Arcade edition of Civilization VII is scheduled to arrive on February 5. It will be playable on Mac, iPhone and iPad. This article originally appeared on Engadget at https://www.engadget.com/gaming/civilization-vii-comes-to-apple-arcade-in-february-203000754.html?src=rss","source":"Engadget"},{"title":"California is investigating Grok over AI-generated CSAM and nonconsensual deepfakes","link":"https://www.engadget.com/ai/california-is-investigating-grok-over-ai-generated-csam-and-nonconsensual-deepfakes-202029635.html?src=rss","date":"Wed, 14 Jan 2026 20:20:29 +0000","desc":"California authorities have launched an investigation into xAI following weeks of reports that the chatbot was generating sexualized images of children. &quot;xAI appears to be facilitating the large-scale production of deepfake nonconsensual intimate images that are being used to harass women and girls across the internet, including via the social media platform X,&quot; California Attorney General Rob Bonta&#39;s office said in a statement .&nbsp; The statement cited a report that &quot;more than half of the 20,000 images generated by xAI between Christmas and New Years depicted people in minimal clothing,&quot; including some that appeared to be children. &quot;We have zero tolerance for the AI-based creation and dissemination of nonconsensual intimate images or of child sexual abuse material,” Bonta said. “Today, my office formally announces an investigation into xAI to determine whether and how xAI violated the law. The investigation was announced as California Governor Gavin Newsom also called on Bonta to investigate xAI. &quot;xAI’s decision to create and host a breeding ground for predators to spread nonconsensual sexually explicit AI deepfakes, including images that digitally undress children, is vile,&quot; Newsom wrote. xAI’s decision to create and host a breeding ground for predators to spread nonconsensual sexually explicit AI deepfakes, including images that digitally undress children, is vile. I am calling on the Attorney General to immediately investigate the company and hold xAI… — Governor Gavin Newsom (@CAgovernor) January 14, 2026 California authorities aren&#39;t the first to investigate the company following widespread reports of AI-generated child sexual abuse material (CSAM) and non-consensual intimate images of women. UK regulator Ofcom has also opened an official inquiry , and European Union officials have said they are also looking into &nbsp; the issue. Malaysia and Indonesia have moved to block Grok.&nbsp; Last week, xAI began imposing rate limits on Grok&#39;s image generation abilities, but has so far declined to pull the plug entirely. When asked to comment on the California investigation, xAI responded with an automated email that said &quot;Legacy Media Lies.&quot;&nbsp; Earlier on Wednesday, Elon Musk said he was &quot;not aware of any naked underage images generated by Grok.&quot; Notably, that statement does not directly refute Bonta&#39;s allegation that Grok is being used &quot;to alter images of children to depict them in minimal clothing and sexual situations.&quot; Musk said that &quot;the operating principle for Grok is to obey the laws&quot; and that the company works to address cases of &quot;adversarial hacking of Grok prompts.&quot; This article originally appeared on Engadget at https://www.engadget.com/ai/california-is-investigating-grok-over-ai-generated-csam-and-nonconsensual-deepfakes-202029635.html?src=rss","source":"Engadget"},{"title":"Save up to 78 percent on ExpressVPN two-year plans right now","link":"https://www.engadget.com/deals/save-up-to-78-percent-on-expressvpn-two-year-plans-right-now-180602838.html?src=rss","date":"Wed, 14 Jan 2026 20:06:26 +0000","desc":"ExpressVPN is back on sale again, and its two-year plans are up to 78 percent off right now. You can get the Advanced tier for $101 for 28 months. This is marked down from the $392 that this time frame normally costs. On a per-month basis, it works out to roughly $3.59 for the promo period. We’ve consistently liked ExpressVPN because it’s fast, easy to use and widely available across a large global server network. In fact, it&#39;s our current pick for best premium VPN . One of the biggest drawbacks has always been its high cost, and this deal temporarily solves that issue. In our review we were able to get fast download and upload speeds, losing only 7 percent in the former and 2 percent in the latter worldwide. We found that it could unblock Netflix anywhere, and its mobile and desktop apps were simple to operate. We gave ExpressVPN an overall score of 85 out of 100. The virtual private network service now has three tiers. Basic is cheaper with fewer features, while Pro costs more and adds extra perks like support for 14 simultaneous devices and a password manager. Advanced sits in the middle and includes the password manager but only supports 12 devices. The Basic plan is $78 right now for 28 months, down from $363, and the Pro plan is $168, down from $560. That&#39;s 78 percent and 70 percent off, respectively. All plans carry a 30-day money-back guarantee for new users, so you can try it without committing long term if you’re on the fence. This article originally appeared on Engadget at https://www.engadget.com/deals/save-up-to-78-percent-on-expressvpn-two-year-plans-right-now-180602838.html?src=rss","source":"Engadget"},{"title":"PS Plus Game Catalog additions for January include Resident Evil Village and Like a Dragon: Infinite Wealth","link":"https://www.engadget.com/gaming/playstation/ps-plus-game-catalog-additions-for-january-include-resident-evil-village-and-like-a-dragon-infinite-wealth-181501574.html?src=rss","date":"Wed, 14 Jan 2026 18:15:01 +0000","desc":"Sony just announced January&#39;s Game Catalog additions for PS Plus subscribers and it&#39;s a fantastic lineup. All of these titles will be ready to play on January 20. First up, there&#39;s Resident Evil Village . This is a direct sequel to 2017’s Resident Evil 7: Biohazard . It&#39;s a full game with plenty of jump scares and an engrossing narrative. It&#39;s set in a spooky village, thus the name, and a nearby castle. This shouldn&#39;t disappoint fans of the franchise and will be available for both PS4 and PS5. Like a Dragon: Infinite Wealth is a 2024 sequel to Yakuza: Like a Dragon . It was a massive hit upon release, thanks to solid RPG mechanics and a truly unique sense of humor. There are minigames that parody both Pokémon and Animal Crossing. The combat and movement have also both been enhanced since the last entry. It&#39;ll be playable on both PS4 and PS5. Expeditions: A MudRunner Game is a neat little riff on a driving sim, mixing in other genres. The meat and potatoes involve driving an off-road vehicle to locate treasures and uncover secrets, but there&#39;s also a base-building element. It&#39;ll be available for both PS4 and PS5. That&#39;s really just the tip of the iceberg. This is a big month for PS Plus subscribers. Other titles dropping on January 20 include the iconic roguelike Darkest Dungeon II and the horror adventure A Quiet Place: The Road Ahead . This article originally appeared on Engadget at https://www.engadget.com/gaming/playstation/ps-plus-game-catalog-additions-for-january-include-resident-evil-village-and-like-a-dragon-infinite-wealth-181501574.html?src=rss","source":"Engadget"},{"title":"He could just turn it off","link":"https://www.engadget.com/he-could-just-turn-it-off-180209551.html?src=rss","date":"Wed, 14 Jan 2026 18:02:09 +0000","desc":"Generative AI, we are repeatedly told, is a transformative and complicated technology. So complicated that its own creators are unable to explain why it acts the way it does, and so transformative that we&#39;d be fools to stand in the way of progress. Even when progress resembles a machine for undressing strangers without their consent on an unprecedented scale , as has been the case of late with Elon Musk&#39;s Grok chatbot.&nbsp; UK Prime Minister Kier Starmer seems to have so fully bought into the grand lie of the AI bubble that he was willing to announce : &quot;I have been informed this morning that X is acting to ensure full compliance with UK law.&quot; Not that it currently is in compliance. Nor a timeline in which it is expected to do so. Just that he seems satisfied that someday, eventually, Musk&#39;s pet robot will stop generating child sexual abuse material .&nbsp; This statement comes just under two days after Starmer was quoted as saying &quot;If X cannot control Grok, we will.&quot; What could Elon possibly have said to earn this pathetic capitulation. AI is difficult? Solutions take time? These are entirely cogent technical arguments until you remember: He could just turn it off.&nbsp; Elon Musk has the power to disable Grok, if not in whole (we should be so lucky) than its image generation capabilities. We know this intuitively, but also because he rate-limited Grok&#39;s image generation after this latest scandal: after a few requests, free users are now prompted to pay $8 per month to continue enlisting a wasteful technology to remove articles of clothing from women. Sweep it under the rug, make a couple bucks along the way. Not only is it entirely possible for image generation to be turned off, it&#39;s the only responsible option. Software engineers regularly roll back updates or turn off features that work less than optimally; this one&#39;s still up and running despite likely running afoul of the law.&nbsp; That we have now gone the better part of a month aware this problem exists; that the &quot;feature&quot; still remains should tell Starmer and others all they need to know. Buddy, you&#39;re carrying water for a bozo who does not seem to care that one such victim was reportedly Ashley St Clair, the mother of one of his (many) children. Some countries — namely Malaysia and Indonesia — chose to turn Grok off for their citizens by blocking the service . Indonesia&#39;s Communication and Digital Affairs Minister was quoted as saying “The government sees nonconsensual sexual deepfakes as a serious violation of human rights.&quot; Imagine if everyone in the business of statecraft felt that way.&nbsp; The UK (not to mention the US, but please, expect nothing from us , we&#39;re busy doing authoritarianism ) has a lot more sway over X, and by extension Elon, than either of those countries. Musk does, and is looking to do even more , business in the UK. Even if Musk were not perhaps the world&#39;s most well known liar , Grok can still make images and that should speak for itself. Grok should be well out of second chances by now, and it&#39;s up to government leaders to say no more until they can independently verify it&#39;s no longer capable of harm. This article originally appeared on Engadget at https://www.engadget.com/he-could-just-turn-it-off-180209551.html?src=rss","source":"Engadget"},{"title":"How to turn off a VPN on iPhone","link":"https://www.engadget.com/cybersecurity/vpn/how-to-turn-off-a-vpn-on-iphone-180000533.html?src=rss","date":"Wed, 14 Jan 2026 18:00:00 +0000","desc":"Look, virtual private networks are great — I wouldn&#39;t have made a list of the best VPNs if I didn&#39;t recommend using them. But being able to control your own technology is also important. A VPN can provide protection and peace of mind when used properly , but you may not want it active on your phone all the time. For example: Are your Google search results suddenly in German? That’s one example of what can happen if you leave your virtual location set to Berlin or Vienna. Or maybe a VPN you installed for work or to watch a single tennis match is persistently trying to keep itself active. The point is, deactivating a VPN on an iPhone can sometimes be unusually tricky, because there’s more than one off switch. Fortunately, it&#39;s not hard. There are several easy ways to disconnect from an iOS VPN or delete it entirely. If you catch it turning itself back on, I&#39;ll show you how to stop that too. Three ways to turn off your iPhone VPN I&#39;m using a fluid definition of &quot;turn off&quot; here. Some of the steps below simply disconnect the VPN, while others remove it from your phone altogether. I&#39;ll make it clear in each section what the outcome will be. How to disconnect in the VPN app This is the easiest way to turn off a VPN on your iPhone. First, find the VPN app that’s active, which should be on your home screen somewhere. Each app has a different interface for connecting and disconnecting, but the disconnect button should be fairly obvious — it may say the word &quot;disconnect&quot; or show a green power icon. In any case, it should be right on the home screen, without requiring any digging through menus. Example of where to find the disconnect option on a VPN&#39;s home screen. Sam Chapman for Engadget Tap the disconnect button and wait for the VPN to clearly state that it&#39;s disconnected. Check to make sure the rectangle with &quot;VPN&quot; inside has disappeared from the top of your iPhone screen. The VPN is now disconnected. How to turn off the VPN in Settings If you aren&#39;t sure which VPN app is active, or if its interface doesn&#39;t make it clear how to turn it off, you can shut it down from the Settings menu instead. Find the app on your home screen that looks like several interlocking gray gears and tap it. Next, scroll down and tap the VPN option. If it&#39;s not present (which it won’t be on older iOS versions), tap the General option next to another picture of a gray gear. Scroll down again and tap VPN & Device Management by yet another gray gear. Finally, tap the VPN option at the top of the screen to reach the VPN management page. Location of the VPN settings on iOS. Sam Chapman for Engadget If you have a VPN active, you should see an option at the top of the page labeled VPN Status . Toggle it from Connected to Not Connected. The VPN icon should disappear from the top of your screen, indicating that it&#39;s turned off. How to delete the VPN app altogether If you don&#39;t want the VPN on your phone at all, you can turn it off permanently by deleting both the app and the configuration. This is a lot harder to undo, so only do it if you&#39;re certain. Start by deleting the app the same way you&#39;d get rid of any other app. Tap the icon and hold until a pop-up menu appears. Select the Remove App option in red text, then click Remove App again when prompted. Deleting a VPN on the iOS home screen. Sam Chapman for Engadget Deleting the app should also delete the configuration, but you can verify this for yourself. Follow the process from the previous section to find the VPN settings page. If there&#39;s still a VPN profile in those settings, tap the circled letter &quot;i&quot; next to its name, then tap Delete VPN at the bottom of the screen. The VPN is now gone from your iPhone unless you re-download it from the App Store. Troubleshooting: When an iPhone VPN turns itself back on Sometimes, even though you&#39;ve followed all the steps, that pesky VPN rectangle is back on your screen the next time you unlock your phone. If your iOS VPN keeps turning itself back on, a few things might be happening, most of them thankfully fixable. If you did not delete the VPN, it may be turning itself back on because its settings are telling it to. Go into its preferences menu and check for a setting called &quot;auto-connect&quot; or something similar. Settings like these have the VPN connect by itself to protect users who forget to activate it manually. Toggle all auto-connect options off and the problem should stop. It&#39;s also possible that settings on the iOS side are making the VPN reconnect. Go to the VPN settings page (you&#39;ll find instructions for getting there in the previous section) and find the name of the active VPN profile. Tap the &quot;i&quot; next to it. On the next page, turn off &quot;connect on demand&quot; to stop the automatic reconnections. If you did delete the VPN, but it&#39;s still reinstalling itself and turning back on, make sure that you deleted both the app and the connection profile. Reboot your iPhone to make sure all the settings stick. If the problem persists after all this, you&#39;ve either got malware disguised as a VPN or you&#39;re using a school or work phone where the VPN can&#39;t be uninstalled. If you aren&#39;t on a phone provided by a school or office, meaning you probably have malware, download an antivirus app and run a complete scan of your iPhone. This should remove any persistent files that keep reinstalling the virus. If, after all this, the VPN is still turning itself back on, I recommend burning your phone in a salt circle with a bundle of sage. When should you turn off your iPhone VPN? I encourage everyone to use a VPN every time they connect to the internet, but there are some situations where going through a VPN server is less convenient (this is the whole reason split tunneling exists). Here are a few cases in which temporarily turning off your VPN might be a good idea. The VPN isn&#39;t working. If your browsing speed is sluggish or the VPN keeps dropping the connection, your VPN server might be having problems. Disconnecting and reconnecting, even in the same location, should switch you to a different server that may work better. The VPN is causing unintended browsing errors. If you’re using mapping software or just trying to do a location-based search, having your VPN active can cause more problems than it solves. Your internet connection is unstable. A VPN adds an extra step to the process of getting online. If your phone is already struggling, the VPN might be an unnecessary complication. You&#39;re on a site that blocks all VPNs. Sites that work based on your location, including all streaming sites, may blanket-block VPNs so nothing messes with their location services. Good VPNs can get around these blocks, but even the best sometimes fail. In these cases, briefly turning off the VPN may be a good idea. Your battery is low. VPNs can put a strain on your phone&#39;s battery life. This varies with the quality of your VPN, but you may sometimes need to shut it off if your battery is in the red. How to turn off iCloud Private Relay iCloud Private Relay is not a VPN, but it&#39;s often confused for one. If you found this page because you want to turn it off, you&#39;re in luck — the steps are just as simple as turning off a VPN. Start by opening Settings , then tap your name. Scroll down and tap iCloud . Private Relay will only be active if you&#39;re an iCloud+ subscriber. If you are, tap Private Relay , then choose whether to turn it off temporarily or indefinitely. This article originally appeared on Engadget at https://www.engadget.com/cybersecurity/vpn/how-to-turn-off-a-vpn-on-iphone-180000533.html?src=rss","source":"Engadget"},{"title":"Get three months of Audible for only $3","link":"https://www.engadget.com/deals/get-three-months-of-audible-for-only-3-193859098.html?src=rss","date":"Wed, 14 Jan 2026 17:46:26 +0000","desc":"Have a hankering for some audiobooks? Audible is holding one heck of a sale right now, giving users three months of access for $3 . That&#39;s a dollar per month. This is something of a winter tradition for the Amazon-owned platform and the promotion ends on January 21. An Audible subscription grants one audiobook per month to keep. This can be selected from a massive catalog of new releases and bestsellers. The collection here has just about everything. However, it&#39;s easy to plow through a single book in a month. Users also get streaming access to thousands of curated titles. Think of it like Netflix for audiobooks. The catalog is limited, but it gets the job done in a pinch. Subscribers do get access to all Audible original content and they will receive discounts on purchasing audiobooks outright. In other words, it&#39;s a neat little service and well worth a buck. The regular price is $15, so make sure to cancel at the end of that three months if you aren&#39;t enjoying the platform. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/get-three-months-of-audible-for-only-3-193859098.html?src=rss","source":"Engadget"},{"title":"The first-gen Bose QuietComfort Ultra headphones are $150 off right now","link":"https://www.engadget.com/deals/the-first-gen-bose-quietcomfort-ultra-headphones-are-150-off-right-now-164826329.html?src=rss","date":"Wed, 14 Jan 2026 16:48:26 +0000","desc":"The first-generation Bose QuietComfort Ultra headphones are on sale right now for $280, marked down from $430. That 35 percent savings is an even steeper discount than we saw last year Black Friday. In our review of the first-generation Ultras, we gave them a score of 86 out of 100, noting their best-in-class active noise cancellation (ANC) and comfort. Bose improved its stock tuning for these headphones, which we could immediately tell sounded warmer and clearer. Bose has typically lagged behind the likes of Sony and Sennheiser in raw sound quality, but the first-generation QuietComfort Ultra was a big step toward catching up. Bose added &quot;Immersive Audio&quot; to this model, which is the company&#39;s take on spatial audio. The company claims this feature effectively puts you in the acoustic sweet spot of a set of stereo speakers. In our testing, we felt this didn&#39;t always make songs sound better, but it did make them louder and in some cases made certain details more noticeable. The Ultras offer up to 24 hours of battery life with ANC turned on and about 18 hours with both ANC and Immersive Audio enabled. In our testing, however, we were actually able to beat Bose&#39;s estimates for battery life. The second generation of these headphones are currently our top pick for best noise-canceling headphones , but when this older model is heavily on sale, the differences between them are less dramatic. If you&#39;re in the market for a pair of great noise-canceling cans, consider checking these out. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/the-first-gen-bose-quietcomfort-ultra-headphones-are-150-off-right-now-164826329.html?src=rss","source":"Engadget"},{"title":"The latest Animal Crossing: New Horizons expansion has arrived earlier than expected","link":"https://www.engadget.com/gaming/nintendo/the-latest-animal-crossing-new-horizons-expansion-has-arrived-earlier-than-expected-160739040.html?src=rss","date":"Wed, 14 Jan 2026 16:07:39 +0000","desc":"For a number of very obvious reasons, we don’t want to roll back the clock to early 2020. No thank you. But if there was a feel-good lockdown story, it was the perfectly timed arrival of Animal Crossing: New Horizons , which allowed friends who could no longer meet up IRL to do so virtually on their carefully pruned islands. The game will almost certainly never be as popular as it was back then again, but Nintendo is hoping a good chunk of lapsed islanders will return for its latest DLC drop, which has arrived a day earlier than planned. As spotted by Eurogamer , the free Animal Crossing: New Horizons 3.0 update is available to download now and, as previously announced , brings a host of new features to the cozy life sim, including a brand new resort hotel on the pier that you can help decorate. There are new items and quality-of-life additions too, as well as the ability to build fresh islands with your friends and family in the “Slumber Island” dream world. All you need to do is go to the New Horizons game icon on your Switch’s home screen and download the software update. Nintendo also announced last year that New Horizons would be coming to Switch 2 on January 15, improving the visuals, unlocking mouse controls and GameChat functionality, and expanding the online multiplayer capacity from eight players to 12. As of now, the Switch 2 edition of the game remains locked, so you’ll be stuck with the standard Switch version until tomorrow. Upgrading costs $5, while first-time players can purchase the Switch 2 version of Animal Crossing: New Horizons for $65. This article originally appeared on Engadget at https://www.engadget.com/gaming/nintendo/the-latest-animal-crossing-new-horizons-expansion-has-arrived-earlier-than-expected-160739040.html?src=rss","source":"Engadget"},{"title":"The Mac mini M4 is back on sale for $499","link":"https://www.engadget.com/deals/the-mac-mini-m4-is-back-on-sale-for-499-141615907.html?src=rss","date":"Wed, 14 Jan 2026 16:06:26 +0000","desc":"The holiday season may be behind us, but that doesn&#39;t mean you can&#39;t still find good deals on some of our favorite tech. Take the Apple Mac mini M4 , which is on sale for $100 off. The 17 percent discount gives you 16GB of RAM and 256GB of SSD for $499, which is only about $20 more than its Black Friday sale price. Its beefier models are also on sale: opting for 512GB of SSD will cost you $689, down from $799, while also upping your RAM to 24GB is available for $890, dropping from $999.&nbsp; We gave the Apple Mac mini M4 a 90 in our review thanks in large part to its powerful chip. The M4 works very fast despite being in such a small device. It also offers front-facing headphone and USB-C ports. You can further upgrade to the Apple M4 Pro chip for $1,270, down from $1,399 — a nine percent discount. The Pro model also has Thunderbolt 5 support.&nbsp; Check out our coverage of the best Apple deals for more discounts, and follow @EngadgetDeals on X for the latest tech deals and buying advice. This article originally appeared on Engadget at https://www.engadget.com/deals/the-mac-mini-m4-is-back-on-sale-for-499-141615907.html?src=rss","source":"Engadget"},{"title":"Gemini can now pull context the rest of your Google apps, if you let it","link":"https://www.engadget.com/ai/gemini-can-now-pull-context-the-rest-of-your-google-apps-if-you-let-it-160039468.html?src=rss","date":"Wed, 14 Jan 2026 16:00:39 +0000","desc":"Gemini is adding a feature that’s designed to feel more tailored to individual users. Once enabled, &quot;Personal Intelligence&quot; can pull context from across your Google ecosystem, including Gmail, Google Photos, Search and YouTube History, to gain specific insight that will shape its answers and recommendations. Personal Intelligence is available starting today in the US for Google AI Pro and Ultra subscribers. The feature is opt-in only and is off by default. Google Google says users will have the ability to control what apps Gemini pulls from and, in the future, which chats it uses Personal Intelligence for. The company says this new feature might still make some mistakes, such as “over-personalization” where it draws connections between unrelated things. According to Google, Gemini will not train directly on the data it pulls for personalization like your photos and emails, but will instead train on your prompts and its responses. Users can also prompt Gemini to &quot;try again&quot; without personalization and will have the option to delete chat histories. For now, Personal Intelligence works in the Gemini app across web, Android and iOS for personal Google accounts. Google says it’s coming to Search’s AI Mode soon, with plans to expand to more countries and the free tier down the line. Google has been on a tear integrating Gemini into everything, including Gmail , TVs and Chrome on mobile . This week, Apple announced that Siri AI will be powered by Gemini as part of a multi-year collaboration . AI remains an imperfect tool, and Google&#39;s AI has a long history of malfunctions like explaining made-up idioms , calling itself a &quot;failure&quot; in a depressing doom loop and generating images of the Founding Fathers as people of color. This article originally appeared on Engadget at https://www.engadget.com/ai/gemini-can-now-pull-context-the-rest-of-your-google-apps-if-you-let-it-160039468.html?src=rss","source":"Engadget"},{"title":"YouTube adds more parental controls, including a way to block teens from watching Shorts","link":"https://www.engadget.com/entertainment/youtube/youtube-adds-more-parental-controls-including-a-way-to-block-teens-from-watching-shorts-151329673.html?src=rss","date":"Wed, 14 Jan 2026 15:13:29 +0000","desc":"YouTube is rolling out some additional parental controls, including a way to set time limits for viewing Shorts on teen accounts. In the near future, parents and guardians will be able to set the Shorts timer to zero on supervised accounts. &quot;This is an industry-first feature that puts parents firmly in control of the amount of short-form content their kids watch,&quot; Jennifer Flannery O&#39;Connor, YouTube&#39;s vice president of product management, wrote in a blog post . Along with that, take-a-break and bedtime reminders are now enabled by default for users aged 13-17.&nbsp; The platform is also bringing in new principles , under which it will recommend more age-appropriate and &quot;enriching&quot; videos to teens. For instance, YouTube will suggest videos from the likes of Khan Academy, CrashCourse and TED-Ed to them more often. It said it developed these principles (and a guide for creators to make teen-friendly videos) with help from its youth advisory committee, the Center for Scholars and Storytellers at UCLA, the American Psychological Association, the Digital Wellness Lab at Boston Children’s Hospital and other organizations. Moreover, an updated sign-up process for kid accounts will be available in the coming weeks. Kid accounts are tied to parental ones, and don&#39;t have their own associated email address or a password.&nbsp;YouTube says users will be able to switch between accounts in the mobile app with just a few taps. &quot;This makes it easier to ensure that everyone in the family is in the right viewing experience with the content settings and recommendations of age-appropriate content they actually want to watch,&quot; O&#39;Connor wrote. This article originally appeared on Engadget at https://www.engadget.com/entertainment/youtube/youtube-adds-more-parental-controls-including-a-way-to-block-teens-from-watching-shorts-151329673.html?src=rss","source":"Engadget"},{"title":"Our favorite 3-in-1 wireless charger from UGreen is 32 percent off right now","link":"https://www.engadget.com/deals/our-favorite-3-in-1-wireless-charger-from-ugreen-is-32-percent-off-right-now-214707806.html?src=rss","date":"Wed, 14 Jan 2026 15:06:26 +0000","desc":"You can easily spruce up your nightstand or desk by decluttering a bit, replacing some of those annoying charging cables with a good wireless charging setup. One of our favorites that can handle three devices at once is the UGREEN MagFlow Qi2 3-in-1 Charger Station 25W . Normally $140, it&#39;s on sale right now for $95; that&#39;s 32 percent off and only about $5 more than its record-low price. This is our top pick for a 3-in-1 charging pad thanks to its versatility. The UGREEN can work equally well as a permanent fixture in your home or act as a portable charging station. It boasts a foldable design and has smart little design details to keep it feeling like a premium product. The Qi2 25W charging works across a range of iPhone models and accessories, such as AirPods. There&#39;s also a dedicated part of the pad&#39;s design for an Apple Watch, which uses a proprietary charging standard, to power up too. Just note that you&#39;ll need a newer model of phone and the latest iOS 26 in order to take full advantage of the 25W charging capability. The wireless pad also comes with both a charging plug and a cable. We felt this UGREEN model was a great value at $140, so being able to snag one for a third of the usual price is an even better deal. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/our-favorite-3-in-1-wireless-charger-from-ugreen-is-32-percent-off-right-now-214707806.html?src=rss","source":"Engadget"},{"title":"The Nintendo Switch 2025 year in review is finally here","link":"https://www.engadget.com/gaming/nintendo/the-nintendo-switch-2025-year-in-review-is-finally-here-145810913.html?src=rss","date":"Wed, 14 Jan 2026 14:58:10 +0000","desc":"We’re almost exactly halfway through January, but Nintendo has clearly taken a better-late-than-never approach to its 2025 year in review feature, which finally went live this week for Switch and Switch 2 users. All you need to do is head here and sign into your Nintendo account to see your 2025 breakdown. Like most annual gaming wrap-ups, Nintendo&#39;s shows how many games you played over the calendar year, as well as your total playtime. It also shows you your most-played titles for each month, your preferred genres by percentage, and if you scroll all the way to the bottom you can choose your favorite game of the year. You can also download a shareable image that shows off your taste, but there’s no way to directly share your results on social media through the website. 2025 was a massive year for Nintendo, with the Switch 2 launching in early June. If you bought one, the year in review site will naturally congratulate you for doing so, but it doesn’t separate your results by games you played on the original Switch versus its successor. Nintendo’s rivals went live with their own 2025 recap features in December. First came Sony’s , which is unfortunately no longer live, and Steam followed shortly after. That one is still available to view if you want to see how your Switch 2 playtime stacks up against your Steam Deck hours. Microsoft decided to skip a 2025 wrap-up altogether, which Windows Central ’s Jez Corden previously suggested could be due to a reallocation of marketing budget towards a number of significant anniversaries happening this year, including the 25th anniversary of Xbox. This article originally appeared on Engadget at https://www.engadget.com/gaming/nintendo/the-nintendo-switch-2025-year-in-review-is-finally-here-145810913.html?src=rss","source":"Engadget"},{"title":"Pick up Apple's 25W MagSafe charger while it's down to $30","link":"https://www.engadget.com/deals/pick-up-apples-25w-magsafe-charger-while-its-down-to-30-141707867.html?src=rss","date":"Wed, 14 Jan 2026 14:30:37 +0000","desc":"If you want a wireless charger for your iPhone and prefer to stick with Apple, Amazon has a sale that may pique your interest. The retailer is selling the one meter Apple Magsafe charger for $30 , saving you $10 off the regular price, while also selling the two meter model for $40 ($10 off). If you have an iPhone 16, iPhone 17 or iPhone Air, this cable can charge your device at 25W as long as it&#39;s connected to a 30W power adapter on the other end. While you&#39;ll need a more recent iPhone to get the fastest MagSafe charging speeds, the charger can wirelessly top up the battery of any iPhone from the last eight years (iPhone 8 and later). With older iPhones, the charging speed tops out at 15W. The cable works with AirPods wireless charging cases too — it&#39;s certified for Qi2.2 and Qi charging. The MagSafe charger is one of our favorite iPhone accessories , and would pair quite nicely with your new iPhone if you&#39;re picking up one of the latest models. If you&#39;re on the fence about that, be sure to check out our reviews of the iPhone 17 , iPhone Pro/Pro Max and iPhone Air . Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/pick-up-apples-25w-magsafe-charger-while-its-down-to-30-141707867.html?src=rss","source":"Engadget"},{"title":"NVIDIA rolls out DLSS 4.5 to all RTX GPUs","link":"https://www.engadget.com/gaming/nvidia-rolls-out-dlss-45-to-all-rtx-gpus-140000322.html?src=rss","date":"Wed, 14 Jan 2026 14:00:00 +0000","desc":"Just a week after announcing the latest version of its image-upscaling tech at CES, NVIDIA is rolling out DLSS 4.5. The company released a beta version of the update last week. Starting today, all NVIDIA app users with a GeForce RTX GPU will be able to upgrade to the full release of DLSS 4.5. NVIDIA says DLSS 4.5 Super Resolution (to give its full name) delivers sharper visuals and improved temporal stability. The 2nd Generation Super Resolution Transformer reduces ghosting and improves anti-aliasing in more than 400 games and apps, the company claims. &quot;This second-generation model is our most sophisticated yet, utilizing five times the compute power of the original transformer model, having been trained on a significantly expanded, high-fidelity dataset,&quot; NVIDIA added. The company plans to bring an upgraded frame generation feature to DLSS 4.5 sometime this spring for those with GeForce RTX 50 Series GPUs. It says the Dynamic 6x Frame Generation feature can generate up to five extra frames for each traditionally generated one, delivering up to 4K 240Hz path traced performance. This article originally appeared on Engadget at https://www.engadget.com/gaming/nvidia-rolls-out-dlss-45-to-all-rtx-gpus-140000322.html?src=rss","source":"Engadget"},{"title":"Monarch Money deal: New users can get one year of access for only $50","link":"https://www.engadget.com/apps/monarch-money-deal-new-users-can-get-one-year-of-access-for-only-50-204507409.html?src=rss","date":"Wed, 14 Jan 2026 13:50:35 +0000","desc":"A new year is the perfect time to get your spending in order, and if you&#39;re not trying to build your own spreadsheet, budgeting apps are one of the best ways to do it. To save yourself some money in the process, you can pick up a year-long subscription to Monarch Money , one of Engadget&#39;s favorite budgeting apps , for just $50 if you use code NEWYEAR2026 at checkout and you&#39;re a new subscriber. That&#39;s a 50 percent discount on the service&#39;s normal $100 price. Monarch Money makes for a capable and detailed budgeting companion. You can use the service via apps for iOS, Android, iPadOS or the web, and Monarch also offers a Chrome extension that can sync your Amazon and Target transactions and automatically categorize them. Like other budgeting apps, Monarch Money lets you connect multiple financial accounts and track your money based on where you spend it over time. Monarch offers two different approaches to tracking budgeting (flexible and category budgeting) depending on what fits your life best, and the ability to add a budget widget on your phone so you can know how you&#39;re tracking that month. How budgeting apps turn your raw transactions into visuals you can understand at a glance is one of the big things that differentiates one app from another, and Monarch Money offers multiple graphs and charts to look at for things like spending, investments or categories of your choice based on how you&#39;ve labelled your expenses. The app can also monitor the spending of you and your partner all in one place, to make it easier to plan together. The main drawbacks Engadget found in testing Monarch Money were the app&#39;s learning curve, and the differences in features (and bugginess) between Monarch&#39;s web and mobile versions. Still, for 50 percent off, the Monarch Money is well worth experimenting with if you&#39;re trying to save money in 2026, especially if you want to do it collaboratively with a partner. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/apps/monarch-money-deal-new-users-can-get-one-year-of-access-for-only-50-204507409.html?src=rss","source":"Engadget"},{"title":"Fender's guitar lessons are coming to Samsung TVs later this year","link":"https://www.engadget.com/entertainment/fenders-guitar-lessons-are-coming-to-samsung-tvs-later-this-year-134551816.html?src=rss","date":"Wed, 14 Jan 2026 13:45:51 +0000","desc":"We’ve all heard of couch surfing, but Fender and Samsung have made it their 2026 mission to make couch shredding a thing. Samsung TV users will soon be able to take guitar lessons from the comfort of their living rooms, with the first TV edition of the Fender Play app set to arrive in the first half of this year. Debuted at CES , players can choose from video-based lessons for both electric and acoustic guitar, as well as bass and — for all the wannabe Jake Shimabukuros or George Formbys (one for the Brits) among you — the ukulele. There are on-demand courses for different levels of skill, with each lesson built around a wide spectrum of well-known songs, everything from The Beatles&#39; &quot; Blackbird &quot; to Olivia Rodrigo&#39;s &quot; Drivers License &quot;.&nbsp; If you’re a bit more confident in your axe-wielding prowess, Jam Mode allows you to play along to genre-specific playlists. Call in the kids to watch and you’ve got your very own Woodstock. Fender Play is already available on a variety of screens via the App Store and Google Play, but with your TV likely being the largest one you own, you won’t have to squint to make out those chord progressions. You can already use the app on a TV by pairing your iPhone or Android device to your Apple TV or Chromecast, but Samsung’s native TV app is more immediate. Fender Play first launched way back in 2017 and has a number of virtual instructors who teach all levels of guitar players. A subscription costs $20 per month or $150 annually, and there’s a seven-day trial if you want to see what it’s all about. It will, for some reason, only be available on Samsung TVs released in 2025 or later (no word on support for older models at a later date) in the coming months. This article originally appeared on Engadget at https://www.engadget.com/entertainment/fenders-guitar-lessons-are-coming-to-samsung-tvs-later-this-year-134551816.html?src=rss","source":"Engadget"},{"title":"Bandcamp prohibits music made ‘wholly or in substantial part’ by AI","link":"https://www.engadget.com/entertainment/streaming/bandcamp-prohibits-music-made-wholly-or-in-substantial-part-by-ai-130050593.html?src=rss","date":"Wed, 14 Jan 2026 13:30:50 +0000","desc":"Bandcamp has addressed the AI slop problem vexing musicians and their fans of late. The company is banning any music or audio on its platform that is &quot;wholly or in substantial part&quot; made by generative AI, according to its blog . It also clarified that the use of AI tools to impersonate other artists or styles is “strictly prohibited” by policies already in place. Any music suspected to be AI generated may be removed by the Bandcamp team and the company is giving users reporting tools to flag such content. &quot;We believe that the human connection found through music is a vital part of our society and culture, and that music is much more than a product to be consumed,&quot; the company wrote. The announcement makes Bandcamp one of the first music platforms to offer a clear policy on the use of AI tech. AI-generated music (aka “slop”) has increasingly been invading music-streaming platforms, with Deezer for one recently saying that 50,000 AI-generated songs are uploaded to the app daily, or around 34 percent of its music.&nbsp; Platforms have been relatively slow to act against this trend. Spotify has taken some baby steps on the matter, having recently promised to develop an industry standard for AI disclosure in music credits and debut an impersonation policy. For its part, Deezer said it remains the only streaming platform to sign a global statement on AI artist training signed by numerous actors and songwriters.&nbsp; Bandcamp has a solid track record for artist support, having recently unveiled Bandcamp Fridays , a day that it gives 100 percent of streaming revenue to artists. That led to over $120 million going directly to musicians, and the company plans to continue that policy in 2026. This article originally appeared on Engadget at https://www.engadget.com/entertainment/streaming/bandcamp-prohibits-music-made-wholly-or-in-substantial-part-by-ai-130050593.html?src=rss","source":"Engadget"},{"title":"Elevation Lab's extended battery AirTag case is down to only $16","link":"https://www.engadget.com/deals/elevation-labs-extended-battery-airtag-case-is-down-to-only-16-162308748.html?src=rss","date":"Wed, 14 Jan 2026 13:15:35 +0000","desc":"AirTags already have a decently long battery life, but you will end up needing to replace the coin cell every two years or so. If you don&#39;t even want to be bothered with that, Elevation Lab made just the accessory for you: its AirTag battery case that can power the tracker for up to 10 years is on sale for 30 percent off. You can pick one up for only $16, and it&#39;s available in two- and four-packs as well at a discount. The TimeCapsule case uses two AA batteries to offer up to 14 times the lifespan of the CR2032 battery that powers an AirTag. The company based those estimates on Energizer Ultimate Lithium batteries, so your mileage may vary. Once an AirTag is seated inside the case, which is a compact 4.45 x 1.57 inches, it is sealed shut with four screws at the corners. The case is fiber-reinforced, according to Elevation Lab, and rated IP69 waterproof. The company says it’s intended for use cases where you might place an AirTag for long periods of time, like in a vehicle, a piece of luggage or a work bag. We&#39;ve already got a couple of Elevation Lab products on our list for best AirTag accessories , so while we haven&#39;t reviewed the battery case, we tend to like this company&#39;s products. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/elevation-labs-extended-battery-airtag-case-is-down-to-only-16-162308748.html?src=rss","source":"Engadget"},{"title":"Get one month of the Disney+ and Hulu bundle for only $10","link":"https://www.engadget.com/deals/get-one-month-of-the-disney-and-hulu-bundle-for-only-10-192814218.html?src=rss","date":"Wed, 14 Jan 2026 13:04:33 +0000","desc":"The peak time for deals on streaming services — the holiday shopping season — has come and gone, but Disney is back with a fresh offer for the new year. New and eligible returning subscribers can get one month of the ad-supported Disney+ Hulu bundle for just $10. That&#39;s $3 off the usual monthly rate for the bundle, and more than 58 percent off if you consider the prices for each service individually (Disney+ at $12 per month and, separately, Hulu also at $12 per month). We&#39;d be remiss if we didn&#39;t mention that this isn&#39;t quite as good as the Black Friday deal we saw last year, which offered the same bundle for $5 per month for one year. However, if you missed that offer or just want to try out Disney+ and Hulu for a brief period of time, this is a good way to do so. Disney+ and Hulu make one of the most balanced streaming pairs available, blending family-friendly favorites with acclaimed originals and network TV staples. Disney+ brings a vast library of animated classics, blockbuster franchises and exclusive content from Marvel, Pixar, Star Wars and National Geographic. It’s the place to stream nearly every Star Wars film and series, plus the full Marvel Cinematic Universe lineup and Disney’s most recent theatrical releases. Hulu balances things out with a more adult-oriented lineup of current TV shows, next-day network episodes and a growing roster of award-winning originals. The platform hosts series like The Bear, The Handmaid’s Tale and Only Murders in the Building , alongside comedies, thrillers and documentaries that regularly feature in awards conversations. It’s also the home for next-day streaming of ABC and FX shows, making it especially useful if you’ve already cut the cable cord but still want to keep up with primetime TV. The Duo Basic bundle ties these two services together under a single subscription, offering a simple way to expand your library without juggling multiple accounts. This tier includes ads on both platforms, but the trade-off is significant savings compared with paying for each service separately. For many households, that’s an acceptable compromise when it means access to such a wide range of content. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/get-one-month-of-the-disney-and-hulu-bundle-for-only-10-192814218.html?src=rss","source":"Engadget"},{"title":"Matthew McConaughey fights unauthorized AI likenesses by trademarking himself","link":"https://www.engadget.com/ai/matthew-mcconaughey-fights-unauthorized-ai-likenesses-by-trademarking-himself-130000567.html?src=rss","date":"Wed, 14 Jan 2026 13:00:00 +0000","desc":"Matthew McConaughey filed trademark applications to prevent his likeness from being used by AI companies without permission, and the US Patent and Trademark Office has approved eight so far. According to the Wall Street Journal , the trademarks were for video and audio clips featuring the actor staring, smiling and talking. One was for a video of him standing on a porch, while another was for an audio recording of him saying “alright, alright, alright,” his signature catchphrase from the movie Dazed and Confused . Under the law, it’s already prohibited for companies to steal someone’s likeness to sell products. However, McConaughey is taking a proactive approach due to the nebulous rules around the use of someone’s likeness for artificial intelligence and what’s considered commercial use involving the technology. His lawyer, Kevin Yorn, admits that they don’t know how the court would decide if an offender challenges the trademarks. But they’re hoping that the threat of a lawsuit would deter companies from using McConaughey’s likeness for AI in the first place. Actors have been trying to protect themselves from AI since the technology blew up, and it was one of the sticking points in the negotiations between SAG-AFTRA and Hollywood studios when the labor union went on a strike in 2023. McConaughey isn’t anti-AI by any means: He is an investor in ElevenLabs and has partnered with the AI startup to create a Spanish version of his newsletter. He said in a statement sent to The Journal that he just wants to make sure that if his voice or likeness is ever used, it’s because he approved and signed off on it. “We want to create a clear perimeter around ownership with consent and attribution the norm in an AI world,” he added. This article originally appeared on Engadget at https://www.engadget.com/ai/matthew-mcconaughey-fights-unauthorized-ai-likenesses-by-trademarking-himself-130000567.html?src=rss","source":"Engadget"},{"title":"Tesla's Full Self-Driving is switching to a subscription-only service","link":"https://www.engadget.com/transportation/evs/teslas-full-self-driving-is-switching-to-a-subscription-only-service-120053137.html?src=rss","date":"Wed, 14 Jan 2026 12:00:53 +0000","desc":"Tesla will stop selling its $8,000 Full Self-Driving (FSD) option and make it strictly a monthly subscription service after February 14, CEO Elon Musk announced on his X platform . Musk didn't reveal the price or why he's making the switch, though FSD is already available by subscription for $99 per month or $999 per year.&nbsp; The shift could be advantageous for buyers, particularly if they decide to dump their new Tesla or trade it in . It will also allow prospective owners to hedge their bets, as Tesla has overpromised on the feature since it was first announced.&nbsp; Tesla will stop selling FSD after Feb 14. FSD will only be available as a monthly subscription thereafter. — Elon Musk (@elonmusk) January 14, 2026 Full Self-Driving has never done what the name suggests as humans must constantly supervise the system and frequently take control. Because of that, it's more of a \"driver assist\" system and doesn't even qualify as Level 3 self-driving (conditional automation), let alone as a truly autonomous Level 4 or Level 5 category. Musk has been touting self-driving capabilities on Tesla vehicles since 2015, promising at the time \"complete autonomy\" by 2018.&nbsp; Branding for the system as \"Autopilot\" and \"Full Self-Driving\" has been called out as false advertising by consumer watchdogs and government for years , but so far, regulators have yet to take action. A California judge recently ruled that Tesla used \"deceptive language to market Autopilot and recommended suspending Tesla's sales in the state for 30 days. However, the company has 90 days to comply and could still avoid punishment.&nbsp;&nbsp; This article originally appeared on Engadget at https://www.engadget.com/transportation/evs/teslas-full-self-driving-is-switching-to-a-subscription-only-service-120053137.html?src=rss","source":"Engadget"},{"title":"UK scraps digital ID requirement for workers","link":"https://www.engadget.com/cybersecurity/uk-scraps-digital-id-requirement-for-workers-105740207.html?src=rss","date":"Wed, 14 Jan 2026 10:57:40 +0000","desc":"The UK government has backtracked on a plan to require all workers to have a digital ID following a backlash. It will no longer be mandatory to register with the digital ID program to prove one has the right to work in the country, as the BBC reports. The government announced the now-scrapped digital ID requirement in September. &quot;You will not be able to work in the United Kingdom if you do not have digital ID,&quot; Prime Minister Sir Keir Starmer said at the time. &quot;It&#39;s as simple as that.&quot;&nbsp; The government still plans to fully transition to digital right-to-work checks by 2029, using the likes of biometric passports, as it seeks to do away with paper-based systems. Those are &quot;open to fraud and abuse,&quot; a government spokesperson said.&nbsp; Officials have still not explained exactly how the digital ID program will work. The government originally framed digital IDs as a way to make it easier to identify immigrants who are working in the country without having the legal right to do so. It is now said to be focusing more on pressing home the message that digital IDs will help people access public services.&nbsp; A service called One Login will be part of the digital ID system — this currently can be used for things like applying for a veteran card and canceling a lost passport. More than 12 million people have signed up so far. Another service called Wallet will let people store their digital ID on their phone. This would contain their name, date of birth, nationality, residence status and a photo. Almost 3 million people signed an official parliamentary petition to protest the introduction of digital IDs. &quot;We think this would be a step towards mass surveillance and digital control, and that no one should be forced to register with a state-controlled ID system,&quot; the petition states. &quot;We oppose the creation of any national ID system.&quot; This article originally appeared on Engadget at https://www.engadget.com/cybersecurity/uk-scraps-digital-id-requirement-for-workers-105740207.html?src=rss","source":"Engadget"},{"title":"The best USB-C hub for 2026","link":"https://www.engadget.com/computing/accessories/best-usb-c-hub-120051833.html?src=rss","date":"Wed, 14 Jan 2026 10:01:25 +0000","desc":"Having fewer ports makes laptops and tablets lighter and more affordable — but that also cuts down on your connectivity options. If you’ve got a MacBook Air, a slim Chromebook or a tablet you’d like to get more utility out of, a USB-C hub can help. Using just a single port on your device, these multiport adapters will let you hook up screens, tap into Ethernet cables, connect mice and keyboards, and transfer data to drives and memory cards. Most also give you a way to power your device through the hub to maximize port availability. We tested over a dozen models to come up with picks for every budget. Here are the best USB-C hubs, according to our tests. Table of contents Best USB-C hubs for 2026 What to look for in a USB-C hub How we test USB-C hubs Other hubs we tested &nbsp; Recent updates Best USB-C hubs for 2026 What to look for in a USB-C hub Hub vs docking station The first thing to decide is whether you need a USB-C hub or a USB-C docking station. There’s no set standard for what differentiates the two, but docking stations tend to have more ports, offer a separate DC power adapter and cost more, with some reaching upwards of $400. We have a separate guide to the best docking stations to check out if you’re looking for something bigger than what we’re discussing here. USB-C hubs, in contrast, have between four and 10 ports, can support pass-through charging and typically cost between $30 and $150. Hubs, sometimes also called dongles or even multiport adapters, make more sense for smaller setups with just a few peripherals, such as a monitor, a wired keyboard and mouse, and the occasional external drive. They’re also more portable, since they’re small and require no dedicated power. That could be useful if you change work locations but want to bring your accessories with you, or if you want to replace your laptop with a more powerful tablet . A docking station or Thunderbolt dock makes more sense for someone who needs a robust setup for their laptop, including multiple external monitors, webcams, stream decks, microphones and so on. Both docks and hubs make it easy to grab your laptop off your desk for a meeting or other brief relocation and when you get back, you only need to plug in one cable to get all your accessories reconnected. Of course, if you just need to plug in one peripheral, you may not need a hub or a dock, a simple USB-C adapter, like HDMI to USB-C or USB-A to USB-C, may do the trick. Ports For a USB-C hub to work, it needs to connect to a port on your laptop or tablet that supports video, data and power — all of which is covered by anything listed as USB 3.0 or better, including USB4 and Thunderbolt 3 and Thunderbolt 4. The port, of course, needs to be Type-C as well. The sea of laptops out there is vast, so it’s hard to make generalizations, but modern laptops, including Windows and Apple models, should have at least one USB-C port that will suffice, and indeed, every one of our top picks for the best laptops do — including our top pick, the M4 MacBook Air. Next, it’s a matter of finding a good USB-C hub that has the right connections for your needs. Most hubs offer some combo of HDMI, USB, SD card reader, Ethernet and 3.5 mm ports. If you have a 4K monitor and would like at least a 60Hz refresh rate, you’ll need a hub with an HDMI 2.0 port — HDMI 1.4 only goes up to 30Hz. HDMI 2.1 will handle 4K at up to 120Hz, but hubs that have adopted that standard aren’t as common just yet. Keep in mind that a low refresh rate can cause your screen to feel laggy, making your mouse appear glitchy and your webcam movements to look delayed. Additional USB ports on these accessories are usually USB Type-A or USB Type-C. They can support data with different transfer rates, typically 5Gbps or 10Gbps. Some ports only handle passthrough power and no data, and some can do data, power and video, so it’s best to check the spec list to make sure you’re getting the support you need. Keep in mind that a hub may bill itself as a 7-in-1, but one of those ports may not be usable for anything other than charging. Standard SD and microSD cards are useful for transferring data from cameras and the like or for offloading files from your hard drive, and many hubs have those slots. Ethernet ports may deliver faster internet speeds than your Wi-Fi and a hub with a 3.5mm jack can bring back the wired headphone connection that some laptops have ditched. Power delivery Nearly all of the USB-C hubs I tested support passthrough charging. That means if your laptop or tablet only charges via USB, you don’t have to take up another port on your laptop to keep everything topped up. Unlike a docking station, powering a hub is optional. The one exception is if you want to close the lid on your laptop while you work on an external monitor. Most computers will go into sleep mode if the lid is closed without power, so either the laptop or the hub will need to be plugged into the wall to prevent that from happening. Many of the newer hubs include a 100W USB-C power delivery (PD) port, with a healthy 80 to 85 watts going to your Mac, PC, iPad or Android tablet (the hubs take a little of the juice for themselves, hence the 15-watt or so difference). In my tests, a powered USB hub ran hotter than when it wasn&#39;t passing the charge through, so I prefer to power the computer directly using its own charger. But for tablets or other devices with no extra ports, that PD option is important. Some PD ports are also data ports — which is both good and bad. On one hand, it feels wasteful to use a perfectly good data port just for boring old electricity. But on the other hand, USB-C connections that only carry a charge are less versatile, and it makes it seem like it has more accessory hookups than it actually does. Design There’s surprisingly little design variation among hubs. Most look like a flat slab, a little smaller than a smartphone, and have an attached Type-C host cable. The hues range from a silvery black to a silvery gray. Some are thinner than others, some have all ports on one edge and some have ports on both sides. All of this is just to say that aesthetics probably won’t make or break your buying decision. One variation that could tip the scales is the length of the cable. A longer one will give you more freedom as you arrange the hub on your desk, potentially even letting you hide it behind your laptop. Or you may prefer a shorter one to keep the hub neatly set beside your laptop. How we test USB-C hubs Before we test anything, we take a look at what’s available and how they’ve been received by shoppers, forum-goers and other publications. I became familiar with a few reputable brands when I was testing docking stations, so I looked into hubs from those companies as well. I focused on items that would help with an average day of productivity — not high-end setups or demanding gaming situations. Once I settled on a dozen or so that would make good candidates, I had them shipped to my humble office in the desert and started testing them out over the course of a few weeks. I used an M1 MacBook Pro running MacOS Sonoma as the host computer and plugged in accessories that include a 4K Dell monitor, a ZSA USB-C ergo keyboard , a Logitech USB-A gaming mouse , an Elgato USB-C 4K webcam , a Logitech streaming light, a USB-A 3.0 Sandisk thumb drive, a USB-C Samsung T7 Shield external drive and a pair of wired headphones I got for free on an airplane (I should probably invest in some wired headphones, but the cord dangling on my chest drives me nutty so all my earbuds are wireless). I used high-end HDMI and USB-C cables to ensure that any data or connectivity issues weren’t related to my equipment. Then I put each USB-C hub through a gamut of basic tests. I looked at what could be plugged in at once, the resolution on the monitor, data transfer speeds, the overall build quality of the hub and general usability factors, like the placement of the ports and the length of the cords. And, finally, the price-to-value ratio helped determine the best ones for a few different use cases. Other hubs we tested HyperDrive Next 10 Port USB-C Hub There’s a lot to like about HyperDrive’s Next 10 Port USB-C Hub . The tethered cable is a lavish 13 inches long, the HDMI 2.0 port outputs clear and crisp 4K visuals at 60Hz and the high-speed data transfers are great. It has the coveted two USB-C data ports plus a PD port, and there’s even a headphone jack. The only thing that holds back a full-throated endorsement is the way our unit handled a streaming light. Having it on at full brightness made the webcam flicker every time. The issue went away at 75 percent brightness, but the same problem didn’t happen on any other hub I tested. Anker 341 USB-C Hub (7-in-1) There’s nothing wrong with the Anker 341 USB-C hub. In fact it’s a current recommendation in our iPad accessories guide and it comes at a great $35 price. It gives you two USB-A ports as well as SD slots. But at this point, a 1.4 HDMI connection, which only supports 4K resolution at 30Hz feels a little retro. There’s also just a single USB-C downstream port and the data transfer tests proved to be a touch slower than the other hubs. But if you’ve got a lower resolution monitor and don’t need more than one USB-C, you won’t be disappointed with it. Anker 555 8-in-1 It was a tough call between the UGreen Revodoc Pro 109 and the Anker 555 8-in-1 for our top recommendation. Both have a similar port array with an HDMI, Ethernet, two USB Type A, a PD USB-C and a USB-C 3.2 on the 555. And the Anker USB-C hub is $15 cheaper. We went with the UGreen hub for its more premium build, extra USB-A port and longer cord that gives you two extra inches to work with. But if you want to save a few bucks this hub is a worthwhile pick.&nbsp; Startech 4-Port USB-C Hub (data only) I only became aware of Startech when I started researching for this guide. The quality is decent and the yellow accents are a welcome bit of color in the otherwise very gray world of hubs. The performance is solid, with no hiccups that I encountered. The brand’s 4-Port USB-C Hub has a long cord that wraps around the hub itself, which is unique. It doesn’t bother with power delivery, which isn’t an issue if you can power your computer directly. But the four USB ports (three Type-A and one Type-C) max out at 5Gbps and there’s no HDMI connector. It goes for $46, and unfortunately for it, there are cheaper ways to get a few more USB ports for your setup. Recent updates January 2026: Added an honorable mention from Satechi.&nbsp; This article originally appeared on Engadget at https://www.engadget.com/computing/accessories/best-usb-c-hub-120051833.html?src=rss","source":"Engadget"},{"title":"Meta has closed three VR studios as part of its metaverse cuts","link":"https://www.engadget.com/ar-vr/meta-has-closed-three-vr-studios-as-part-of-its-metaverse-cuts-202720670.html?src=rss","date":"Tue, 13 Jan 2026 22:13:38 +0000","desc":"Several of Meta&#39;s VR studios have been affected by the company&#39;s metaverse-focused layoffs. The company has shuttered three of its VR studios, including Armature, Sanzaru and Twisted Pixel. VR fitness app Supernatural will no longer be updated with fresh content. Employees at Twisted Pixel, which released Marvel&#39;s Deadpool VR in November, and Sanzaru, known for Asgard&#39;s Wrath , posted on social media about the closures . Bloomberg reported that Armature, which brought Resident Evil 4 to Quest back in 2021 has also closed and that the popular VR fitness app Supernatural will no longer get updates. “Due to recent organizational changes to our Studio, Supernatural will no longer receive new content or feature updates starting today,” the company wrote in an update on Facebook . The app “will remain active” for existing users. A spokesperson for Meta confirmed the closures. &quot;We said last month that we were shifting some of our investment from Metaverse toward Wearables,&quot; the spokesperson said in a statement to Engadget. &quot;This is part of that effort, and we plan to reinvest the savings to support the growth of wearables this year.&quot; The cuts raise questions about Meta&#39;s commitment to supporting a VR ecosystem it has invested heavily in. The company hasn&#39;t announced any new VR headsets since the Quest 3S in 2024, and last month it &quot; paused &quot; planned Horizon OS headsets from Asus and Lenovo. Now, it&#39;s also pulling back on in-house game development too.&nbsp; Meta is claiming, internally at least, that it remains committed to supporting the industry. “These changes do not mean we are moving away from video games,” Oculus Studios director Tamara Sciamanna wrote in a memo reported by Bloomberg . &quot;With this change we are shifting our investment to focus on our third-party developers and partners to ensure long-term sustainability.” Have a tip for Karissa? You can reach her by email , on X , Bluesky , Threads , or send a message to @karissabe.51 to chat confidentially on Signal. Update, January 13, 2026, 2:13PM PT: This post was updated to additional information about Supernatural. This article originally appeared on Engadget at https://www.engadget.com/ar-vr/meta-has-closed-three-vr-studios-as-part-of-its-metaverse-cuts-202720670.html?src=rss","source":"Engadget"},{"title":"Roblox's age verification system is reportedly a trainwreck","link":"https://www.engadget.com/gaming/robloxs-age-verification-system-is-reportedly-a-trainwreck-220320016.html?src=rss","date":"Tue, 13 Jan 2026 22:03:20 +0000","desc":"Roblox&#39;s age-verification system was designed as a response to allegations it has a child predator problem . Less than a week in, how&#39;s it going? Well, Wired reported on Tuesday that, in some cases, it&#39;s classifying children as adults and adults as children. So, not so great! Last week, Roblox made age verification mandatory for anyone using the platform&#39;s chat feature. That process involves either submitting a facial age estimate via selfie or (optionally for anyone 13 or older) uploading a government ID check. After verifying, you can only chat with groups of players around your age. The move came after reports grew of predators using the platform to groom young children. That, in turn, led to lawsuits from Louisiana , Texas and Kentucky. Meanwhile, Florida&#39;s attorney general has issued criminal subpoenas. So, it might not be hyperbole to say Roblox&#39;s survival could depend on how it handles this problem. It isn&#39;t exactly off to a hot start. There are reports of a 23-year-old being misidentified as a 16- to 17-year-old. (&quot;I don&#39;t want to be chatting with fucking children,&quot; they said.) Another report claimed an 18-year-old was placed in the 13 to 15 range. But the problem is happening in reverse, too. Online videos show children spoofing the system into believing they were adults by using avatar images. One clever kid drew wrinkles and stubble on his face and was instantly deemed 21+. Another flashed a photo of Kurt Cobain and got an adult classification. The feature isn&#39;t working as planned, to say the least. Roblox In addition, Roblox posted last week that some parents were providing age checks on behalf of their children, leading to their children being placed in the 21+ category. The company said it&#39;s &quot;working on solutions to address&quot; that particular problem and will share more soon. Developers with games on Roblox are upset. The platform&#39;s dev forum includes thousands of negative comments about the updates, with many of them wanting the entire update reversed. One shared a graph showing that the percentage using the chat feature dropped from around 90 percent to 36.5 percent. Where does this leave Roblox? Well, with some developers describing games on the platform as feeling &quot;lifeless&quot; or like &quot;a total ghost town,&quot; the company has its hands full. It will have to figure out how to balance its priorities of keeping predators out without breaking things for everyone else. The full report from Wired is worth a read. This article originally appeared on Engadget at https://www.engadget.com/gaming/robloxs-age-verification-system-is-reportedly-a-trainwreck-220320016.html?src=rss","source":"Engadget"},{"title":"Instagram wants you to personalize your Reels algorithm for 2026","link":"https://www.engadget.com/social-media/instagram-wants-you-to-personalize-your-reels-algorithm-for-2026-215252736.html?src=rss","date":"Tue, 13 Jan 2026 21:52:52 +0000","desc":"Last month, Instagram began rolling out a new set of controls that allowed users to personalize the topics recommended to them by the Reels algorithm. Now, Meta is making that feature available to all English users of the app globally, along with the ability to highlight their top topics for the coming year.&nbsp; The feature begins with a selection of topics Meta&#39;s AI thinks you&#39;re interested in based on your recent activity, and has controls to remove them or add new categories. There&#39;s also a separate field for identifying what you want to see less of, and a new &quot;build your 2026 algorithm&quot; that allows you to highlight three topics in particular.&nbsp; Meta&#39;s algorithm tagged a skiing clip as &quot;snowboarding.&quot; Screenshot via Instagram I don&#39;t yet have the 2026-specific control yet, but I was able to tweak some of my preferred topics and was surprised at how quickly the algorithm seemed to adjust. I added &quot;snowboarding&quot; as a topic and then later, when I clicked over to Reels, the first clip I saw was tagged &quot;snowboarding.&quot; Unfortunately, the video wasn&#39;t actually about snowboarding — it featured a clip of a freestyle skiing event — so Meta&#39;s systems might still need a little work at classifying the actual content. But given how sensitive the Reels algorithm can be, it&#39;s nice to have a way of opting out of interests even if you briefly went down a&nbsp; rabbit hole.&nbsp; The feature won&#39;t, however, let you ask to see fewer ads. I tried to add &quot;ads&quot; to my &quot;what you want to see less of&quot; list and received an error. &quot;No results found. Try another topic or interest.&quot; I was able to successfully add &quot;sponsored content&quot; and &quot;AI&quot; to my &quot;see less&quot; list, though I&#39;m pretty sure the latter will affect videos about AI rather than those made with the help of it. This article originally appeared on Engadget at https://www.engadget.com/social-media/instagram-wants-you-to-personalize-your-reels-algorithm-for-2026-215252736.html?src=rss","source":"Engadget"},{"title":"Senate passes Defiance Act for a second time to address Grok deepfakes","link":"https://www.engadget.com/ai/senate-passes-defiance-act-for-a-second-time-to-address-grok-deepfakes-212151712.html?src=rss","date":"Tue, 13 Jan 2026 21:21:51 +0000","desc":"The Senate has passed the Disrupt Explicit Forged Images and Non-Consensual Edits (DEFIANCE ) Act with unanimous consent, according to the bill’s co-sponsor Senator Dick Durbin (D-IL) . The bill lets the subjects of nonconsensual, sexually explicit deepfakes take civil action against the people who create and host them. Deepfakes are a known issue online, but without the proper protections, easy access to AI-powered image and video generation tools has made it possible for anyone to create compromising content using another person&#39;s likeness. This has become a particular problem on X , where the integration of Grok, the AI assistant created by X&#39;s parent company xAI , makes it possible for anyone to turn the content of another person&#39;s post into an image-generating prompt. Over the last month, that&#39;s allowed users to create sexually explicit images of children, just by replying to a post with @grok and a request.&nbsp; In response, Ofcom, the UK&#39;s media regulator, has already opened an investigation into X for potentially violating the Online Safety Act . The chatbot has also been outright blocked in Malaysia and Indonesia . The DEFIANCE Act won&#39;t prevent Grok or other AI tools from generating nonconsensual deepfakes, but it would make creating or hosting that content potentially very expensive for anyone on the receiving end of a lawsuit. The Senate passed an earlier version of the DEFIANCE Act in 2024, but it stalled in the House. Given the urgency of Grok&#39;s deepfake problem, the hope is this new version of the bill won&#39;t see the same resistance. Congress passed an earlier piece of deepfake regulation last year, the Take It Down Act , with bipartisan support. That bill was focused on the companies who host nonconsensual, sexually explicit content, rather than the people exploited by it. This article originally appeared on Engadget at https://www.engadget.com/ai/senate-passes-defiance-act-for-a-second-time-to-address-grok-deepfakes-212151712.html?src=rss","source":"Engadget"},{"title":"Proposed legislation opens the door to robotaxi services in New York","link":"https://www.engadget.com/transportation/proposed-legislation-opens-the-door-to-robotaxi-services-in-new-york-193804671.html?src=rss","date":"Tue, 13 Jan 2026 19:38:04 +0000","desc":"Waymo, Alphabet&#39;s self-driving car company, tested its autonomous vehicles in New York City in 2025, and as part of proposed legislation from New York Governor Kathy Hochul, the company could soon offer its services across the state, Wired reports . Governor Hochul&#39;s proposed legislation was formally announced during a State of the State address covering policy proposals for the upcoming year. The new law, if passed, would loosen the state&#39;s restrictions on self-driving car companies by forming a pilot program that would allow for &quot;the limited deployment of commercial for-hire autonomous passenger vehicles outside New York City.&quot; Applicants to the pilot program would need to demonstrate that they have &quot;local support for [autonomous vehicle] deployment&quot; and prove their &quot;adherence to the highest possible safety standards&quot; to be considered. As a company with presumably good odds of being approved, Waymo supports the legislation. &quot;Governor Hochul’s proposal to legalize fully autonomous vehicles is a transformative moment for New York&#39;s transportation system,&quot; Waymo&#39;s Head of Global Public Policy Justin Kintz said in a statement. &quot;With the Governor’s leadership, New York has the opportunity to pair its investments in slower speeds, better traffic enforcement, and first-in-the-nation congestion management strategies with Waymo’s demonstrably safe technology, creating a future where living in New York is safer, easier, and more accessible.&quot; Waymo already has commercial robotaxi services in select cities in California, Texas and Georgia, offered on its own or in partnership with Uber. The company announced plans to expand in Texas and Florida late last year, and is already committed to offering service in Las Vegas, San Diego and Detroit in 2026. Wired reports Waymo spent over $370,000 lobbying regulators in New York about telecommunications and transportation issues in 2025, and based on today&#39;s announcement, it appears those efforts are paying off. This article originally appeared on Engadget at https://www.engadget.com/transportation/proposed-legislation-opens-the-door-to-robotaxi-services-in-new-york-193804671.html?src=rss","source":"Engadget"},{"title":"Taiwan issues arrest warrant for Pete Lau, CEO of OnePlus","link":"https://www.engadget.com/mobile/smartphones/taiwan-issues-arrest-warrant-for-pete-lau-ceo-of-oneplus-185400997.html?src=rss","date":"Tue, 13 Jan 2026 18:54:00 +0000","desc":"Taiwanese officials have issued an arrest warrant for OnePlus CEO Pete Lau on allegations of illegally employing workers in Taiwan. Two Taiwanese citizens who worked for Lau have also been indicted. The China-based smartphone company has been accused of illegally recruiting more than 70 engineers from Taiwan.&nbsp; Members of the Shilin District Prosecutors Office claim that OnePlus reportedly set up a shell company in Hong Kong with a distinct name, then launched a branch in Taiwan in 2015 without government approval. The branch reportedly worked on research and development for OnePlus mobile phones. Taiwanese officials claim these actions by OnePlus violated the Cross-Strait Act , which is designed as a guide for relations between Taiwan and mainland China. One of the act’s provisions requires Chinese companies to obtain permission from the Taiwanese government to hire workers from Taiwan. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/taiwan-issues-arrest-warrant-for-pete-lau-ceo-of-oneplus-185400997.html?src=rss","source":"Engadget"},{"title":"EA delays Battlefield 6 Season 2 to February 17","link":"https://www.engadget.com/gaming/ea-delays-battlefield-6-season-2-to-february-17-180306743.html?src=rss","date":"Tue, 13 Jan 2026 18:03:06 +0000","desc":"The second season of Battlefield 6 is being pushed back based on “community feedback.” On Tuesday, EA and Battlefield Studios said Season 2 will now arrive on February 17. Season 2 of Battlefield 6 had previously been scheduled for January 20, so we&#39;re looking at a delay of almost a month. As a consolation, the team is extending Season 1 through the start of the next season. &quot;During our ongoing development, we&#39;ve continued to review community feedback and, in order to keep our promise, determined that our best path forward is to extend Season 1 and give ourselves extra time to further polish and refine Season 2,&quot; EA wrote in a blog post . The game came out of the gates hot following its October launch, selling over seven million copies over its first three days . But recent Steam reviews provide a glimpse into the &quot;community feedback&quot; that sparked the delay. &quot;The Battle Pass is extremely predatory and very FOMO, while the season itself doesn&#39;t give a lot to offer,&quot; one review with over 450 “helpful” votes said. They called out the title for having &quot;so much FOMO stuff that it becomes more stressful than fun.&quot; The Season 1 extension will include some bonus content. The Frostfire Bonus Path will give “players the chance to unlock new free and premium customization rewards, including a Weapon Package and a Soldier Skin, as well as XP Boosts, by advancing through the tiers of the Frostfire Bonus Path.&quot; The extension update arrives on January 20. This article originally appeared on Engadget at https://www.engadget.com/gaming/ea-delays-battlefield-6-season-2-to-february-17-180306743.html?src=rss","source":"Engadget"},{"title":"NBA League Pass is up to 55 percent off right now","link":"https://www.engadget.com/entertainment/streaming/nba-league-pass-is-up-to-55-percent-off-right-now-163421218.html?src=rss","date":"Tue, 13 Jan 2026 16:34:21 +0000","desc":"NBA League Pass, the streaming service that lets you catch hundreds of out-of-market NBA games, is on sale right now for up to 55 percent off. The League Pass Premium subscription is on sale for $75, down from $160, while League Pass Standard is marked down to $50 from $110. We&#39;re almost halfway through the season at this point, so it makes sense for a service like League Pass to start offering some discounts. The Standard plan includes commercials and support for only one device at a time, while the Premium tier offers no commercials, in-arena streams during breaks in the game, offline viewing of full games and concurrent streams on up to three devices at once. Last year, League Pass added multiview , which allows you to view up to four games at once on a single screen. This is included across both subscription tiers. The service also added a smart rewind tool that automatically selects key highlights and plays from each game. Outside the US and Canada, League Pass carries every single NBA game live, but within these countries a bevy of restrictions apply. In the US, any games being shown on your regional sports network will be blacked out as the service is meant for out-of-market games only. Also, any nationally broadcast games will not be available live, but instead will be available for on-demand viewing at 6AM ET the following day. The service is only for regular-season games. If you&#39;re an avid NBA fan that follows multiple teams then the League Pass almost certainly carries dozens of games you can watch even with the restrictions in the US. Subscribers can get a list of applicable blackouts by entering their ZIP code before signing up. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/entertainment/streaming/nba-league-pass-is-up-to-55-percent-off-right-now-163421218.html?src=rss","source":"Engadget"},{"title":"Anthropic launches Claude Cowork, a version of its coding AI for regular people","link":"https://www.engadget.com/ai/anthropic-launches-claude-cowork-a-version-of-its-coding-ai-for-regular-people-193000849.html?src=rss","date":"Tue, 13 Jan 2026 15:27:21 +0000","desc":"If you follow Anthropic, you&#39;re probably familiar with Claude Code. Since the fall of 2024 , the company has been training its AI models to use and navigate computers like a human would, and the coding agent has been the most practical expression of that work, giving developers a way to automate rote programming tasks. Starting today, Anthropic is giving regular people a way to take advantage of those capabilities, with the release of a new preview feature called Claude Cowork . The company is billing Cowork as &quot;a simpler way for anyone — not just developers — to work with Claude.&quot; After you give the system access to a folder on your computer, it can read, edit or create new files in that folder on your behalf. Anthropic gives a few different example use cases for Cowork. For instance, you could ask Claude to organize your downloads folder, telling it to rename the files contained within to something that&#39;s easier to parse at a glance. Another example: you could use Claude to turn screenshots of receipts and invoices into a spreadsheet for tracking expenses. Cowork can also navigate websites — provided you install Claude’s Chrome plugin — and make can use Anthropic&#39;s Connectors framework to access third-party apps like Canva. &quot;Cowork is designed to make using Claude for new work as simple as possible. You don’t need to keep manually providing context or converting Claude’s outputs into the right format,&quot; the company said. &quot;Nor do you have to wait for Claude to finish before offering further ideas or feedback: you can queue up tasks and let Claude work through them in parallel.&quot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; If the idea of granting Claude access to your computer sounds ill-advised, Anthropic says Claude &quot;can’t read or edit anything you don’t give it explicit access to.&quot; However, the company does note the system can &quot;take potentially destructive actions,&quot; such as deleting a file that is important to you or misinterpreting your instructions. For that reason, Anthropic suggests it&#39;s best to give &quot;very clear&quot; guidance to Claude.&nbsp;&nbsp;&nbsp; Anthropic isn’t the first to offer a computer agent. Microsoft, for example, has been pushing Copilot hard for nearly three years, despite seemingly limited adoption . For Anthropic, the challenge will be convincing people these tools are useful where others have failed. The fact Claude Code has been universally loved by programmers may make that task easier. For now, Anthropic is giving users of its pricey Claude Max subscription first access to the preview. If you want to try Cowork for yourself, you&#39;ll also need a Mac with the Claude macOS app installed. For everyone else, you’ll need to join a wait list. &nbsp; &nbsp; This article originally appeared on Engadget at https://www.engadget.com/ai/anthropic-launches-claude-cowork-a-version-of-its-coding-ai-for-regular-people-193000849.html?src=rss","source":"Engadget"},{"title":"reMarkable E Ink tablet bundles are up to $90 off right now","link":"https://www.engadget.com/mobile/tablets/remarkable-e-ink-tablet-bundles-are-up-to-90-off-right-now-150242312.html?src=rss","date":"Tue, 13 Jan 2026 15:02:42 +0000","desc":"E Ink tablet maker reMarkable is running a bundle deal right now that can save you between $80 and $90 when buying a reMarkable 2 along with a Marker stylus and a folio case. The savings vary depending on the bundle you configure, but this can bring your out-the-door cost down to $449 from $529 for the tablet, Marker stylus and polymer weave book folio. The company also sells a newer stylus called Marker Plus that lets you erase by flipping it around just like a real pencil, but that will cost you an extra $50. If you’ve been eyeing a dedicated writing tablet for work, school or just jotting down notes without the distraction of endless apps, this bundle deal is an ideal opportunity to pick one up. The reMarkable 2 earned our top pick for best e-ink tablet . In our review , we said the tablet was prettier than ever with a 10.3-inch display and a handsome aluminum frame. The tablet is only 4.7mm thick and weighs less than a pound, helping it feel lean and portable. The display can detect over 4,000 different levels of pressure with the Marker stylus, allowing for precise shading when sketching and the latency between the stylus and the screen is just 21ms. reMarkable fitted the display with a resin layer on top of the glass to make writing on it feel more realistic. We didn&#39;t think this passed muster, but we found writing on it was a joy nonetheless. The tablet supports PDFs and ePUBs, which can be added via the companion mobile app or a desktop computer. You can also pair the reMarkable 2 with Google Drive, Microsoft OneDrive or Dropbox to access files. The battery is rated for an impressive two weeks between charges. The reMarkable Paper Pro, a higher-end model with a richer feature set like a full color display and a built-in reading light, is our pick for best premium e-ink tablet. The pricier tablet also has bundle deals right now with savings up to $80 depending on configuration. Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/mobile/tablets/remarkable-e-ink-tablet-bundles-are-up-to-90-off-right-now-150242312.html?src=rss","source":"Engadget"},{"title":"Meta refocuses on AI hardware as metaverse layoffs begin","link":"https://www.engadget.com/ar-vr/meta-refocuses-on-ai-hardware-as-metaverse-layoffs-begin-145924706.html?src=rss","date":"Tue, 13 Jan 2026 14:59:24 +0000","desc":"As we expected , Meta has begun laying off more than 1,000 employees from its Reality Labs division, which focused on virtual reality and metaverse products, Bloomberg reports . The company will refocus on developing wearables, like its recent batch of AI-powered Ray-Ban smart glasses, according to a memo from CTO Andrew Bosworth. The news isn’t too surprising. Reality Labs has lost more than $70 billion since the beginning of 2021, and while Meta has done a solid job of delivering desirable consumer VR headsets and smart glasses, that business hasn’t been nearly profitable enough to justify the cost. And of course, Mark Zuckerberg’s huge gamble on the metaverse, which involved renaming the company from Facebook to Meta in 2021, has gone nowhere. According to Bloomberg, Meta’s metaverse plans will now focus on mobile devices, which could mean a combination of its future wearables as well as existing mobile apps. “With the larger potential user base and the fastest growth rate today, we are shifting teams and resources almost exclusively to mobile to continue to accelerate adoption there,” Bosworth wrote in a memo to staff this morning. Meta isn’t dumping its VR headset plans entirely, but according to Bosworth the VR divion will “operate as a leaner, flatter organization with a more focused road map to maximize long-term sustainability.” Basically, don’t expect a Quest 3 follow-up anytime soon. This article originally appeared on Engadget at https://www.engadget.com/ar-vr/meta-refocuses-on-ai-hardware-as-metaverse-layoffs-begin-145924706.html?src=rss","source":"Engadget"},{"title":"Apple bundles creative apps such as Final Cut Pro and Logic Pro into a single subscription","link":"https://www.engadget.com/apps/apple-bundles-creative-apps-such-as-final-cut-pro-and-logic-pro-into-a-single-subscription-145210038.html?src=rss","date":"Tue, 13 Jan 2026 14:52:10 +0000","desc":"Apple has been putting more onus on its services for the past several years — the company makes tens of billions of dollars in revenue from that side of the business, which it claimed had a record year in 2025 . Apple is nudging a little more in that direction with a new subscription bundle called Apple Creator Studio . This allows creators to pay a single fee ($13 per month or $129 per year) to use Final Cut Pro, Logic Pro, Pixelmator Pro , Motion, Compressor and MainStage. Subscribers will get access to “premium content” in Pages, Keynote and Numbers (as well as in Freeform later this year). Of course, there are AI features too. Apple Creator Studio will be available starting on January 28 and you can try it out at no cost through a one-month free trial. College students and educators can subscribe to Apple Creator Studio for $3 per month or $30 per year. Up to six people can access all of the plan’s features if one person in a Family Sharing group subscribes. Apple noted that Final Cut Pro, Pixelmator Pro, Logic Pro, Motion, Compressor and MainStage will still be available as one-time purchases for Mac through the Mac App Store. Given that those can be pretty pricy (going up to $300 for Final Cut Pro), the subscription could be enticing to many burgeoning creators. This seems like Apple’s attempt to muscle in on Adobe’s territory , especially now that it’s bringing AI features to many of these apps. Adding new features to productivity apps like Numbers and Keynote means Apple’s taking a shot at the likes of Microsoft 365 Copilot (yeeeeah, that’s what Office is called now) and Google Workspace as well. On Mac and iPad, Final Cut Pro has a new feature called Beat Detection. Apple suggests this makes “editing video to the rhythm of music fast and fun.” It uses an AI model from Logic Pro to analyze music tracks and display a Beat Grid. The idea here is to visualize song parts, beats and bars to help editors align their cuts with the music. The Montage Maker tool in Final Cut Pro on an iPad. Apple An AI-powered Montage Maker tool can stitch together “a dynamic video based on the best visual moments within the footage.” You’ll be able to tweak these montages and use an Auto Crop tool to reframe the clip into a vertical format to make it a better fit for social media. Final Cut Pro has transcript and visual search functions too. Logic Pro, MainStage, Pixelmator Pro (which is coming to iPad with Apple Pencil support) and Motion will all have AI-powered features as well. As you might expect, you’ll need an Apple Intelligence-capable device to use some of these. Apple is also introducing something called the Content Hub. This media library includes “curated, high-quality photos, graphics and illustrations.” As for Keynote, Pages, and Numbers, you’ll be able to access premium templates and themes in those otherwise-free apps with a Apple Creator Studio plan. Subscribers will be able to try beta versions of new features, such as a way to generate a draft of a Keynote presentation text based on an outline, and a Magic Fill tool to generate formulas and fill in tables in Numbers. This article originally appeared on Engadget at https://www.engadget.com/apps/apple-bundles-creative-apps-such-as-final-cut-pro-and-logic-pro-into-a-single-subscription-145210038.html?src=rss","source":"Engadget"},{"title":"Anker's Solix E10 battery backup can power your entire house in a blackout","link":"https://www.engadget.com/home/ankers-solix-e10-battery-backup-can-power-your-entire-house-in-a-blackout-143040115.html?src=rss","date":"Tue, 13 Jan 2026 14:30:40 +0000","desc":"Anker is going up against Tesla in the home battery backup segment with Solix E10 that promises &quot;whole-home backup&quot; at an affordable price. The system delivers enough power to handle heavy-duty air conditioners and other high-power appliances in the event of a blackout. It also claims that the E10 supports DIY-friendly installation thanks to the stackable, plug-and-play design.&nbsp; Each Anker Solix E10 unit can deliver up to 37.2kW of surge power and stacking two boosts that to 66kW. It also comes with a &quot;turbo output&quot; mode that can output 10kW per unit for 90 minutes maximum. That level of power, along with the minimal 20ms auto-switch time (from grid to battery), means you may not even notice if the power grid goes down.&nbsp; Anker For large installations, you can stack up to three E10 units to boost power to 90kWh, enough to provide whole home backup for up to 15 days (average US consumption is 30kWh per day so that might be stretching it). If that&#39;s not enough, you can add Anker&#39;s tri-fuel Solix Smart Generator 5500 that runs on gasoline, propane or natural gas and charges the E10 batteries via DC for maximum efficiency. The E10 can also handle up to 9kW of input from solar panels, or 27kW with three units.&nbsp; Anker&#39;s Solix E10 can be purchased with several optional components. The Power Dock allows auto switching from grid power in the even of an outage in 20 milliseconds, while the Smart Inlet Box provides a manual switchover option. The latter lets you charge the E10 batteries from the grid with existing solar systems to save money.&nbsp; In the event of a wild storm, units are weatherproof thanks to the all-metal enclosures and can be operated in temperatures ranging from -4 to 131 degrees Fahrenheit. As for pricing, the Solix E10 costs $4,299 by itself, $4,599 with the Smart Inlet Box, $5,799 with the Solix Power Dock and $7,399 with the Solix Power Dock and Smart Generator. Adding an extra E10 unit would boost the latter price to around $10,000. However, Anker claims lower installation costs for the Solix E10 than Tesla and other manufacturers due to its modular nature and says it&#39;s so intuitive that some buyers could do a DIY installation. The Solix E10 is now available for pre-order . This article originally appeared on Engadget at https://www.engadget.com/home/ankers-solix-e10-battery-backup-can-power-your-entire-house-in-a-blackout-143040115.html?src=rss","source":"Engadget"},{"title":"Tesla launches a seven-seat version of the 2026 Model Y","link":"https://www.engadget.com/transportation/evs/tesla-launches-a-seven-seat-version-of-the-2026-model-y-130039385.html?src=rss","date":"Tue, 13 Jan 2026 14:00:39 +0000","desc":"Tesla&#39;s 2026 Model Y is now available on the company&#39;s site and it comes with a new (and old) option: a seven-seat version via a third row. The extra seating costs $2,500 and is only available if you order the Premium All-Wheel-Drive Long Range model. Tesla first teased the option last year via an email to prospective buyers with the promise of &quot;seating for up to seven and enough room for everyone&#39;s gear,&quot; Electrek reported at the time.&nbsp; The new seats appear to be designed mainly for children as they don&#39;t offer much legroom, according to images on Tesla&#39;s configurator. Tesla notes that the seven-seat interior &quot;features fold-flat second-row and third-row seats,&quot; though it&#39;s not clear if those seats fold down electrically like the second row.&nbsp; Tesla Tesla is facing increased competition , especially in the crossover/SUV category, and saw another sales decline last quarter. The company previously sold a seven-seat version of the Model Y in the US for a short time before it was refreshed early last year. Since then, though, it has only been available with five seats. Tesla launched a six-seat &quot;Model YL&quot; version in China in August 2025 with a six-inch wheelbase extension that the US model lacks. Elon Musk said that model would come to the US market in late 2026 or maybe &quot;never.&quot;&nbsp; Otherwise, changes to the Model Y lineup are minor and confined to the Premium version. Those include a 20-inch dark-grey &quot;Helix&quot; &quot;wheel option, a new black headliner, a bigger, higher-resolution 16-inch display and darker rear badging.&nbsp; This article originally appeared on Engadget at https://www.engadget.com/transportation/evs/tesla-launches-a-seven-seat-version-of-the-2026-model-y-130039385.html?src=rss","source":"Engadget"},{"title":"Star Wars Outlaws developer Massive Entertainment and Ubisoft Stockholm face layoffs","link":"https://www.engadget.com/gaming/star-wars-outlaws-developer-massive-entertainment-and-ubisoft-stockholm-face-layoffs-134234968.html?src=rss","date":"Tue, 13 Jan 2026 13:42:34 +0000","desc":"We aren&#39;t even two weeks into the new year and Ubisoft is already looking to carry out its second round of layoffs in 2026. The company has informed workers at Massive Entertainment and Ubisoft Stockholm of a &quot;proposed organizational restructure&quot; that could affect around 55 roles across its two Swedish studios. Workers at Massive (the developer of The Division series, Star Wars Outlaws and Avatar: Frontiers of Pandora ) were offered voluntary buyouts late last year as part of Ubisoft&#39;s ongoing cost-cutting efforts . &quot;This restructure follows the completion of the Voluntary Leave Program launched during the fall of 2025, a finalized long-term roadmap and a completed staffing and appointment process, which together have provided clearer visibility into the structure and capacity required to support the two studios’ work and sustainably over time,&quot; Ubisoft told IGN in a statement. &quot;These proposed changes are forward-looking and structural, they are not related to individual performance, recent deliveries or the quality of the work produced by the teams.&quot; Ubisoft claims that the &quot;long-term direction for the studios remains unchanged.&quot; Massive will continue working on projects that include The Division 3 . Ubisoft Stockholm, meanwhile, is beavering away on a new franchise that&#39;s still under wraps for now. That project is harnessing the studio&#39;s Ubisoft Scalar cloud computing tech, according to Game Developer . Earlier in January, the company said it was shutting down Ubisoft Halifax , resulting in the loss of 71 jobs. Workers at that studio unionized just 16 days earlier. Ubisoft said its decision was part of &quot;company-wide actions to streamline operations.&quot; This article originally appeared on Engadget at https://www.engadget.com/gaming/star-wars-outlaws-developer-massive-entertainment-and-ubisoft-stockholm-face-layoffs-134234968.html?src=rss","source":"Engadget"},{"title":"A Resident Evil showcase is taking place on January 15","link":"https://www.engadget.com/gaming/a-resident-evil-showcase-is-taking-place-on-january-15-133000548.html?src=rss","date":"Tue, 13 Jan 2026 13:30:00 +0000","desc":"Resident Evil Requiem , the first new mainline entry in the series since 2021’s Resident Evil Village , is just over a month away and Capcom is ready to share more details. The publisher will air a Resident Evil Showcase on January 15 at 5PM ET. You’ll be able to watch it on Twitch and YouTube (in English and Japanese ). The stream will run for around 12 minutes. It will feature “all the latest info on Resident Evil Requiem ,” which will almost certainly include some gameplay ahead of it hitting PS5, Xbox Series X/S, Nintendo Switch 2 and Steam on February 27 . Capcom might have more in store, though. An announcement for the showcase on the Resident Evil website states that, “Some of the games included in the show aren&#39;t suitable for children.” That suggests the company will share details about other RE titles. It may just be a case of Capcom offering a reminder that it’s also bringing ports of Resident Evil 7 and Village to Switch 2 on February 27. Still, there’s a chance we’ll hear news of more ports. There’s also the possibility that we get a glimpse of the next Resident Evil movie, a reboot of the series from Barbarian and Weapons filmmaker Zack Cregger that’s set to hit theaters in September.&nbsp; This article originally appeared on Engadget at https://www.engadget.com/gaming/a-resident-evil-showcase-is-taking-place-on-january-15-133000548.html?src=rss","source":"Engadget"},{"title":"AirTags are back on sale, with a four-pack going for $65","link":"https://www.engadget.com/deals/airtags-are-back-on-sale-with-a-four-pack-going-for-65-202333994.html?src=rss","date":"Tue, 13 Jan 2026 13:14:02 +0000","desc":"Most Apple products are pretty expensive, but some of the most affordable (and useful) ones are AirTags . The Bluetooth trackers are priced pretty reasonably even when not on sale, but they can be a steal if you can get them on a discount — like right now. A four pack of AirTags is on sale for $65 at Amazon, which is only a few dollars more than the record-low price we saw during Black Friday this year. AirTags can be useful for people who travel frequently, helping you to keep track of essentials like your passport as well as a way to keep tabs on luggage while you&#39;re on the go. If you do purchase some AirTags, we have some recommendations for useful accessories to go along with them, such as different styles of cases to best attach the trackers to different types of items. These are worth looking over and adding to your shopping cart in order to make the most of the product.&nbsp; AirTags have an IP67 rating for water and dust resistance and their replaceable batteries should last for about a year. They can also support Precision Finding, which gives more exact directions to a lost item, when paired with most models after the iPhone 11. Up to five people can share an AirTag&#39;s location, which is helpful for families or large travel groups.&nbsp; Follow @EngadgetDeals on X for the latest tech deals and buying advice . This article originally appeared on Engadget at https://www.engadget.com/deals/airtags-are-back-on-sale-with-a-four-pack-going-for-65-202333994.html?src=rss","source":"Engadget"},{"title":"Insta360 releases AI-powered follow-up to its Link webcams","link":"https://www.engadget.com/cameras/insta360-releases-ai-powered-follow-up-to-its-link-webcams-130003572.html?src=rss","date":"Tue, 13 Jan 2026 13:00:03 +0000","desc":"Insta360, a company most known for its action cameras , has released two new AI-powered 4K webcams, the Link 2 Pro and Link 2C Pro, aimed at creators, educators and remote professionals. The company&#39;s goal with these models is &quot;a webcam experience that looks and sounds remarkably close to a professional camera and microphone setup.&quot; Both models use a larger 1/1.3-inch sensor with dual native ISO for improved low-light performance over the previous generation , and both support HDR. Insta360 says the audio on both models leverages beamforming technology as well as AI noise canceling to help voices sound clearer in noisy environments. Users can choose from four pickup modes designed for different sound sources like &quot;Focus&quot; that isolates a single voice or &quot;Wide&quot; if there are multiple speakers. Video resolution on both models tops out 4K at 30 fps, and Insta360 says its updated True Focus system uses phase-detection autofocus to lock onto subjects, keeping them in focus while they move. There&#39;s also a &quot;Natural Bokeh&quot; mode meant to mimic the shallow depth-of-field look of a traditional DSLR camera, for users who enjoy that look. As for what sets them apart, the Link 2 Pro sports a 2-axis gimbal for AI-assisted tracking, which offers single or group-mode framing, while the Link 2C Pro is static and designed for fixed-position setups. Both models offer gesture control features, allowing users to control certain functions hands-free. These include starting or stopping tracking and zooming in or out. Both models also include a magnetic mount for easy placement on metal surfaces. Several different modes are offered that aid in teaching and presenting. Among them are Smart Whiteboard mode, which will automatically detect a user&#39;s whiteboard and keep it clearly in frame, and DeskView mode, which captures an overhead view of a user&#39;s desk. There&#39;s also a green screen mode, a portrait mode and support for virtual backgrounds. The new webcams also support Insta360 InSight, the company&#39;s subscription AI-powered meeting assistant. InSight can record meetings, generate transcripts, create summaries and more. The Link 2 Pro will retail for $250 while the Link 2C Pro will go for $200. Both models are available for purchase now . This article originally appeared on Engadget at https://www.engadget.com/cameras/insta360-releases-ai-powered-follow-up-to-its-link-webcams-130003572.html?src=rss","source":"Engadget"},{"title":"The Morning After: Apple will use Gemini to power Siri AI","link":"https://www.engadget.com/general/the-morning-after-engadget-newsletter-151521620.html?src=rss","date":"Tue, 13 Jan 2026 12:15:21 +0000","desc":"Apple and Google have confirmed that Gemini’s models power the new version of Siri and other generative AI features. CNBC broke the news, but Apple and Google soon followed up with a lengthy joint statement. Here’s part of it: “Apple determined that Google’s Al technology provides the most capable foundation for Apple Foundation Models… Apple Intelligence will continue to run on Apple devices and Private Cloud Compute, while maintaining Apple’s industry-leading privacy standards.” In June, it was reported that Apple was considering partnerships with OpenAI and Anthropic for Siri (the voice assistant can currently tap ChatGPT for certain queries as part of Apple Intelligence). Two months later, Google emerged as a contender. Another report suggested Apple might build the new Siri using a custom version of Gemini — and that it would pay Google around $1 billion a year for the privilege. However, no official deal numbers were shared. It’s also notable that current iPhones have direct access to OpenAI’s ChatGPT. But how long for? — Mat Smith The other big stories this morning Engadget Podcast: Best of CES 2026 and a chat with Pebble’s founder Meta closes 550,000 accounts to comply with Australia’s kids social media ban The best winter tech to get you through the coldest months Meta appoints ex-Trump and Bush official as its new president and vice chair Netflix wins 7 awards at the Golden Globes Adolescence and KPop Demon Hunters picked up several each. Netflix Netflix’s hit show Adolescence received four awards, including best limited or anthology series. It also won best actor (Stephen Graham), supporting actor (Owen Cooper) and supporting actress (Erin Doherty) in a miniseries or television film. KPop Demon Hunters — which my nieces refuse to stop talking about — won best animated feature and best original song. “I just want to say this award goes to people who have had doors closed on them, and I can confidently say rejection is redirection. So never give up.” It’s not all good news. Netflix also won best performance in stand-up comedy on television for Ricky Gervais: Mortality. Apple and HBO Max each won three, and Hulu got one award on the night. Continue reading. NASA makes final preparations for its first crewed moon mission in over 50 years The agency is targeting a February launch date for Artemis 2. A few years ago, NASA announced it was pushing the Artemis 2 mission back to April 2026. The agency now says it could launch as early as February. NASA is finalizing preparations for the mission and will soon roll out the Space Launch System (SLS) rocket and the Orion spacecraft to the launch pad at the Kennedy Space Center in Florida. Artemis 2 is the first crewed mission to the moon since the Apollo program’s final flight in 1972. The 10-day mission will have four astronauts, who’ll test whether Orion’s critical life-support systems can sustain human passengers on future longer-duration missions. They will first orbit the Earth twice before making their way 4,700 miles beyond the far side of the moon. Continue reading. Lego’s first Pokémon sets are now available for pre-order Pikachu, Eevee, Venusaur, Charizard and Blastoise will ship February 27. Lego Pre-orders for the first three Lego-Pokémon kits are open now. One of the debut pocket monsters is, of course, Pikachu. You can build the 2,050-piece kit to show Pikachu either at rest or leaping out of an open Poké Ball into battle. It costs $200. There’s also a 587-piece model of Eevee, for $60. On the bigger side is a set featuring a trio of Pokémon: Venusaur, Charizard and Blastoise. This kit has 6,838 pieces and can show the group together in battle formation or separately in their own mini environments. It retails for $650 and is a bit much. Continue reading. This article originally appeared on Engadget at https://www.engadget.com/general/the-morning-after-engadget-newsletter-151521620.html?src=rss","source":"Engadget"},{"title":"Proton's Lumo AI chatbot now has an encrypted space for your projects","link":"https://www.engadget.com/ai/protons-lumo-ai-chatbot-now-has-an-encrypted-space-for-your-projects-110000298.html?src=rss","date":"Tue, 13 Jan 2026 11:00:00 +0000","desc":"Proton’s latest update for Lumo , its privacy-focused chatbot, introduces a feature called Projects. It’s a dedicated and encrypted space for tasks that you know you’ll access again and again over an extended period of time, such as papers you’ll have to work on the whole semester or plans for a big trip you’re taking later this year. Lumo will remember and keep all the information and all the files you upload for every project you create. Any document you upload or resources you add to the chat will sync across devices, so you don’t have to repeat yourself every time you access a task. Projects are also integrated with Proton Drive, allowing you to easily link documents and other files in your chats. Proton says you can use the feature for just about any topic you want and give the chatbot tailored instructions for every project you create. It also said that each project is its own encrypted environment and that it will not use your chat histories to train AI models. To be clear, Lumo uses open source AI models, including Nemo, OpenHands 32B, OLMO 2 32B and Mistral Small 3. The latest version of Lumo is now available to all users, but you’re only limited to one project if you’re on a free account. To be able to created an unlimited number of projects, you’ll have to subscribe to Lumo Plus, which costs $10 a month. This article originally appeared on Engadget at https://www.engadget.com/ai/protons-lumo-ai-chatbot-now-has-an-encrypted-space-for-your-projects-110000298.html?src=rss","source":"Engadget"},{"title":"The best streaming devices for 2026","link":"https://www.engadget.com/entertainment/streaming/best-streaming-devices-media-players-123021395.html?src=rss","date":"Tue, 13 Jan 2026 10:01:26 +0000","desc":"With the dominance of smart TVs, streaming sticks and boxes may seem redundant — but if your smart set is slow or has a frustrating user interface, a streaming device will let you bypass your TV’s built-in OS and use Google TV, Fire TV, Apple TV or something else instead. There are a lot of streaming gadgets out there, all with different operating systems, memory capacities, video resolutions and bonus features, such as headphone connections and ambient modes that fill your screen with stills when you’re not watching. We tested options from the major brands and broke down exactly what each device gives you so you can pick the best streaming device for your TV. Table of contents The best TV streaming devices for 2026 What to look for in a TV streaming device How we tested and picked the best streaming devices Best streaming devices for 2026 What to look for in a TV streaming device Operating system and interface Google’s TV Streamer, the Apple TV 4K, Amazon’s Fire TV Sticks and Roku devices are the most popular players in the space. Three of those brands also come built into TVs, such as Fire, Google and Roku TVs, but the Apple TV 4K doesn&#39;t come pre-loaded on any set. Each one has a unique operating system and interface. This may be the biggest deciding factor for many people, as it determines how the home entertainment you want to watch is arranged and presented. We go into detail for each platform below, but all of them come with home screens that, to varying degrees, gather your apps in one place, present the movies and TV shows you’re currently watching and give you suggestions of other media streaming options. Nearly all streaming devices come with a remote that lets you search and do other operations using your voice, eliminating the need to hunt and peck at on-screen keyboards. They all offer “universal search,” in which searching for a title takes you to whichever app has it available. If you want to watch Wicked but don’t know where it’s playing, just push the voice button on the remote and say &quot;Wicked.” (We found simply saying the title or the genre you want sometimes works better than saying “Show me…” or “Search for…”) From the search results, hit the play button and the correct app will open and start playing — assuming you’ve previously logged into that app and, in most cases, have an active subscription. Connectivity Most streaming sticks connect to the internet via Wi-Fi, with the majority of them supporting Wi-Fi 5 or 6 protocols. Set-top boxes can also have Ethernet ports, so you can hardwire your internet connection to the device, which is typically faster than wireless. Streaming media players connect to your TV through an HDMI port, and most sticks hide behind the screen, while set-top boxes sit on a surface nearby. Nearly all units also plug into an AC outlet for power. Some sticks used to work by pulling power from a USB port on the TV, but increasingly, these devices are designed to plug into the wall. Video and audio features If your home theater setup has a screen that can display 4K content with Dolby Vision and HDR10, you’ll want a streaming device that supports those high-end formats. Of course, even the most top-shelf streamer can’t make a 1080p TV stream 4K. The series or movie also has to be transmitted in 4K and, increasingly , companies restrict higher-quality streaming to more expensive subscription plans. In short, every element needs to support the video or audio feature, otherwise the highest quality you’ll get will be the lowest of any component in the chain. Remotes Most remotes that come with streaming devices will allow you to control the power and volume of your TV. Some of the less expensive devices, however, don&#39;t have that feature, so you&#39;ll need to use your TV&#39;s remote control to turn it on, then use the streaming remote to navigate the streamer&#39;s interface. If your streamer&#39;s remote does offer power and volume controls, the setup process will usually calibrate your remote to your TV. If you want to use a soundbar, such as from Sonos or other brands, for audio you may also have to take the additional step of pairing your remote to the speaker. Voice control In addition to helping you find stuff to watch, streaming devices from Apple, Google and Amazon can answer questions about the weather, sports scores and general facts using built-in voice assistants. They can also act as smart home controllers to turn off connected smart bulbs or plugs and show feeds from smart cameras. Just remember, as with all smart home devices, compatibility is key. Fire TV devices work with Alexa-enabled smart home equipment; the Google TV Streamer lets you control Google Home devices; and Apple TV 4Ks play nice with HomeKit and other Apple devices. Rokus grant power over Roku’s smart home products, but also work with the other ecosystems. How we tested and picked the best streaming devices Like every gadget we test, we start by researching what’s worthy of reviewing. Then we get a hold of the devices ourselves and see how well they work. We don’t have a central Engadget lab; we test things in our own living rooms, on our own TV sets. We also figure that’s a better approximation of your own TV experience anyway. We began testing streaming devices as far back as 2007 with the first Apple TV device . Since then, we’ve tried out most of the major new releases to come along — from the Roku Stick back in 2014 to the 2024 Google TV Streamer 4K . A few years ago, we decided to compile the streaming devices we reviewed into this guide. Since then, we’ve updated our top picks using verdicts from our reviews, as well the testing we perform just for this guide. As new devices come out, we try them and, if something is worthy, we add it to our top picks on this list. This article originally appeared on Engadget at https://www.engadget.com/entertainment/streaming/best-streaming-devices-media-players-123021395.html?src=rss","source":"Engadget"},{"title":"Framework increases Desktop prices by up to $460 due to RAM crisis","link":"https://www.engadget.com/computing/framework-increases-desktop-prices-by-up-to-460-due-to-ram-crisis-234827145.html?src=rss","date":"Mon, 12 Jan 2026 23:48:27 +0000","desc":"Computer brand Framework has hiked the prices on RAM for its Desktop systems and Mainframes in response to rising costs with its suppliers. Compared with when the Desktops were announced , the 32GB and 64GB options each cost $40 more, but its 128GB variation now costs an extra $460. The current pricing for machines is $1,139 for 32GB, $1,639 for 64GB or $2,459 for 128GB.&nbsp; Since the company began altering its pricing structure last month, it committed to remaining transparent with customers about the changes happening to RAM prices. Framework also said it would reduce prices again once the market calms down. The original prices will be honored for any existing pre-orders.&nbsp; One of the big takeaways from CES 2026 was that RAM is going to be an expensive commodity this year. The rising costs are largely in response to artificial intelligence projects, such as the rush to build data centers. As a result, buyers who take the modular approach may want to upgrade less costly components for better specs without making the increasingly hefty investment in memory. This article originally appeared on Engadget at https://www.engadget.com/computing/framework-increases-desktop-prices-by-up-to-460-due-to-ram-crisis-234827145.html?src=rss","source":"Engadget"}]