[{"title":"Trump administration sues two California cities over natural gas bans","link":"https://www.latimes.com/environment/story/2026-01-14/trump-administration-sues-two-california-cities-over-natural-gas-bans","date":"Wed, 14 Jan 2026 20:55:12 GMT","desc":"The Justice Department said natural gas bans in Petaluma and Morgan Hill drive up costs and conflict with federal policy. Both cities said they have not enforced their bans in several years.","source":"LA Times"},{"title":"Filmmaker who helped crack gay porn actor&#x27;s gruesome Hollywood killing wins SXSW premiere","link":"https://www.latimes.com/california/story/2026-01-14/filmmaker-who-helped-crack-gay-porn-actors-gruesome-hollywood-killing-wins-sxsw-premiere","date":"Wed, 14 Jan 2026 19:11:17 GMT","desc":"A Los Angeles filmmaker who helped crack a gay porn actor's gruesome Hollywood cold case murder has since made a film about it, which has been selected to premiere at SXSW in March.","source":"LA Times"},{"title":"Why $100 million in endorsements says Shohei Ohtani is the global face of sport","link":"https://www.latimes.com/sports/dodgers/story/2026-01-14/100-million-shohei-ohtani-dodgers-marketing-revenue","date":"Wed, 14 Jan 2026 19:04:21 GMT","desc":"In 2025, the athlete making the most money from sponsorships and endorsements is a baseball player: the Dodgers' Shohei Ohtani, of course.","source":"LA Times"},{"title":"L.A. is awash in potholes after record rains, making commutes ever more treacherous","link":"https://www.latimes.com/california/story/2026-01-14/la-is-awash-in-potholes-after-record-rains-making-commutes-ever-more-treacherous","date":"Wed, 14 Jan 2026 19:00:03 GMT","desc":"Potholes are plaguing Los Angeles after recent storms. More than 14 inches of rain fell on downtown L.A. between October and last week — roughly 99% of what the city typically sees during the entire rainy season.","source":"LA Times"},{"title":"California launches investigation into child porn on Elon Musk&#x27;s AI site","link":"https://www.latimes.com/california/story/2026-01-14/newsom-calls-for-investigation-into-social-media-site","date":"Wed, 14 Jan 2026 18:27:54 GMT","desc":"Gov. Gavin Newsom on Wednesday called the state to investigate Elon Musk's artificial intelligence company xAI, saying that the social media site owned by the billionaire is a \"breeding ground for predators to spread nonconsenual sexually explicit AI deepfakes.\"","source":"LA Times"},{"title":"Cancer survival rates soar nationwide, but L.A. doctors warn cultural and educational barriers leave some behind","link":"https://www.latimes.com/science/story/2026-01-14/cancer-survival-rates-soar-nationwide-but-socioeconomic-barriers-leave-some-behind","date":"Wed, 14 Jan 2026 17:28:55 GMT","desc":"An annual report from the American Cancer Society shows that, for the first time, over 70% of Americans diagnosed with cancer can expect to live at least five years. The increase from the mid-1970s, when that number was just 49% is huge. But not all Americans are benefitting equally.","source":"LA Times"},{"title":"After 3 years of repairs, Highway 1 through Big Sur fully reopens","link":"https://www.latimes.com/california/story/2026-01-14/california-highway-1-through-big-sur-to-fully-reopen-this-week","date":"Wed, 14 Jan 2026 17:17:32 GMT","desc":"After landslides and rockfalls repeatedly damaged and buried sections of California's Highway 1, the scenic roadway fully reopened for the first time in three years.","source":"LA Times"},{"title":"Fire destroys business in North Hills, displaces dozens of neighboring residents","link":"https://www.latimes.com/california/story/2026-01-14/north-hills-structure-fire","date":"Wed, 14 Jan 2026 17:14:55 GMT","desc":"The blaze was threatening a neighboring four-story apartment building where dozens of residents were evacuated.","source":"LA Times"},{"title":"National park staff are asking about the citizenship status of visitors","link":"https://www.latimes.com/california/story/2026-01-14/national-park-staff-are-asking-about-citizenship-status-heres-why","date":"Wed, 14 Jan 2026 12:00:00 GMT","desc":"Planning to visit Yosemite or Sequoia National Parks? You could be asked for your citizenship status.","source":"LA Times"},{"title":"Iranian Americans in SoCal watch Iran protests with a mix of hope and &#x27;visceral dread&#x27;","link":"https://www.latimes.com/california/story/2026-01-14/iranian-americans-protests-california-iran-protests","date":"Wed, 14 Jan 2026 11:00:00 GMT","desc":"In Southern California, home to the nation's largest Iranian diaspora, the anti-government protests in Iran are being watched nervously.","source":"LA Times"},{"title":"Chabria: ICE can&#x27;t be trusted. Can California force accountability?","link":"https://www.latimes.com/california/story/2026-01-14/ice-cant-be-trusted-can-california-force-accountability","date":"Wed, 14 Jan 2026 11:00:00 GMT","desc":"ICE has lost credibility with the public after the fatal shooting of Renee Good. California has the best plan for demanding accountability from the opaque agency.","source":"LA Times"},{"title":"Shuttered St. Vincent Medical Center to become homeless service campus","link":"https://www.latimes.com/california/story/2026-01-14/shuttered-st-vincent-medical-center-to-become-homeless-service-campus","date":"Wed, 14 Jan 2026 11:00:00 GMT","desc":"Private investors purchased the shuttered St. Vincent Medical Center in Los Angeles and are partnering with nonprofits and government to turn the campus into a one-stop shop for homeless people to seek help.","source":"LA Times"},{"title":"Very little plastic being recycled in California as state efforts falter","link":"https://www.latimes.com/environment/story/2026-01-14/very-little-plastic-being-recycled-in-california-as-state-efforts-falter","date":"Wed, 14 Jan 2026 11:00:00 GMT","desc":"California has hailed itself as a leader in single-use plastic reduction and legislation. But a scuttling of its pioneering law, and a new report on the dismal state of recycling in the state, shows things aren't so green in the Golden State.","source":"LA Times"},{"title":"Lawsuits against ICE agents would be allowed under proposed California law","link":"https://www.latimes.com/california/story/2026-01-13/lawsuits-against-ice-agents-might-be-allowed-under-proposed-california-bill","date":"Wed, 14 Jan 2026 03:47:46 GMT","desc":"A bill by Sen. Scott Wiener (D-San Francisco) would make it easier for people to sue federal immigration officers in state court over constitutional violations.","source":"LA Times"},{"title":"Latest Altadena bear squatter is gone — for now. Why it won&#x27;t be the last","link":"https://www.latimes.com/california/story/2026-01-13/latest-altadena-bear-squatter-is-gone-for-now-why-it-wont-be-last","date":"Wed, 14 Jan 2026 03:08:49 GMT","desc":"On Sunday, Pasadena Humane was notified of a bear that had crawled into an Altadena home's crawlspace. As of Tuesday, the bear is no longer there. It is not clear if this is the same bear that squatting under a nearby home a week prior.","source":"LA Times"},{"title":"L.A. County moves to carve out &#x27;ICE-free&#x27; zones following immigration raid violence","link":"https://www.latimes.com/california/story/2026-01-13/la-county-ice-free-zones-immigration-enforcement-violence","date":"Wed, 14 Jan 2026 02:45:14 GMT","desc":"The Los Angeles County Board of Supervisors voted unanimously on Tuesday to bar immigration enforcement officers from county-owned spaces.","source":"LA Times"},{"title":"Clashing with the state, L.A. City moves to adopt lenient wildfire &#x27;Zone Zero&#x27; regulations","link":"https://www.latimes.com/environment/story/2026-01-13/los-angeles-clashes-with-state-over-zone-zero-regulations","date":"Wed, 14 Jan 2026 01:43:46 GMT","desc":"The L.A. City Council moved to adopt relatively lenient \"Zone Zero\" laws for homes in fire danger zones, measures that do not align with the plans that state agencies are working to enact.","source":"LA Times"},{"title":"Kiefer Sutherland arrested after allegedly assaulting ride-hail driver in Hollywood","link":"https://www.latimes.com/california/story/2026-01-13/kiefer-sutherland-arrested-allegedly-assaulted-ride-share-driver","date":"Wed, 14 Jan 2026 00:57:28 GMT","desc":"Kiefer Sutherland arrested on suspicion of making criminal threats after altercation with ride-hail driver in Hollywood","source":"LA Times"},{"title":"Push for stricter cap on rent increases dies in the California Legislature","link":"https://www.latimes.com/california/story/2026-01-13/push-for-stricter-cap-on-rent-increases-dies-in-california-legislature","date":"Wed, 14 Jan 2026 00:20:29 GMT","desc":"A contentious housing bill that would have capped rent increases to 5% a year died in the Assembly on Tuesday, a decision greeted with boos and cries of disapproval from spectators packed inside the committee chamber.","source":"LA Times"},{"title":"A joke or an insult? Starbucks employee is fired after L.A. County deputy is handed cup with pig drawing","link":"https://www.latimes.com/california/story/2026-01-13/joke-or-insult-starbucks-employee-is-fired-after-la-county-deputy-is-handed-cup-with-pig-drawing","date":"Tue, 13 Jan 2026 22:30:18 GMT","desc":"The Los Angeles County Sheriff's Department called the pig drawing 'offensive, inappropriate and unacceptable' in a statement.","source":"LA Times"},{"title":"Protesters recount bloody attack by Homeland Security agents in Santa Ana","link":"https://www.latimes.com/california/story/2026-01-13/anti-ice-protesters-recount-dhs-agents-encounter-santa-ana","date":"Tue, 13 Jan 2026 21:13:32 GMT","desc":"A 21-year-old protester says he is now blind in his left eye after a federal agent hit him with a less-lethal round at close range on Friday in Santa Ana.","source":"LA Times"},{"title":"A U.S. Navy sailor told his friend China was asking him to spy for them. Then he did it","link":"https://www.latimes.com/california/story/2026-01-13/u-s-navy-sailor-sentenced-china-espionage","date":"Tue, 13 Jan 2026 19:45:45 GMT","desc":"A former U.S. Navy sailor convicted of espionage by a federal jury in August has been sentenced to nearly 16 months in prison, according to authorities.","source":"LA Times"},{"title":"&#x27;It&#x27;s a blanket of silence&#x27;: Fire victims&#x27; attorneys accuse city of blocking Palisades fire transparency","link":"https://www.latimes.com/california/story/2026-01-13/l-a-attorneys-delay-disclosure-firefighter-testimony-palisades-fire","date":"Tue, 13 Jan 2026 19:22:29 GMT","desc":"Dan Levin, an attorney representing the city, said the move gives the city time to review the testimony and determine which parts, if any, should stay confidential.","source":"LA Times"},{"title":"Arizona draws a line on groundwater use after letting Saudi-owned company pump freely for years","link":"https://www.latimes.com/environment/story/2026-01-13/arizona-governor-water-crackdown","date":"Tue, 13 Jan 2026 17:53:53 GMT","desc":"Arizona's governor says the state will start limiting groundwater pumping in an area where a Saudi farm grows hay and aquifer levels are dropping.","source":"LA Times"},{"title":"Sexual assault reported on UCLA&#x27;s fraternity row, university police say","link":"https://www.latimes.com/california/story/2026-01-13/sexual-assault-reported-on-ucla-frat-row-university-police-say","date":"Tue, 13 Jan 2026 17:15:27 GMT","desc":"According to a post on X, university police received a report of a sexual assault around 12 a.m. Monday.","source":"LA Times"},{"title":"Facebook commenter threatened machine gun violence at SoCal Hanukkah event; man is arrested","link":"https://www.latimes.com/california/story/2026-01-13/facebook-commenter-threats-machine-guns-hanukkah-man-arrrested","date":"Tue, 13 Jan 2026 16:01:50 GMT","desc":"An Illinois man has been charged in federal court with making threatening comments on Facebook that people would fire machine guns at a Thousand Oaks Hanukkah celebration.","source":"LA Times"},{"title":"At 89, he&#x27;s heard six decades of L.A.&#x27;s secrets and is ready to talk about what he&#x27;s learned","link":"https://www.latimes.com/science/story/2026-01-13/beverly-hills-psychiatrist-dr-arnold-gilberg-shares-secrets-in-new-book","date":"Tue, 13 Jan 2026 13:00:00 GMT","desc":"Beverly Hills psychiatrist Dr. Arnold Gilberg has treated movie stars, regular folks and everyone in between. He has some thoughts.","source":"LA Times"},{"title":"Anti-ICE protester blinded by federal agent during demonstration in Santa Ana, family says","link":"https://www.latimes.com/california/story/2026-01-13/socal-protester-permanently-blinded-by-dhs-agent-family-says","date":"Tue, 13 Jan 2026 12:00:00 GMT","desc":"A young protester narrowly avoided being killed but was left permanently blind in one eye after a Department of Homeland Security agent fired a nonlethal round at close range during a Santa Ana protest last week, according to family of the victim.","source":"LA Times"},{"title":"Before and after: Green returns to Altadena, Pacific Palisades a year after fires","link":"https://www.latimes.com/california/story/2026-01-13/before-after-photos-satellite-images-altadena-pacific-palisades-turning-green","date":"Tue, 13 Jan 2026 12:00:00 GMT","desc":"A year after the January 2025 firestorm, Pacific Palisades and Altadena landscapes have turned green, satellite photos show. Communities face a long road to recovery.","source":"LA Times"},{"title":"New LAFD chief won&#x27;t look into who watered down Palisades fire report","link":"https://www.latimes.com/california/story/2026-01-13/new-lafd-chief-wont-look-into-who-watered-down-palisades-fire-report","date":"Tue, 13 Jan 2026 11:00:00 GMT","desc":"Jaime Moore said he is taking a forward-looking approach and is not seeking to assign blame for changes to the Oct. 8 report that downplayed the city's failures in preparing for and responding to the disaster.","source":"LA Times"},{"title":"L.A. County women&#x27;s jail inmates allege sexual abuse by guards: &#x27;We&#x27;re all broken&#x27;","link":"https://www.latimes.com/california/story/2026-01-13/la-county-women-jail-inmates-sexual-abuse-allegations","date":"Tue, 13 Jan 2026 11:00:00 GMT","desc":"Two women made allegations of sexual abuse, including being forced to engage in oral sex, groping and offers of clean water and other basic supplies in exchange for sexual acts. The Sheriff's Department said it's investigating and \"maintains a zero-tolerance policy toward any form of sexual abuse.\"","source":"LA Times"},{"title":"Ex-Navy SEAL planned to fire explosives at police at San Diego &#x27;No Kings&#x27; rally","link":"https://www.latimes.com/california/story/2026-01-12/ex-navy-seal-planned-to-fire-explosives-at-police-at-no-kings-rally","date":"Tue, 13 Jan 2026 04:03:31 GMT","desc":"Former Navy SEAL Gregory Vandenberg was convicted of transporting fireworks intended to harm law enforcement at a \"No Kings\" protest in San Diego.","source":"LA Times"},{"title":"Daniel Stern caught with a prostitute, authorities say; &#x27;Home Alone&#x27; star is charged","link":"https://www.latimes.com/california/story/2026-01-12/daniel-stern-caught-with-prostitute-authorities-say-home-alone-star-is-charged","date":"Tue, 13 Jan 2026 03:00:54 GMT","desc":"'Home Alone' star, Daniel Stern, is charged with soliciting a prostitute at Camarillo hotel, according to prosecutors.","source":"LA Times"},{"title":"Democrat-turned-Republican Gloria Romero announces run for lieutenant governor","link":"https://www.latimes.com/california/story/2026-01-12/gloria-romero-announces-run-for-california-lieutenant-governor","date":"Tue, 13 Jan 2026 01:35:16 GMT","desc":"Former legislative leader Gloria Romero is running on a ticket with Republican gubernatorial candidate Steve Hilton, a former Fox News commentator.","source":"LA Times"},{"title":"Ex-CEO of Paul Newman-founded nonprofit for sick kids embezzled over $5 million, prosecutors say","link":"https://www.latimes.com/california/story/2026-01-12/ex-ceo-of-paul-newman-founded-nonprofit-for-sick-kids-embezzled-over-5-million-prosecutors-say","date":"Tue, 13 Jan 2026 01:12:02 GMT","desc":"The former chief executive of the Painted Turtle, a nonprofit that operates camps for ill children, has been accused of embezzling more than $5 million from the organization.","source":"LA Times"},{"title":"House Democrats challenge new Homeland Security order limiting lawmaker visits to immigration facilities","link":"https://www.latimes.com/politics/story/2026-01-12/house-democrats-challenge-new-homeland-security-order-limiting-lawmaker-visits-to-immigration-facilities","date":"Mon, 12 Jan 2026 23:14:22 GMT","desc":"Twelve House Democrats, including five from California, sued the Trump administration over a policy placing restrictions on visits of immigrant detention facilities by members of Congress.","source":"LA Times"},{"title":"LAPD searching for suspects in Manchester Square shooting that left 1 dead, 4 wounded","link":"https://www.latimes.com/california/story/2026-01-12/lapd-manchester-square-shooting-suspects","date":"Mon, 12 Jan 2026 23:03:25 GMT","desc":"Los Angeles police are searching for two suspects who opened fire on a line of people outside a restaurant on Sunday evening, leaving victims that ranged in age from 20 to 64.","source":"LA Times"},{"title":"FEMA to pay for lead testing at 100 homes destroyed in Eaton fire, after months of saying it was unnecessary","link":"https://www.latimes.com/environment/story/2026-01-12/fema-to-pay-for-lead-testing-at-100-homes-destroyed-in-eaton-fire","date":"Mon, 12 Jan 2026 20:37:06 GMT","desc":"For months, federal officials have said post-cleanup soil testing for fire-stricken homes in L.A. was unnecessary. Now, they plan to test 100 homes destroyed in the Eaton fire.","source":"LA Times"},{"title":"Record-high heat, gusty Santa Ana winds forecast for parts of Southern California","link":"https://www.latimes.com/california/story/2026-01-12/temps-near-record-highs-this-week-across-l-a-as-santa-anas-continue","date":"Mon, 12 Jan 2026 18:51:39 GMT","desc":"Several more days of breezy Santa Ana winds will continue to foster warm, dry weather across Los Angeles and Ventura counties. Much of the region will see highs in the 80s by midweek.","source":"LA Times"},{"title":"California woman who phoned men instead of saving her drowning 2-year-old has been found guilty of murder","link":"https://www.latimes.com/california/story/2026-01-12/california-woman-who-phoned-men-instead-of-saving-her-drowning-2-year-old-has-been-found-guilty-of-murder","date":"Mon, 12 Jan 2026 18:07:58 GMT","desc":"A Northern California woman was found guilty of murder after authorities said she didn't try to save her 2-year-old drowning daughter and instead was phoning men she met on dating apps.","source":"LA Times"},{"title":"49ers coach Kyle Shanahan shows performance-enhancing smelling salts aren&#x27;t just for players","link":"https://www.latimes.com/sports/story/2026-01-12/49ers-coach-kyle-shanahan-smelling-salts-ammonia-inhalants-george-kittle","date":"Mon, 12 Jan 2026 17:06:43 GMT","desc":"Kyle Shanahan must believe the olfactory exhilaration of smelling salts enhances his coaching ability. He's an advocate of the practice, as TV viewers discovered Sunday.","source":"LA Times"},{"title":"In pricey Santa Monica neighborhood, a battle rages over supportive housing","link":"https://www.latimes.com/california/story/2026-01-12/battle-rages-over-supportive-housing-santa-monica","date":"Mon, 12 Jan 2026 11:00:00 GMT","desc":"The controversy over a sober living center in Santa Monica is just the latest in a series of clashes between city officials and developer Leo Pustilnikov.","source":"LA Times"},{"title":"California Atty. Gen. Rob Bonta opts against running for governor. Again","link":"https://www.latimes.com/california/story/2026-01-11/california-atty-gen-rob-bonta-not-running-governor","date":"Mon, 12 Jan 2026 05:47:19 GMT","desc":"California Atty. Gen. Rob Bonta announced he will not be running for governor. Bonta last year said he decided not to run for the post, then reconsidered it after former Vice President Kamala Harris and Sen. Alex Padilla announced they were not running.","source":"LA Times"},{"title":"Thousands gather statewide in anti-ICE protests, including hundreds in Huntington Beach","link":"https://www.latimes.com/california/story/2026-01-11/statewide-anti-ice-protests-including-hundreds-in-huntington-beach","date":"Mon, 12 Jan 2026 01:10:34 GMT","desc":"Anti-ICE protests in some 60 cities of California were largely peaceful statewide, although marked by moments of tension, anger and sporadic vandalism.","source":"LA Times"},{"title":"U-Haul truck driver in custody after steering into Westwood protest against Iran government, police say","link":"https://www.latimes.com/california/story/2026-01-11/la-me-uhaul-westwood-protest","date":"Mon, 12 Jan 2026 00:36:02 GMT","desc":"Video of the incident Sunday showed protesters pulling the driver out of the vehicle. Police appeared to have taken him into custody.","source":"LA Times"}]