[{"title":"Denmark says there&apos;s a &apos;fundamental disagreement&apos; with Trump over Greenland","link":"https://www.npr.org/2026/01/14/g-s1-106011/greenland-denmark-trump","date":"Wed, 14 Jan 2026 14:57:20 -0500","desc":"The two sides agreed to create a working group to discuss ways to work through differences as President Trump continues to call for a U.S. takeover of Denmark&apos;s Arctic territory of Greenland.","source":"NPR News"},{"title":"Kitchen countertop workers are dying. Some lawmakers want to ban their lawsuits","link":"https://www.npr.org/2026/01/14/nx-s1-5674884/kitchen-countertop-workers-are-dying-some-lawmakers-want-to-ban-their-lawsuits","date":"Wed, 14 Jan 2026 14:29:34 -0500","desc":"Some safety experts want California to stop the cutting of quartz countertops saying it can&apos;t be done safely. Lawmakers, meanwhile, contemplate a ban on workers&apos; lawsuits against quartz manufacturers.","source":"NPR News"},{"title":"Candidates have legal standing to challenge election laws, the Supreme Court rules","link":"https://www.npr.org/2026/01/14/nx-s1-5677318/supreme-court-bost-decision-candidate-standing","date":"Wed, 14 Jan 2026 14:28:46 -0500","desc":"In a case related to Illinois state law about the return of mail ballots, the U.S. Supreme Court says political candidates have the legal standing to challenge election policies.","source":"NPR News"},{"title":"Scientists call another near-record hot year a &apos;warning shot&apos; from a shifting climate","link":"https://www.npr.org/2026/01/14/g-s1-105993/global-warming-speeding-up-2025-heat-record-climate-change","date":"Wed, 14 Jan 2026 13:38:36 -0500","desc":"Scientists calculate that last year was one of the three hottest on record, along with 2024 and 2023. The trend indicates that warming could be speeding up, climate monitoring teams reported.","source":"NPR News"},{"title":"MLK concert held annually at the Kennedy Center for 23 years is relocating","link":"https://www.npr.org/2026/01/14/nx-s1-5668206/mlk-celebration-kennedy-center","date":"Wed, 14 Jan 2026 13:37:35 -0500","desc":"Georgetown is moving Let Freedom Ring , its annual event celebrating the life of Martin Luther King, Jr., to the historic Howard Theatre in order to save money, the university said.","source":"NPR News"},{"title":"Democrat Elissa Slotkin says she is under investigation for video on illegal orders","link":"https://www.npr.org/2026/01/14/g-s1-105989/slotkin-investigation-illegal-orders","date":"Wed, 14 Jan 2026 13:03:10 -0500","desc":"Michigan Democratic Sen. Elissa Slotkin says she is under federal investigation for posting a video urging members of the military not to obey illegal orders.","source":"NPR News"},{"title":"How Marco Rubio shifted from Trump critic to Trump champion","link":"https://www.npr.org/2026/01/14/nx-s1-5677124/how-marco-rubio-shifted-from-trump-critic-to-trump-champion","date":"Wed, 14 Jan 2026 12:41:01 -0500","desc":"Rubio once called Trump a &quot;con artist.&quot; He&apos;s now among his most loyal defenders. New Yorker writer Dexter Filkins describes Secretary of State Rubio&apos;s character, political transformation and ambition.","source":"NPR News"},{"title":"What&apos;s behind this country&apos;s dramatic drop in the number of new orphans?","link":"https://www.npr.org/2026/01/14/g-s1-105877/orphans-hiv-aids-uganda-pepfar","date":"Wed, 14 Jan 2026 11:35:11 -0500","desc":"A new study offers good news from Uganda — although the cuts in U.S. aid cast a shadow over the reduction in deaths of parents from HIV/AIDS.","source":"NPR News"},{"title":"About Us: Global Health and Development","link":"https://www.npr.org/2026/01/14/g-s1-105973/global-health-and-developmen","date":"Wed, 14 Jan 2026 11:26:42 -0500","desc":"Here&apos;s a look at NPR&apos;s Global Health and Development coverage.","source":"NPR News"},{"title":"Trump administration sends letter wiping out addiction, mental health grants","link":"https://www.npr.org/2026/01/14/nx-s1-5677104/trump-administration-letter-terminating-addiction-mental-health-grants","date":"Wed, 14 Jan 2026 09:50:17 -0500","desc":"The Trump administration sent hundreds of letters Tuesday terminating federal grants supporting mental health and drug addiction services. The cuts could total as much as $2 billion.","source":"NPR News"}]