[{"title":"Trump claims killing of Iran protesters 'has stopped' even as Tehran signals executions ahead","link":"https://www.pbs.org/newshour/politics/trump-claims-killing-of-iran-protesters-has-stopped-even-as-tehran-signals-executions-ahead","date":"Wed, 14 Jan 2026 16:22:12 -0500","desc":"The U.S. president's claims, which were made Wednesday with few details, come as he's told protesting Iranians in recent days that \"help is on the way.\"","source":"PBS NewsHour"},{"title":"2025 home sales stuck at 30-year low","link":"https://www.pbs.org/newshour/economy/2025-home-sales-stuck-at-30-year-low","date":"Wed, 14 Jan 2026 16:07:05 -0500","desc":"The U.S. housing market slump dragged into its fourth year in 2025, as sales remained stuck at a 30-year low with rising home prices and elevated mortgage rates keeping many prospective home shoppers shut out of the market.","source":"PBS NewsHour"},{"title":"Tina Peters' lawyers try to convince Colorado court to overturn conviction for voting system breach","link":"https://www.pbs.org/newshour/politics/tina-peters-lawyers-try-to-convince-colorado-court-to-overturn-conviction-for-voting-system-breach","date":"Wed, 14 Jan 2026 15:29:59 -0500","desc":"Lawyers for former Colorado elections clerk Tina Peters will try to convince a state appeals court on Wednesday to overturn her conviction in a case revolving around the 2020 presidential election.","source":"PBS NewsHour"},{"title":"Scientists say another hot year is a 'warning shot' of a shifting, dangerous climate","link":"https://www.pbs.org/newshour/science/scientists-say-another-hot-year-is-a-warning-shot-of-a-shifting-dangerous-climate","date":"Wed, 14 Jan 2026 14:48:25 -0500","desc":"Scientists calculate that last year was one of the three hottest on record, along with 2024 and 2023.","source":"PBS NewsHour"},{"title":"Democrats see a narrow path to win the Senate, but there's no room for error","link":"https://www.pbs.org/newshour/politics/democrats-see-a-narrow-path-to-win-the-senate-but-theres-no-room-for-error","date":"Wed, 14 Jan 2026 14:31:16 -0500","desc":"Senate Democrats are expressing optimism they'll be able to flip the chamber this year after it looked all but impossible last year.","source":"PBS NewsHour"},{"title":"State Department suspending immigrant visas for 75 countries, citing public assistance concerns","link":"https://www.pbs.org/newshour/nation/state-department-suspending-immigrant-visas-for-75-countries-citing-public-assistance-concerns","date":"Wed, 14 Jan 2026 14:10:38 -0500","desc":"The State Department says it will suspend the processing of immigrant visas for citizens of 75 countries whose nationals are deemed likely to require public assistance while living in the United States.","source":"PBS NewsHour"},{"title":"New poll shows most Americans think Trump has 'gone too far' with military actions abroad","link":"https://www.pbs.org/newshour/politics/new-poll-shows-most-americans-think-trump-has-gone-too-far-with-military-actions-abroad","date":"Wed, 14 Jan 2026 13:26:43 -0500","desc":"The findings largely cut against Trump's aggressive foreign policy stance.","source":"PBS NewsHour"},{"title":"Iran signals it will hold fast trials and executions for protesters","link":"https://www.pbs.org/newshour/world/iran-signals-it-will-hold-fast-trials-and-executions-for-protesters","date":"Wed, 14 Jan 2026 13:24:33 -0500","desc":"The comments by Gholamhossein Mohseni-Ejei came as activists had warned hangings of those detained could come soon.","source":"PBS NewsHour"},{"title":"WATCH LIVE: Senate expected to hold vote on war powers resolution","link":"https://www.pbs.org/newshour/politics/watch-live-senate-expected-to-hold-vote-on-war-powers-resolution","date":"Wed, 14 Jan 2026 13:08:19 -0500","desc":"Senate Republicans are facing intense pressure from President Donald Trump to vote down a war powers resolution Wednesday that is aimed at limiting the president's ability to carry out further military action against Venezuela.","source":"PBS NewsHour"},{"title":"Supreme Court revives GOP congressman's challenge to late-arriving mail ballot law","link":"https://www.pbs.org/newshour/politics/supreme-court-revives-gop-congressmans-challenge-to-late-arriving-mail-ballot-law","date":"Wed, 14 Jan 2026 12:08:54 -0500","desc":"The high court ruled 7-2 that Rep. Mike Bost, R-Ill. has the legal right to challenge the law, even though the ballots likely had little effect on a race he won handily.","source":"PBS NewsHour"},{"title":"GOP senators break with Trump on these 2 points","link":"https://www.pbs.org/newshour/politics/gop-senators-break-with-trump-on-these-2-points","date":"Wed, 14 Jan 2026 11:30:42 -0500","desc":"There's been important pushback from some Republicans in Congress. Their numbers are not large, but the GOP lawmakers who are breaking with the president are doing so, unmistakably, in two key areas.","source":"PBS NewsHour"},{"title":"WATCH: Comer says contempt charges are coming after Clintons skipped Epstein probe depositions","link":"https://www.pbs.org/newshour/politics/watch-comer-says-contempt-charges-are-coming-after-clintons-skipped-epstein-probe-depositions","date":"Wed, 14 Jan 2026 11:24:13 -0500","desc":"Hillary Rodham Clinton defied a House subpoena for testimony about Jeffrey Epstein on Wednesday.","source":"PBS NewsHour"},{"title":"FBI searched home of Washington Post reporter, newspaper says","link":"https://www.pbs.org/newshour/politics/fbi-searched-home-of-washington-post-reporter-newspaper-says","date":"Wed, 14 Jan 2026 10:38:57 -0500","desc":"While classified documents investigations aren't unusual, the search of a reporter's home marks an escalation in the government's efforts to crack down on leaks.","source":"PBS NewsHour"},{"title":"Trump administration is investigating Sen. Slotkin for Democrats' video urging troops to resist 'illegal orders'","link":"https://www.pbs.org/newshour/politics/trump-administration-is-investigating-sen-slotkin-for-democrats-video-urging-troops-to-resist-illegal-orders","date":"Wed, 14 Jan 2026 10:27:45 -0500","desc":"Slotkin, who organized the 90-second video and first posted it on her X account in November, learned this month of the inquiry from the office of U.S. Attorney Jeanine Pirro, the Justice Department's chief prosecutor in the nation's capital.","source":"PBS NewsHour"},{"title":"Trump: Anything less than having Greenland in U.S. hands is 'unacceptable'","link":"https://www.pbs.org/newshour/world/trump-anything-less-than-having-greenland-in-u-s-hands-is-unacceptable","date":"Wed, 14 Jan 2026 09:28:29 -0500","desc":"President Donald Trump said Wednesday that NATO should help the U.S. acquire Greenland and anything less than having the island in U.S. hands is unacceptable, hours before Vice President JD Vance was to host Danish and Greenlandic officials for talks.","source":"PBS NewsHour"},{"title":"As Iran protesters face ruthless crackdown, Trump says help 'on its way'","link":"https://www.pbs.org/newshour/show/as-iran-protesters-face-ruthless-crackdown-trump-says-help-on-its-way","date":"Tue, 13 Jan 2026 18:55:22 -0500","desc":"Protests in Iran are entering their third week as tens of thousands continue to take to the streets despite a deadly crackdown. President Trump said the death toll \"appears significant,\" and Western officials say at least 2,000 have been killed. That would make these protests the deadliest since the 1979 revolution, and analysts say they could threaten the regime itself. Nick Schifrin reports.","source":"PBS NewsHour"},{"title":"News Wrap: Inflation mostly steady in December as prices rose 2.7% over previous year","link":"https://www.pbs.org/newshour/show/news-wrap-inflation-mostly-steady-in-december-as-prices-rose-2-7-over-previous-year","date":"Tue, 13 Jan 2026 18:50:21 -0500","desc":"In our news wrap Tuesday, inflation held mostly steady in December as prices rose 2.7% compared to a year before, Bill and Hillary Clinton are refusing to testify in a congressional investigation of Jeffrey Epstein and Gaza officials say at least four people are dead after strong winds knocked over walls and destroyed makeshift shelters.","source":"PBS NewsHour"},{"title":"DOJ prosecutors resign in protest over handling of ICE shooting investigation","link":"https://www.pbs.org/newshour/show/doj-prosecutors-resign-in-protest-over-handling-of-ice-shooting-investigation","date":"Tue, 13 Jan 2026 18:45:33 -0500","desc":"Across the Justice Department, there was a wave of resignations from top prosecutors. At least four senior leaders of the division that investigates police killings have resigned in protest over the handling of the fatal shooting of a woman in Minneapolis by an ICE officer. In Minnesota, six other federal prosecutors have left their posts. Amna Nawaz discussed more with Carol Leonnig.","source":"PBS NewsHour"},{"title":"A look at the legal and political fight over trans athletes as cases reach Supreme Court","link":"https://www.pbs.org/newshour/show/a-look-at-the-legal-and-political-fight-over-trans-athletes-as-cases-reach-supreme-court","date":"Tue, 13 Jan 2026 18:40:40 -0500","desc":"A hotly debated political issue made its way to the U.S. Supreme Court. At issue is whether transgender athletes should be allowed to compete in women's sports. The conservative majority seemed skeptical of striking down bans already in place in over half of all states. Liz Landers has a closer look at the legal and political fight before the nation's highest court.","source":"PBS NewsHour"},{"title":"How Denmark views Trump's threats to take over Greenland","link":"https://www.pbs.org/newshour/show/how-denmark-views-trumps-threats-to-take-over-greenland","date":"Tue, 13 Jan 2026 18:35:06 -0500","desc":"Crucial talks are due to take place in Washington between Vice President JD Vance, Secretary of State Marco Rubio and the foreign ministers of Denmark and Greenland. President Trump has coveted the Danish territory, and his repeated threats to take over the island have prompted warnings that such a move could lead to the breakup of NATO. Malcolm Brabant reports from Copenhagen.","source":"PBS NewsHour"}]