[{"title":"Iran on the Brink","link":"https://www.nytimes.com/the-daily","date":"Wed, 14 Jan 2026 10:45:33 +0000","desc":"Iran is experiencing expansive protests after economic grievances snowballed over the past two weeks into a broader challenge to the country’s authoritarian clerical rulers. In recent days, a full picture of the government’s crackdown on demonstrators has emerged, garnering global condemnation and threats of action from President Trump. Farnaz Fassihi, who has been covering the story, explains what is driving the protesters and why the regime may be facing one of its gravest challenges in decades. Guest: Farnaz Fassihi , the United Nations bureau chief for The New York Times. Background reading: Accounts of a brutal crackdown are emerging from Iran despite communications restrictions. Here’s what to know about the protests in Iran. Photo: Getty Images/Getty Images For more information on today’s episode, visit nytimes.com/thedaily . Transcripts of each episode will be made available by the next workday. Subscribe today at nytimes.com/podcasts or on Apple Podcasts and Spotify. You can also subscribe via your favorite podcast app here https://www.nytimes.com/activate-access/audio?source=podcatcher . For more podcasts and narrated articles, download The New York Times app at nytimes.com/app.","source":"The Daily "},{"title":"The United States&apos; Aspirations for Venezuela&apos;s Oil","link":"https://www.nytimes.com/the-daily","date":"Tue, 13 Jan 2026 10:50:36 +0000","desc":"In the days since deposing Nicolás Maduro, President Trump has given several justifications for his dramatic actions in Venezuela. But perhaps most central to his ambitions is opening Venezuela’s oil fields to American companies. Anatoly Kurmanaev, who covers Venezuela, explains the history behind Mr. Trump’s claims of ownership and what it would really take to get the oil back. Guest: Anatoly Kurmanaev , a reporter for The New York Times who covers Venezuela. Background reading: The United States detailed a plan for Venezuela’s oil sales after Mr. Trump claimed millions of barrels. Mr. Trump’s goals for reviving Venezuela’s oil industry will not come easily or cheaply. Photo: Adriana Loureiro Fernandez for The New York Times For more information on today’s episode, visit nytimes.com/thedaily . Transcripts of each episode will be made available by the next workday. Subscribe today at nytimes.com/podcasts or on Apple Podcasts and Spotify. You can also subscribe via your favorite podcast app here https://www.nytimes.com/activate-access/audio?source=podcatcher . For more podcasts and narrated articles, download The New York Times app at nytimes.com/app.","source":"The Daily "},{"title":"‘A Breaking Point’: The Minneapolis Police Chief on ICE","link":"https://www.nytimes.com/the-daily","date":"Mon, 12 Jan 2026 10:57:28 +0000","desc":"Warning: This episode contains strong language. Just hours before a federal immigration officer killed Renee Good in her car, Brian O’Hara, the Minneapolis police chief, warned that a tragedy involving ICE seemed inevitable. In an interview, Chief O’Hara discusses his experience with ICE in Minneapolis and why, in his mind, President Trump’s campaign of mass deportation is undermining faith in police departments. Guest: Brian O’Hara, chief of the Minneapolis Police Department Background reading: Here’s what we know about the fatal ICE shooting in Minneapolis. Local officials called for federal forces to leave Minneapolis after the shooting. Photo: Ryan Murphy for The New York Times For more information on today’s episode, visit nytimes.com/thedaily . Transcripts of each episode will be made available by the next workday. Subscribe today at nytimes.com/podcasts or on Apple Podcasts and Spotify. You can also subscribe via your favorite podcast app here https://www.nytimes.com/activate-access/audio?source=podcatcher . For more podcasts and narrated articles, download The New York Times app at nytimes.com/app.","source":"The Daily "}]