[{"title":"Wall Street Journal: &#039;Inflation isn’t rising, but it also isn’t coming down&#039;","link":"https://thehill.com/business/5689625-trump-inflation-concerns-journal/","date":"Wed, 14 Jan 2026 21:28:08 +0000","desc":"The editorial board of The Wall Street Journal said President Trump “ought to worry more about inflation” amid concerns about affordability. “The consumer-price index came in somewhat hotter than expected with an increase of 0.3% in December and 2.7% over the past 12 months. Overall inflation isn’t rising, but it also isn’t coming down,” the...","source":"The Hill - Politics"},{"title":"56 percent say Trump has &#039;gone too far&#039; with military intervention abroad: Poll","link":"https://thehill.com/homenews/administration/5689495-trump-military-intervention-foreign-policy-poll/","date":"Wed, 14 Jan 2026 21:18:36 +0000","desc":"More than half of U.S. adults say President Trump has “gone too far” with military intervention abroad, according to a new poll. A survey from the Associated Press-NORC Center for Public Affairs found that 56 percent of people say the president has “gone too far” with military operations abroad. Thirty-five percent say his intervention has...","source":"The Hill - Politics"},{"title":"Trump told that executions in Iran will stop; does not rule out US military action","link":"https://thehill.com/homenews/administration/5689476-trump-says-iran-executions-halted/","date":"Wed, 14 Jan 2026 21:15:54 +0000","desc":"President Trump on Wednesday said he was told by \"sources on the other side\" that executions in Iran will stop amid the ongoing nationwide protests. \"We've been told that the killing in Iran is stopping,\" Trump told reporters in the Oval Office ahead of a bill signing. \"And that there's no plan for executions. I've...","source":"The Hill - Politics"},{"title":"Judges reject GOP bid to block California&#039;s Democratic-favored congressional map","link":"https://thehill.com/regulation/court-battles/5689541-california-redistricting-lawsuit-decision/","date":"Wed, 14 Jan 2026 21:07:41 +0000","desc":"A federal court on Wednesday refused a GOP effort to invalidate California’s new congressional map that adds up to five Democratic-leaning seats as a part of a mid-decade redistricting war. In a 2-1 vote, the three-judge panel rejected arguments that California Democrats unconstitutionally racially gerrymandered the map by boosting Hispanic voting power. It marks a major defeat for the Trump administration and the California Republican Party, which both sued...","source":"The Hill - Politics"},{"title":"Musk&#039;s Starlink offering free satellite internet service in Iran, activists say","link":"https://thehill.com/policy/technology/5689527-spacex-starlink-free-iran/","date":"Wed, 14 Jan 2026 21:05:30 +0000","desc":"SpaceX has made its Starlink technology free for users in Iran after the government implemented an internet blackout last week to stifle information about ongoing deadly protests, according to activists inside the country. The company, owned by billionaire Elon Musk, waived fees for its service, meaning Iranians with Starlink devices can now access satellite internet...","source":"The Hill - Politics"},{"title":"Live updates: Senate eyes Venezuela war powers vote; Trump says Iran has stopped protester killings","link":"https://thehill.com/homenews/administration/5686979-live-updates-trump-greenland-iran/","date":"Wed, 14 Jan 2026 20:56:20 +0000","desc":"The Senate is expected to vote on a war powers resolution that would prevent President Trump from taking any further military action in Venezuela on Wednesday. Last week, five Senate Republicans voted to advance the measure — a sharp rebuke of the president. Sen. Josh Hawley (R-Mo.), who supported the resolution at the time, said...","source":"The Hill - Politics"},{"title":"Trump officials rebuff Greenland, Denmark calls to drop talk of taking territory","link":"https://thehill.com/policy/international/5689458-denmark-greenland-white-house-meeting/","date":"Wed, 14 Jan 2026 20:33:43 +0000","desc":"President Trump is not giving up in his pursuit of the U.S. owning Greenland, despite the complete rejection of such a move by officials from Copenhagen and Nuuk. There remains a “fundamental disagreement\" between the positions of Denmark, Greenland and the U.S., Denmark’s Foreign Minister Lars Løkke Rasmussen told reporters following a meeting with Vice...","source":"The Hill - Politics"},{"title":"DOJ sues Minnesota over affirmative action","link":"https://thehill.com/homenews/state-watch/5689330-dojsues-minnesota-affirmative-action/","date":"Wed, 14 Jan 2026 20:29:05 +0000","desc":"The Department of Justice sued Minnesota on Wednesday for having an affirmative action \"regime,\" alleging the state is violating the Trump administration's policies against diversity, equity and inclusion (DEI). \"From suing over sanctuary city policies to a wide-ranging fraud investigation, today's lawsuit is the Department of Justice's latest effort to bring Minnesota into compliance with...","source":"The Hill - Politics"},{"title":"Minnesota Democrat likens ICE operations to &#039;1930s in Germany&#039;","link":"https://thehill.com/homenews/house/5689416-angie-craig-ice-operations-1930s-germany/","date":"Wed, 14 Jan 2026 20:19:25 +0000","desc":"Rep. Angie Craig (D-Minn.) likened Immigration and Customs Enforcement (ICE) operations to the “1930s in Germany” a week after a woman was fatally shot by a federal officer in Minneapolis. “Do you think Congress should shut down the government over ICE and [Department of Homeland Security (DHS)] funding to make a statement?” MS NOW’s Ana...","source":"The Hill - Politics"},{"title":"US makes initial $500M Venezuelan oil deal; some proceeds headed to Qatari bank","link":"https://thehill.com/homenews/administration/5689426-venezuela-oil-sale-trump/","date":"Wed, 14 Jan 2026 20:13:41 +0000","desc":"The Trump administration has completed its first Venezuelan oil sale, valued at $500 million, an administration official confirmed to The Hill on Wednesday. The official also said additional sales are expected in the coming days and weeks. Semafor first reported the deal, including that revenue from it is being held in bank accounts, including one...","source":"The Hill - Politics"},{"title":"Minneapolis officials slam continued ICE &#039;occupation&#039; in city: &#039;Get out&#039;","link":"https://thehill.com/homenews/state-watch/5689194-minneapolis-officials-slam-ice/","date":"Wed, 14 Jan 2026 20:12:32 +0000","desc":"A contingent of Minneapolis officials slammed the continued presence of federal immigration enforcement in the city Wednesday, a week after an Immigration and Customs Enforcement (ICE) officer fatally shot Renee Good. During a press conference at the Minneapolis City Hall rotunda, multiple officials referred to ICE officers remaining in the city as an “occupation,” with...","source":"The Hill - Politics"},{"title":"House Homeland Democrats launch investigation into Noem with eyes on impeachment","link":"https://thehill.com/homenews/house/5689359-house-homeland-democrats-kristi-noem-impeachment/","date":"Wed, 14 Jan 2026 19:57:45 +0000","desc":"Democrats on the House Homeland Security Committee said they will begin their own investigation into Homeland Security Secretary Kristi Noem, a process they say could well lead to her impeachment. Gathered next to a photo of Renee Good, the Democrats said her death at the hands of an immigration officer highlights the need for accountability...","source":"The Hill - Politics"},{"title":"McConnell: Trump&#039;s seizure of Greenland would ‘incinerate’ NATO alliances","link":"https://thehill.com/homenews/senate/5689375-mitch-mcconnell-trump-greenland-threat/","date":"Wed, 14 Jan 2026 19:55:03 +0000","desc":"Former Senate Republican Leader Mitch McConnell (Ky.) warned in a speech on the Senate floor Wednesday that President Trump’s talk of seizing Greenland by force threatens to “incinerate” the nation’s long-standing ties with NATO allies. McConnell declared that burning the treaty organization that formed after World War II to contain Soviet aggression would be an...","source":"The Hill - Politics"},{"title":"Tesla&#039;s self-driving feature switching to subscription only","link":"https://thehill.com/policy/technology/5688957-teslas-self-driving-feature-subscription-only/","date":"Wed, 14 Jan 2026 19:22:03 +0000","desc":"For Musk to earn additional shares under his pay package, the company needs a certain number of subscriptions.","source":"The Hill - Politics"},{"title":"7 in 10 say US should not take military action over deadly Iran protest crackdown: Survey","link":"https://thehill.com/policy/international/5689007-american-opposition-iran-military/","date":"Wed, 14 Jan 2026 19:11:58 +0000","desc":"An overwhelming majority of Americans say they do not back U.S. military intervention in Iran amid its crackdown on antigovernment protesters, according to new polling from Quinnipiac University released Wednesday. The poll found that 7 in 10 respondents believe the U.S. should not become involved in Iran, while 18 percent said they favor intervention. Twelve...","source":"The Hill - Politics"}]