[{"title":"Trump administration ends temporary protected status for Somalis in US","link":"https://www.theguardian.com/us-news/2026/jan/13/trump-administration-ends-tps-somalia","date":"Tue, 13 Jan 2026 22:59:07 GMT","desc":"Critics condemn ‘bigoted attack’ as Trump bids to revoke citizenship of naturalized immigrants convicted of fraud The Trump administration is terminating temporary protected status (TPS) for Somalis living in the United States, giving hundreds of people two months to leave the country or face deportation. The homeland security secretary, Kristi Noem , said in a statement that conditions in the east African country had improved sufficiently and that Somalis no longer qualified for the designation under federal law. Continue reading...","source":"The Guardian"},{"title":"Quarter of developing countries poorer than in 2019, World Bank finds","link":"https://www.theguardian.com/business/2026/jan/13/developing-countries-poorer-world-bank-report","date":"Tue, 13 Jan 2026 14:30:04 GMT","desc":"Global growth ‘downshifted’ since Covid pandemic and sub-Saharan Africa particularly affected, report says Business live – latest updates A quarter of countries in the developing world are poorer than they were in 2019 before the Covid pandemic, the World Bank has found. The Washington-based organisation said a large group of low-income countries, many in sub-Saharan Africa, had suffered a negative shock in the six years to the end of last year. Continue reading...","source":"The Guardian"},{"title":"Author Chimamanda Ngozi Adichie accuses Lagos hospital of negligence after son’s death","link":"https://www.theguardian.com/books/2026/jan/12/chimamanda-ngozi-adichie-accuses-lagos-hospital-negligence-son-death","date":"Mon, 12 Jan 2026 14:26:57 GMT","desc":"Lawyers for Adichie and her husband serve Euracare hospital with legal notice after death of 21-month-old The Nigerian author Chimamanda Ngozi Adichie has accused a Lagos hospital of negligence after the death of one of her 21-month-old twin boys. Nkanu Nnamdi died on 6 January after a brief illness. He was one of twin boys born to Adichie and Ivara Esege, a doctor, in 2024 by surrogacy, eight years after the birth of their first child, a girl. Continue reading...","source":"The Guardian"},{"title":"Venezuela regime claims release of political prisoners is sign of new era","link":"https://www.theguardian.com/world/2026/jan/14/venezuelan-political-prisoners-released","date":"Wed, 14 Jan 2026 19:25:00 GMT","desc":"NGOs estimate that there are still close to 1,000 political prisoners in Venezuela despite claims by new leaders Venezuela’s acting president has claimed that the regime’s release of political prisoners sent a “very clear message” that the country was “opening up to a new political moment”, days after the seizure and rendition of the dictator Nicolás Maduro. Delcy Rodríguez also vowed to continue the releases and accused NGOs that have described the process as slow and opaque of “lying to the world and trying to sell falsehoods about Venezuela”. Continue reading...","source":"The Guardian"},{"title":"Quebec premier François Legault resigns from post in surprise move","link":"https://www.theguardian.com/world/2026/jan/14/quebec-premier-francois-legault-resigns","date":"Wed, 14 Jan 2026 17:22:13 GMT","desc":"Legault’s abrupt resignation follows months of chaos that has rocked the governing Coalition Avenir Québec party Quebec ’s premier, François Legault, has announced his resignation as leader of the province, in an abrupt departure for the polarizing figure whose embattled government faces the prospects of an electoral wipeout in the coming months. Speaking at a hastily arranged press conference in Quebec City on Wednesday, Legault said he was proud to have founded the Coalition Avenir Québec (CAQ) party and won consecutive majority governments beginning in 2018 . Continue reading...","source":"The Guardian"},{"title":"US plan to exploit Venezuela’s oil could eat up 13% of carbon budget to keep 1.5C limit","link":"https://www.theguardian.com/environment/2026/jan/12/us-plan-to-exploit-venezuelas-oil-could-eat-up-13-of-carbon-budget-to-keep-15c-limit","date":"Mon, 12 Jan 2026 17:38:19 GMT","desc":"Exclusive: ClimatePartner analysis shows how move would risk plunging Earth further into climate catastrophe US plans to exploit Venezuela’s oil reserves could by 2050 consume more than a tenth of the world’s remaining carbon budget to limit global heating to 1.5C, according to an exclusive analysis. The calculation highlights how any moves to further exploit the South American nation’s oil reserves – the largest in the world, at least on paper – would put increasing pressure on climate goals, and risk plunging the Earth further into climate catastrophe. Continue reading...","source":"The Guardian"},{"title":"Trump’s other Latin American feud: why Colombia’s Petro is not Maduro","link":"https://www.theguardian.com/world/2026/jan/12/trump-latin-america-feud-colombia-gustavo-petro","date":"Mon, 12 Jan 2026 12:07:03 GMT","desc":"Leftwing leader rallies his supporters as US president accuses him of drug trafficking and threatens military action A leftwing South American firebrand calls for his followers to rally in public squares nationwide to defend his country’s sovereignty and decry verbal attacks from Donald Trump. The US president accuses the leader of personally flooding American streets with illegal drugs and imposes sanctions against him and his wife. Threats of military action are followed by a phone conversation between the two leaders. One might imagine that this is a description of the buildup of tensions that led to the 3 January special forces raid on Caracas to capture the Venezuelan leader, Nicolás Maduro, and his wife, Cilia Flores, to face several criminal charges in New York. Continue reading...","source":"The Guardian"},{"title":"US frackers were already facing a global oil supply glut. Trump’s Venezuelan dream could make it worse","link":"https://www.theguardian.com/us-news/2026/jan/12/us-oil-producers-global-supply-glut-venezuela","date":"Mon, 12 Jan 2026 11:00:03 GMT","desc":"Picture is as murky as a barrel of oil, with US companies in 2026 expecting their first production drop in four years US shale-oil producers were already contending with oil prices at four-year lows. News that they may soon face a significant competitor in their back yard probably wasn’t how frackers wanted to greet 2026. The US capture of Venezuela’s President Nicolás Maduro and his wife, Cilia Flores, hit the share prices of independent shale-oil producers, such as Diamondback Energy and Devon Energy, last week. Continue reading...","source":"The Guardian"},{"title":"At least 28 killed as crane collapses on train in Thailand","link":"https://www.theguardian.com/world/2026/jan/14/thailand-train-crane-accident-deaths","date":"Wed, 14 Jan 2026 15:44:56 GMT","desc":"Crane in use on high-speed rail project hits passing train, causing it to derail At least 28 people in Thailand have been killed and scores injured after a crane collapsed on to a passenger train and derailed it, officials said. Footage from the scene verified by Agence France-Presse showed the crane’s broken structure resting on giant concrete pillars and smoke rising from the wreckage of the train below. Continue reading...","source":"The Guardian"},{"title":"China reports record trillion-dollar trade surplus despite Trump tariffs","link":"https://www.theguardian.com/world/2026/jan/14/china-reports-record-trillion-dollar-trade-surplus-despite-trump-tariffs","date":"Wed, 14 Jan 2026 04:50:56 GMT","desc":"Results for 2025 risk further unsettling economies about China’s trade practices and overcapacity, and their own over-reliance on Chinese products China has reported a strong export run in 2025 with a record trillion-dollar surplus, as its producers brace for three more years of a Trump administration set on slowing the manufacturing powerhouse by shifting US orders to other markets. Beijing’s resilience to renewed tariff tensions since Donald Trump returned to the US presidency last January has emboldened Chinese firms to shift their focus to south-east Asia, Africa and Latin America to offset US duties. Continue reading...","source":"The Guardian"},{"title":"South Korean prosecutors demand death penalty for former president Yoon Suk Yeol","link":"https://www.theguardian.com/world/2026/jan/13/south-korean-prosecutors-demand-death-penalty-for-former-president-yoon-suk-yeol","date":"Wed, 14 Jan 2026 00:43:58 GMT","desc":"Yoon is on trial for insurrection charges, after trying to declare martial law in late 2024 South Korean prosecutors have demanded the death penalty for former president Yoon Suk Yeol over his failed martial law declaration in December 2024, in the first insurrection trial of a Korean head of state in three decades. Prosecutors characterised the case as the “serious destruction of constitutional order by anti-state forces”, telling Seoul central district court that Yoon had “directly and fundamentally infringed upon the safety of the state and the survival and freedom of the people”. Continue reading...","source":"The Guardian"},{"title":"BTS announces return with new world tour in 2026 and 2027","link":"https://www.theguardian.com/music/2026/jan/14/bts-announces-return-with-new-world-tourm-includin-in-2026-and-2027","date":"Wed, 14 Jan 2026 00:40:16 GMT","desc":"K-pop band to start tour in April after nearly four-year hiatus due to all seven members needing to complete South Korea’s mandatory military service The BTS comeback is upon us: the K-pop septet has announced a 2026-2027 world tour, kicking off in South Korea in April and running through to March 2027 with more than 70 dates across Asia, North America, South America, Australia and Europe. The tour marks the group’s first headline performances since their 2021–22 Permission to Dance on Stage tour. 9 April and 11-12 April – Goyang, South Korea 17-18 April – Tokyo 25-26 April – Tampa, Florida 2-3 May – El Paso, Texas 7 May and 9-10 May – Mexico City 16-17 May – Stanford, California 23-24 and 27 May – Las Vegas 12-13 June – Busan, South Korea 26-27 June – Madrid 1-2 July – Brussels 6-7 July – London 11-12 July – Munich 17-18 July – Paris 1-2 Aug – East Rutherford, New Jersey 5-6 Aug – Foxborough, Massachusetts 10-11 Aug – Baltimore 15-16 Aug – Arlington, Texas 22-23 Aug – Toronto 27-28 Aug – Chicago 1-2 Sept and 5-6 Sept – Los Angeles 2-3 Oct – Bogotá, Colombia 9-10 Oct – Lima, Peru 16-17 Oct – Santiago, Chile 23-24 Oct – Buenos Aires, Argentina 28 Oct and 30-31 Oct – São Paulo 19 Nov and 21-22 Nov – Kaohsiung, Taiwan 3 Dec and 5-6 Dec – Bangkok 12-13 Dec – Kuala Lumpur, Malaysia 17 Dec, 19-20 Dec and 22 Dec – Singapore 26-27 Dec – Jakarta 12-13 Feb – Melbourne, Australia 20-21 Feb – Sydney 4 March and 6-7 March – Hong Kong 13-14 March – Manila, Philippines Continue reading...","source":"The Guardian"},{"title":"Workers at Chinese factory that produces Labubu toys are being exploited, says NGO","link":"https://www.theguardian.com/world/2026/jan/13/workers-at-chinese-factory-that-produces-labubu-toys-are-being-exploited-says-ngo","date":"Tue, 13 Jan 2026 09:55:04 GMT","desc":"Exclusive: China Labor Watch says people aged 16-18 employed without required special protections A labour rights NGO says it has found evidence of worker exploitation in the supply chain of Labubus, the furry toys that took the world by storm last year and which are expected to continue to grow in popularity in 2026. Labubus, toothy gremlins made by the Chinese toy company Pop Mart, have become one of China’s hottest cultural exports. In the first half of 2025 alone, “the Monsters” line of toys, which includes Labubus, generated 4.8bn yuan (£511m) in sales for the Hong Kong-listed company. In August, Pop Mart’s chief executive, Wang Ning, said the company was on track to reach 20bn yuan in revenues in 2025. Continue reading...","source":"The Guardian"},{"title":"Australia news live: ‘ridiculous’ for Coalition to oppose hate speech laws, Burke says; Joyce compares inherited guns to a ‘lounge suite’","link":"https://www.theguardian.com/australia-news/live/2026/jan/15/victoria-bushfires-school-data-hack-adelaide-writers-week-peter-malinauskas-labor-hate-speech-laws-political-reaction-anthony-albanese-sussan-ley-coalition-ntwnfb","date":"Wed, 14 Jan 2026 21:02:22 GMT","desc":"Shadow minister says Coalition has not yet decided on approach to new laws but says they are ‘rushed’. Follow updates live Get our breaking news email , free app or daily news podcast Barnaby Joyce says One Nation won’t support gun reforms, calling proposals ‘obnoxious’ One Nation MP Barnaby Joyce is speaking on RN now, saying the party will not support legislation before parliament next week. He said the gun reform legislation would punish “recreational pig shooters in country areas” that had nothing to do with the Bondi attack. This is not so much an omnibus but a bus crash. It is a combination and permutation of a whole range of issues … I think that there is something quite obnoxious with dragging them into it when they have done nothing but obeyed the law. And that is how we see it out here. Absolutely we’ve called for legislation to be brought forward. We’ve called for the parliament to be reformed because it is absolutely critical that we eradicate antisemitism in this country and that we remove radical Islam. That should be our laser-like focus. This legislation does neither of those things, and recalling parliament is not a free pass to passing bad legislation. These laws are nationally significant. They will impact every Australian. So we think that it’s reasonable that more time be taken to make sure that they are fit for purpose and that there are no unintended consequences. Continue reading...","source":"The Guardian"},{"title":"Former NSW Labor minister condemns Forestry Corporation after greater glider ‘den trees’ found at planned logging site","link":"https://www.theguardian.com/australia-news/2026/jan/15/nsw-logging-halted-greater-glider-den-trees-found","date":"Wed, 14 Jan 2026 14:00:39 GMT","desc":"Bob Debus says operations at Glenbog state forest on south coast show native forest logging is untenable Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast A former New South Wales Labor environment minister has called on the government to halt imminent logging in a forest on the state’s south coast, after citizen scientists recorded 102 trees that they say are home to endangered greater gliders. Bob Debus, who served as environment minister in the Carr and Iemma governments, also accused the NSW Forestry Corporation (NSWFC) of being found in breach of its own regulations so frequently that the “practice is essentially part of its business model”. Continue reading...","source":"The Guardian"},{"title":"Australian chapter of Islamist group Hizb ut-Tahrir has no plans to disband before Labor’s hate speech laws","link":"https://www.theguardian.com/australia-news/2026/jan/15/australian-chapter-of-islamist-group-hizb-ut-tahrir-has-no-plans-to-disband-before-labors-hate-speech-laws","date":"Wed, 14 Jan 2026 14:00:35 GMT","desc":"Organisation singled out by home affairs minister as one that could be targeted by new laws targeting ‘hate groups’ Get our breaking news email , free app or daily news podcast The Australian chapter of the Islamist group Hizb ut-Tahrir has said it has no plan to disband before Labor’s hate speech legislation is brought to parliament, a day after the National Socialist Network (NSN) claimed it would do so . Hizb ut-Tahrir Australia and the neo-Nazi NSN, which are not associated with each other, were named by the home affairs minister, Tony Burke, on Saturday as organisations that could be targeted by proposed legislation to ban alleged “hate groups” after the Asio general director, Mike Burgess, raised concerns about both. Continue reading...","source":"The Guardian"},{"title":"Randa Abdel-Fattah threatens defamation action against South Australian premier Peter Malinauskas","link":"https://www.theguardian.com/australia-news/2026/jan/14/randa-abdel-fattah-defamation-concerns-notice-peter-malinauskas-sa-premier","date":"Wed, 14 Jan 2026 10:31:57 GMT","desc":"Prominent Palestinian author’s removal from Adelaide writers’ week lineup led to unprecedented turmoil culminating in cancellation of festival Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The South Australian premier, Peter Malinauskas, has received a legal notice from the Palestinian writer and academic at the centre of the Adelaide writers’ week maelstrom . On Wednesday, lawyers acting for Randa Abdel-Fattah served a formal concerns notice for defamation to the premier, suggesting the fallout from her cancellation from the 2026 writers’ week – which is itself is now cancelled – is far from over. Continue reading...","source":"The Guardian"},{"title":"Coalition set to vote against Labor’s hate speech and gun laws in wake of Bondi terror attack","link":"https://www.theguardian.com/australia-news/2026/jan/14/senior-liberals-urge-colleagues-to-vote-against-labors-hate-speech-and-gun-laws-in-wake-of-bondi-terror-attack-ntwnfb","date":"Wed, 14 Jan 2026 09:15:44 GMT","desc":"It comes after opposition leader Sussan Ley has spent weeks calling for better legislative protections to tackle antisemitism Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The Coalition is set to vote against Labor’s fast-tracked legislation introduced in the wake of the Bondi terror attack, despite the opposition leader, Sussan Ley, calling for urgent legislative action for weeks. Labor would be forced to rely on support from the Greens if the opposition does not support the bill next Tuesday , as Ley flagged reservations about the bill’s drafting and the inability of public servants to explain key provisions on hate speech and religious protection. Continue reading...","source":"The Guardian"},{"title":"US acquisition of Greenland ‘absolutely not necessary,’ Danish foreign minister says after ‘frank’ talks with JD Vance – as it happened","link":"https://www.theguardian.com/world/live/2026/jan/14/denmark-greenland-us-latest-news-updates-europe-live-trump","date":"Wed, 14 Jan 2026 20:34:30 GMT","desc":"Lars Løkke Rasmussen acknowledges ‘new security situation’ in the Arctic but says US control is not the answer after brief meeting in Washington This liveblog is now closed Full report: Trump intent on conquering Greenland, Danish minister says as talks with US end People in Greenland: share your views on Trump’s recent comments US president Donald Trump has doubled down on his rhetoric on getting control of Greenland, insisting that the US “needs Greenland for the purpose of national security.” In a social media post, Trump claimed that “Nato should be leading the way for us to get it,” and “if we don’t, Russia or China will, and that is not going to happen!” “Militarily, without the vast power of the United States, much of which I built during my first term, and am now bringing to a new and even higher level, Nato would not be an effective force or deterrent - not even close! They know that, and so do I.” Continue reading...","source":"The Guardian"},{"title":"Trump intent on conquering Greenland, Danish minister says as talks with US end","link":"https://www.theguardian.com/world/2026/jan/14/greenland-us-trump-talks-denmark","date":"Wed, 14 Jan 2026 20:11:18 GMT","desc":"Crucial talks with US officials fail to solve ‘fundamental disagreement’ over Arctic island controlled by Copenhagen Donald Trump remains intent on “conquering” Greenland, the Danish foreign minster has said, as crucial talks with US officials failed to solve a “fundamental disagreement” that has led to unprecedented tensions between Washington and a Nato ally. It is “absolutely not necessary” for the US to seize Greenland, a largely self-governing part of the Danish kingdom, the Danish foreign minster, Lars Løkke Rasmussen, said late on Wednesday. Continue reading...","source":"The Guardian"},{"title":"California attorney general investigates Musk’s Grok AI over lewd fake images","link":"https://www.theguardian.com/technology/2026/jan/14/california-attorney-general-investigates-grok-ai-elon-musk","date":"Wed, 14 Jan 2026 20:09:38 GMT","desc":"AI tool made by Elon Musk’s xAI makes it easy to harass women with deepfake images, says state’s top attorney California authorities have announced an investigation into the output of Elon Musk ’s Grok. The state’s top attorney said Grok , an AI tool and image generator made by Musk’s company xAI, appears to be making it easy to harass women and girls with deepfake images on X and elsewhere online. Continue reading...","source":"The Guardian"},{"title":"France announces ban on 10 British anti-migrant activists","link":"https://www.theguardian.com/uk-news/2026/jan/14/france-announces-ban-on-10-british-anti-migrant-activists-raise-the-colours","date":"Wed, 14 Jan 2026 15:21:28 GMT","desc":"French interior ministry issues ‘territorial bans’ after reports of anti-migrant activities by members of Raise the Colours movement France’s interior ministry has announced a ban on 10 British anti-migrant activists who travelled to the country. Officials said they took action after reports that members of the Raise the Colours movement had conducted anti-migrant activities in France. Continue reading...","source":"The Guardian"},{"title":"Cyprus investigates ‘sinister’ death of Russian diplomat said to have been GRU spy","link":"https://www.theguardian.com/world/2026/jan/14/cyprus-investigates-death-russian-diplomat-alexei-panov-alleged-gru-spy","date":"Wed, 14 Jan 2026 15:11:36 GMT","desc":"Apparent suicide of Alexei Panov comes after disappearance of oligarch Vladislav Baumgertner and amid corruption scandal Authorities in Cyprus are investigating the “unnatural death” of a diplomat at the Russian embassy. “The incident at the embassy is being treated as an unnatural death because it seems, based on the autopsy, it was a suicide,” said Cyprus’s police spokesperson, Vyron Vyronos. Continue reading...","source":"The Guardian"},{"title":"Donald Trump says he has been told the ‘killing in Iran is stopping’ – live","link":"https://www.theguardian.com/world/live/2026/jan/14/iran-protests-live-updates-trump-us-action-death-toll-protester-executions-erfan-soltani","date":"Wed, 14 Jan 2026 21:13:11 GMT","desc":"US president says it has ‘just gotten to me’ that ‘they’re not going to have an execution’ as he addresses reporters over the death sentence of protester Erfan Soltani Massacres and executions: what are we hearing from inside Iran? – In Focus For the first time in days, Iranians were able to make calls abroad from their mobiles on Tuesday, according to reporting by Associated Press. Texting services have not been restored, however, and nor has the internet. Although Iranians were able to call abroad, they could not receive calls from outside the country, several people in the capital told Associated Press. The internet remained blocked, they said, though it is possible to access some government-approved websites. Cloudfare - an internet infrastructure provider, and one of several companies and monitors tracking the status of internet traffic in Iran – said traffic volumes have remained “at a fraction of a percent of previous levels”. Its latest update as of 01:00 UTC (which is about three hours and 30 minutes ago), shows a continued widespread blackout. Iran has been under an internet shutdown since Thursday night. Brief windows of connectivity were observed on Friday, but these did not last, according to Cloudfare. Netblocks , an independent global internet monitor, also notes that while some phone calls from Iran are connecting, there is “no secure way to communicate” and the general public remain cut off from the outside world. Continue reading...","source":"The Guardian"},{"title":"US announces start of second phase of Gaza ceasefire","link":"https://www.theguardian.com/world/2026/jan/14/us-witkoff-announces-start-of-gaza-ceasefire-second-phase","date":"Wed, 14 Jan 2026 19:28:40 GMT","desc":"No details given of committee members who will run territory but they are expected be technocrats, not politicians The US has announced the start of the second phase of the Gaza ceasefire, including the creation of a committee of Palestinian technocrats who are supposed to take over the day-to-day running of the territory for a transition period. The announcement was made on social media by Donald Trump’s special envoy, Steve Witkoff, but it lacked any detail or names of potential members of the proposed “national committee for the administration of Gaza”. The committee is not expected to begin work until mandated by a “peace board” chaired by Trump, which has yet to be created. Continue reading...","source":"The Guardian"},{"title":"No word on fate of Iran protester due to be put to death, says relative","link":"https://www.theguardian.com/world/2026/jan/14/iran-protester-erfan-soltani-death-sentence-relative","date":"Wed, 14 Jan 2026 18:56:39 GMT","desc":"Family stayed up until dawn waiting for news of Erfan Soltani who was due to be executed on Wednesday Iran latest – live updates A family member of Erfan Soltani, the first Iranian protester sentenced to death, has said they have no idea if he’s still alive after the deadline for his execution passed with no word from the authorities. Soltani, a 26-year-old clothing shop employee, was arrested in Karaj, a city north-west of Tehran, last Thursday after participating in protests and was due to be executed on Wednesday, according to rights groups. Continue reading...","source":"The Guardian"},{"title":"US and UK military to withdraw some personnel from Middle East amid Iranian threats","link":"https://www.theguardian.com/world/2026/jan/14/iran-protests-erfan-soltani-donald-trump-warning-executions-hangings","date":"Wed, 14 Jan 2026 18:47:57 GMT","desc":"Tehran threatens to strike US bases in Middle East if Washington carries out pledge to intervene in Iran Iran protests: live updates Hundreds of gunshot eye injuries found in one Iranian hospital Iran protests: what we know so far about the anti-government demonstrations The US and UK have evacuated some personnel from a military base in Qatar amid concerns Washington might soon launch military action against Iran , which Tehran has warned would trigger retaliatory strikes. A US official told Reuters and the Associated Press on Wednesday that the withdrawal was a precaution, while diplomats said that some forces had been advised to leave al-Udeid base in Qatar. Continue reading...","source":"The Guardian"},{"title":"Why western diplomats are wary of predicting end days for Iran’s regime","link":"https://www.theguardian.com/world/2026/jan/14/western-diplomats-wary-of-predicting-end-days-for-irans-regime","date":"Wed, 14 Jan 2026 18:33:58 GMT","desc":"Failure to foresee shah’s fall in 1979 was diplomatic disaster, but experts see little indication of mass defections now When asked to predict whether fissures are appearing at the top of the Iranian state that may imply Ayatollah Ali Khamenei’s days as supreme leader are numbered, western diplomats adopt a haunted demeanour, perhaps recalling one of western diplomacy’s greatest collective disasters. Before the fall of the Shah of Iran in January 1979 , insouciant diplomats based in Tehran were sending cables to their capitals offering total reassurance that Mohammad Reza Pahlavi’s hold on power was utterly secure. In September 1978, the US Defence Intelligence Agency, for instance, reported that “the shah is expected to remain actively in power over the next 10 years”. A state department report suggested “the shah would not have to stand down until 1985 at the earliest”. Continue reading...","source":"The Guardian"},{"title":"Search for single-tusked elephant after 22 killed in India rampage","link":"https://www.theguardian.com/world/2026/jan/13/search-elephant-people-killed-india-jharkand","date":"Tue, 13 Jan 2026 07:07:05 GMT","desc":"Eastern region on high alert as authorities try to track animal tearing through villages in Jharkhand after apparently becoming separated from herd Forest officials in India are on the hunt for an elephant that has killed more than 20 people in a days-long rampage through the eastern state of Jharkhand. Since the beginning of January, 22 people have been killed by a single-tusked elephant that has been tearing through forests and villages in West Singhbhum district of Jharkhand. Continue reading...","source":"The Guardian"},{"title":"Russia working to circumvent sanctions to ensure India oil imports continue","link":"https://www.theguardian.com/world/2026/jan/13/russia-working-to-circumvent-sanctions-to-ensure-india-oil-imports-continue","date":"Tue, 13 Jan 2026 05:00:25 GMT","desc":"Delhi is world’s second largest purchaser of Russian crude, which is now cheaper than oil from Middle East Russia is already working to circumvent the latest US sanctions to ensure India can continue to import high levels of cheap Russian crude oil, according to industry analysts. Since the outbreak of the Ukraine war, India has become the world’s second largest purchaser of Russian crude oil , which has been heavily discounted due to the impact of western sanctions. Continue reading...","source":"The Guardian"},{"title":"Sikh activist in UK told to increase security over Hindu nationalist threats","link":"https://www.theguardian.com/uk-news/2026/jan/12/sikh-activist-uk-increase-security-hindu-nationalist-threats","date":"Mon, 12 Jan 2026 10:04:14 GMT","desc":"Police ask Paramjeet Singh Pamma to install security cameras and reinforce door locks at his home Police have advised a high-profile Sikh activist in the UK to install security cameras at his home and reinforce door locks because of threats from Hindu nationalist elements. Paramjeet Singh Pamma, 52, said he had been visited by police and received verbal advice to increase his security due to intelligence suggesting threats to his safety. Continue reading...","source":"The Guardian"},{"title":"Three Palestine Action protesters end their hunger strike","link":"https://www.theguardian.com/uk-news/2026/jan/14/three-palestine-action-protesters-end-their-hunger-strike","date":"Wed, 14 Jan 2026 21:04:34 GMT","desc":"Four more who had paused their strikes choose not to continue after government opts against giving contract to Elbit Systems UK Seven Palestine Action-affiliated prisoners have announced the end of their hunger strike after the government decided not to award a £2bn contract to the Israeli arms company subsidiary Elbit Systems UK. Fears had been growing for the welfare of those taking part in the protest. On Wednesday, Heba Muraisi, 31, would have been on day 73 of refusing food, the same number of days as reached by the Irish republican hunger striker Kieran Doherty, who survived the longest of 10 men who died in a 1981 action. The earliest death among the Irish republicans was after 46 days, raising fears about the risk to life of the prisoners in jail awaiting trial for offences relating to protests claimed by Palestine Action. Continue reading...","source":"The Guardian"},{"title":"Police chief behind Maccabi Tel Aviv ban clings to job despite home secretary wanting him to quit","link":"https://www.theguardian.com/football/2026/jan/14/police-chief-behind-maccabi-tel-aviv-ban-clings-to-job-despite-home-secretary-wanting-him-to-quit","date":"Wed, 14 Jan 2026 20:50:49 GMT","desc":"Shabana Mahmood has lost confidence in Craig Guildford over his force’s ‘exaggerated and untrue’ intelligence assessments Explainer: What did West Midlands police chief get wrong in decision to ban Maccabi fans? The police chief who used “exaggerated and untrue” intelligence to justify a ban on Israeli football fans was clinging on to his job on Wednesday despite the home secretary demanding he resign. Craig Guildford, who leads West Midlands police, is determined to stay in his post for now, the Guardian has learned, despite a war of words that culminated in Shabana Mahmood declaring she had lost confidence in him. Continue reading...","source":"The Guardian"},{"title":"Labour MPs could rebel over Hillsborough law after talks with families break down","link":"https://www.theguardian.com/politics/2026/jan/14/labour-mps-might-rebel-over-hillsborough-law-after-talks-with-families-break-down","date":"Wed, 14 Jan 2026 20:03:26 GMT","desc":"Families are concerned about possibility for intelligence services to veto officers giving evidence after disasters Keir Starmer is facing the prospect of Labour MPs rebelling on his manifesto-promised Hillsborough law after talks broke down with families over how the duty of candour would apply to serving intelligence officers. Starmer was introduced at last year’s Labour conference by Margaret Aspinall, whose son James, 18, was one of the 97 people killed in the 1989 Hillsborough disaster. She praised him for pushing forward with the bill after months of arguments over its future. Continue reading...","source":"The Guardian"},{"title":"Amazon to close Milton Keynes fulfilment centre, affecting 590 workers","link":"https://www.theguardian.com/technology/2026/jan/14/amazon-to-close-uk-fulfilment-centre-affecting-590-workers","date":"Wed, 14 Jan 2026 19:27:15 GMT","desc":"The site was the UK’s first Amazon warehouse and staff will be offered a transfer to a new Northampton site or elsewhere Amazon is planning to close one of its UK fulfilment centres, offering workers the chance to transfer to another site. The company announced a consultation on a proposal to close the site in Milton Keynes, which was the first Amazon centre to open in the UK, in 1998. Continue reading...","source":"The Guardian"},{"title":"Keir Starmer denies change to digital ID plan is yet another U-turn","link":"https://www.theguardian.com/politics/2026/jan/14/keir-starmer-denies-roll-back-of-digital-ids-is-yet-another-u-turn","date":"Wed, 14 Jan 2026 19:15:14 GMT","desc":"No 10 says ditching of key plank of plan is technical tweak after Kemi Badenoch targeted Starmer over issue at PMQs Keir Starmer has rejected the claim that his change of plan over digital IDs represents another U-turn, as the prime minister faced accusations from the Conservatives that his government had “no sense of direction”. Late on Tuesday it emerged that a key plank of the controversial plan for digital IDs was being rolled back , with a proposal to make the document mandatory for people to show their right to work being dropped, with other forms of identification being allowed instead, for example a passport with a digital chip or e-visa. Continue reading...","source":"The Guardian"},{"title":"Bears under California homes go from one-off to trend","link":"https://www.theguardian.com/us-news/2026/jan/14/another-bear-crawlspace-altadena","date":"Wed, 14 Jan 2026 21:02:25 GMT","desc":"It’s unclear whether bear removed from Altadena house is same one seen under other homes Last week, it appeared the the saga of a black bear that had captivated the Los Angeles community of Altadena for months had come to an end: the Bear League, a Lake Tahoe-based non-profit, was able to successfully remove a 550lb black bear that had been living in a crawlspace under Ken Johnson’s home in Altadena since late November. This week, however, reports emerged of bears appearing under other homes. Continue reading...","source":"The Guardian"},{"title":"The full list of 75 countries where Trump is suspending visa processing","link":"https://www.theguardian.com/us-news/2026/jan/14/full-list-75-countries-visa-processing-suspended","date":"Wed, 14 Jan 2026 21:02:02 GMT","desc":"The Trump administration indefinitely suspended immigrant visa processing from 75 countries – see which nations have been affected Full story: Trump administration halts visa processing from 75 countries The Trump administration has indefinitely suspended immigrant visa processing for people from 75 countries, marking one of its most expansive efforts yet to restrict legal pathways to the United States. The freeze, which takes effect on 21 January, targets applicants officials deem likely to become a “public charge” – people who they believe may rely on government benefits for basic needs. Afghanistan Albania Algeria Antigua and Barbuda Armenia Azerbaijan Bahamas Bangladesh Barbados Belarus Belize Bhutan Bosnia and Herzegovina Brazil Myanmar Cambodia Cameroon Cape Verde Colombia Côte d’Ivoire Cuba Democratic Republic of the Congo Dominica Egypt Eritrea Ethiopia Fiji The Gambia Georgia Ghana Grenada Guatemala Guinea Haiti Iran Iraq Jamaica Jordan Kazakhstan Kosovo Kuwait Kyrgyzstan Laos Lebanon Liberia Libya North Macedonia Moldova Mongolia Montenegro Morocco Nepal Nicaragua Nigeria Pakistan Republic of the Congo Russia Rwanda St Kitts and Nevis St Lucia St Vincent and the Grenadines Senegal Sierra Leone Somalia South Sudan Sudan Syria Tanzania Thailand Togo Tunisia Uganda Uruguay Uzbekistan Yemen Continue reading...","source":"The Guardian"},{"title":"Half of Americans think ICE is making cities less safe, poll finds – live","link":"https://www.theguardian.com/us-news/live/2026/jan/14/us-politics-live-latest-news-updates-supreme-court-donald-trump-tariffs-jd-vance-greenland","date":"Wed, 14 Jan 2026 20:55:12 GMT","desc":"Fifty-six percent of Americans said fatal shooting of Renee Good was an inappropriate use of force, survey by CNN finds Donald Trump repeated his threat to withhold federal funding to sanctuary cities on Truth Social today. “ALL THEY DO IS BREED CRIME AND VIOLENCE! If States want them, they will have to pay for them!,” the president wrote in a post. Continue reading...","source":"The Guardian"},{"title":"Anti-Trump US reporter says she was offered job at ICE after ‘minimal vetting’","link":"https://www.theguardian.com/us-news/2026/jan/14/slate-reporter-ice-job-offer","date":"Wed, 14 Jan 2026 20:44:48 GMT","desc":"Slate journalist Laura Jedeed documented hiring process and said she got offer despite not completing paperwork A reporter has become embroiled in a public dispute with Immigration and Customs Enforcement (ICE) after penning an article on how she was in effect offered a position with the organization following an interview that took less than six minutes and did not require her to complete “a single signature on agency paperwork”. Her hiring, and latter claim about the hiring process, have both been challenged by the Department of Homeland Security and called a “lie”. Continue reading...","source":"The Guardian"},{"title":"California’s Highway 1 reopens after years-long closure due to landslides","link":"https://www.theguardian.com/us-news/2026/jan/14/california-highway-1-reopens-pch","date":"Wed, 14 Jan 2026 20:24:17 GMT","desc":"Scenic coastal throughfare from Los Angeles to San Francisco had been cut in tourism-reliant Big Sur area A portion of California’s scenic Highway 1, which winds through rugged cliffs along the coast and has long been a highlight for travelers admiring the ocean views, reopened on Wednesday after a years-long closure. A large section of the road in Big Sur has been cut off due to landslides since 2023, creating challenges for visitors and businesses that rely on tourism. Continue reading...","source":"The Guardian"}]